[
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>The project New grammar of contemporary standard Slovene: sources and methods aims to explore linguistic methodological foundations of a complex analysis of written and spoken Slovene. Resulting methodology and data will provide a foundation for the empirical description of Slovene and will enable several language technology applications. This analysis represents the first step towards the new descriptive corpus-based grammar of Slovene.</p>\r\n\r\n\r\n\r\n",
            "end_date": "2020-04-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630939",
                    "ime": "Bojan",
                    "priimek": "Klemenc",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630533",
                    "ime": "Marko",
                    "priimek": "Robnik Šikonja",
                    "role": "Vodja projekta"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2017-05-01 00:00:00",
            "title": "New grammar of modern standard Slovene:resources and methods"
        },
        "id": 505,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>V projektu &#187;Nova slovnica sodobne slovenščine: viri in metode&#171; želimo raziskati jezikoslovne metodološke temelje za celostne analizo sodobne pisne in govorjene slovenščine. Razvita metodologija in obsežne prosto dostopne korpusne baze podatkov bodo omogočile nove jezikovnotehnološke aplikacije. Analiza predstavlja prvi korak na poti do nove empirično zasnovane korpusne slovnice slovenskega jezika.</p>\r\n\r\n\r\n\r\n\r\n",
            "end_date": "2020-04-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630939",
                    "ime": "Bojan",
                    "priimek": "Klemenc",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630533",
                    "ime": "Marko",
                    "priimek": "Robnik Šikonja",
                    "role": "Vodja projekta"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2017-05-01 00:00:00",
            "title": "Nova slovnica sodobne standardne slovenščine: viri in metode"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Computer vision tries to replicate, at least partially, the functionality of human visual perception. Some of the many goals of visual perception is to enable our interaction with the physical world which is surrounding us, such as moving around without bumping into obstacles, grasping and touching of objects, and recognizing objects on several levels of abstraction. It has been acknowledged quite early in the progress of computer vision that to achieve these goals, the visual information must be at some point represented in terms of spatial or volumetric models since they can be directly related to the actual 3D physical space that surrounds us.</p>\r\n<p>One of the still popular volumetric part-level models where the actual 3D shape needs to be represented are superquadrics. Superquadrics are defined by a closed surface that can take up the shape of ellipsoids, cylinders, parallelopipeds, and all shapes in-between. They are popular in robotics, for example for grasp planning of previously unknown objects. </p>\r\n<p>We developed in the 1990s the state of the art method for segmentation and reconstruction of superquadrics from range images. The method is still popular and quite widely used which is testified by many citations in Google Scholar (1500 citations anytime, 100 citations since 2014).</p>\r\n<p>There were two reasons that prevented a wider use of this modeling approach in the past:</p>\r\n<p>&#167;lack or a high cost of acquiring 3D data</p>\r\n<p>&#167;iterative method of model recovery that made the method not suitable for real-time applications.</p>\r\n<p>Due to the hardware and algorithmic advances in the past decade there is now a multitude of new methods and devices to acquire 3D image data. However, the iterative nature of the original superquadric recovery method still prevents its use when real-time operation is required.</p>\r\n<p>The path to a faster method is actually quite evident-use deep neural networks which have revolutionized computer vision research in the past few years. During the last few years, Convolutional Neural Networks (CNN) are slowly but surely becoming the default method solve many computer vision related problems. CNN based computational approach in computer vision in general is very fast, can cope with large data input, and has also similarities with the way how our brains are coping with processing of visual data. </p>\r\n<p>We propose therefore in this project proposal to implement segmentation and superquadric model recovery using CNNs. As input to CNNs not only range images should be considered, but 3D point clouds in general. There are two types of applications that would benefit greatly from the results of this project:</p>\r\n<p>&#167;applications where real-time operation is required, such as in autonomous driving,</p>\r\n<p>&#167;applications where huge amounts of 3D data is generated (LiDAR, multi-image photogrammetry) and some intelligent automated processing of such data is needed.</p>\r\n<p>In the proposed project group we have ample experience with superquadric modeling since we are the authors of the state of the art method. On the other hand, we have also ample experience in developing CNN solutions for computer vision tasks. This makes us exceptionally qualified for the proposed project.</p>\r\n<p><b>Research activity</b></p>\r\n<p>Engineering sciences and technologies</p>\r\n\r\n<p><b>Range on year</b></p>\r\n<p>1,72 FTE</p>\r\n\r\n\r\n<p><b><u>Research organisations &lt;https://www.sicris.si/public/jqm/prj.aspx?lang=eng&amp;opdescr=search&amp;opt=2&amp;subopt=403&amp;code1=cmn&amp;code2=auto&amp;psize=10&amp;hits=1&amp;page=1&amp;count=&amp;search_term=J2-9228&amp;id=17293&amp;slng=&amp;order_by=&gt;</u></b></p>\r\n<p><b><u>Researchers &lt;https://www.sicris.si/public/jqm/prj.aspx?lang=eng&amp;opdescr=search&amp;opt=2&amp;subopt=402&amp;code1=cmn&amp;code2=auto&amp;psize=10&amp;hits=1&amp;page=1&amp;count=&amp;id=17293&amp;slng=&amp;search_term=J2-9228&amp;order_by=&gt;</u></b></p>\r\n\r\n<p><b>Project phases and their realization</b></p>\r\n<p>&#167;WP1: develop a CNN for recovery of single SQs </p>\r\n<p>&#167;WP2: decide in what format to input 3D data points into CNN </p>\r\n<p>&#167;WP3: generate a sufficient set of labeled learning data to train CNNs </p>\r\n<p>All three WorkPackages in the 1st year of the project are under way.</p>\r\n\r\n<p><b>Project bibliographic references</b></p>\r\n<p>&#167;SLABANJA, Jurij, MEDEN, Blaž, PEER, Peter, JAKLIČ, Aleš, SOLINA, Franc. Segmentation and reconstruction of 3D models from a point cloud with deep neural networks. V: ICT convergence powered by smart intelligence : ICTC 2018. [S. l.: s. n.]. 2018, str. 118-123, ilustr. [COBISS.SI-ID 1537994435], [Scopus up to 10. 2. 2019: no. of citations (TC): 0, pure citations (CI): 0]</p>\r\n\r\n<p><b>Financed by</b></p>\r\n<p>Slovenian Research Agency</p>\r\n<p> </p>\r\n\r\n\r\n\r\n",
            "end_date": "2021-06-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630772",
                    "ime": "Borut",
                    "priimek": "Batagelj",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630405",
                    "ime": "Aleš",
                    "priimek": "Jaklič",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630662",
                    "ime": "Peter",
                    "priimek": "Peer",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630376",
                    "ime": "Franc",
                    "priimek": "Solina",
                    "role": "Vodja projekta"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2018-07-01 00:00:00",
            "title": "Segmentation and recovery of superquadrics"
        },
        "id": 559,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Računalniški vid poskuša vsaj delno replicirati funkcionalnost človeškega vidnega zaznavanja. Eden od številnih nalog vidnega zaznavanja je omogočiti interakcijo s fizičnih okoljem, ki nas obdaja, da se lahko premikamo po prostoru brez zadevanja v ovire, da se lahko dotikamo in prijemamo predmete, ter razpoznavamo objekte na različnih stopnjah abstrakcije. Dokaj zgodaj v razvoju računalniškega vida je postalo jasno, da bi izpolnjevanje teh nalog zahtevalo, da vizualne informacije na neki določeni stopnji predstavimo v obliki prostorskih ali volumetričnih modelov, saj ti najbolj neposredno odražajo 3D strukturo prostora, ki nas obdaja. </p>\r\n<p>Eden od še vedno popularnih volumetričnih modelov na ravni perceptualnih fizičnih delov, kjer je potrebno predstaviti dejansko 3D obliko so superkvadriki. Superkvadriki so definirani s sklenjeno površino, ki lahko navzame obliko elipsoidov, valjev in paralepipedov, ter vseh vmesnih oblik. Superkvadriki so popularni zlasti v robotiki za načrtovanje oprijemov predhodno neznaniih predmetov.</p>\r\n<p>V 1990-tih smo razvili še danes aktualno metodo za segmentacijo in rekonstrukcijo superkvadrikov iz globinskih slik. Popularnost in razširjenost metode je moč razbrati iz citatov v Google učenjaku (1500 citatov kadarkoli, 100 citatov po 2014).</p>\r\n<p>Dva razloga pa sta preprečevala v preteklosti širšo uporabo te naše metode:</p>\r\n<p>&#167;pomanjkanje in visoka cena pridobivanje 3D slikovnih podatkov,</p>\r\n<p>&#167;iterativna metoda rekonstrukcije modelov, kar je naredilo metodo neprimerno za aplikacije, ki delujejo v realnem času.</p>\r\n<p>Medtem ko je zaradi tehnološkega napredka v zadnjem desetletju na voljo veliko različnih metod in naprav za pridobivanje 3D slikovnih podatkov, pa iterativna narava metode še vedno preprečuje njeno uporabo v realnem času.</p>\r\n<p>Pot k hitrejši metodi pa je dokaj očitna - uporaba globokih nevronskih mrež, ki so le v par zadnjih parih letih revolucionirale raziskave v računalniškem vidu. V nekaj zadnjih letih so konvolucijske nevronske mreže (Convolutional Neural Networks - CNN) postopoma in zanesljivo postale najvažnejša metoda za reševanje problemov v računalniškem vidu. Ta novi računski pristop je zelo hiter, uporablja lahko velike količine podatkov in obstajajo tudi podobnosti z načinom, kako naši možgani procesirajo vizualne podatke. </p>\r\n<p>V tem projektu torej predlagamo implementacijo segmentacije in rekonstrukcije superkvadrikov s pomočjo globokih nevronskih mrež (CNN). Kot vhodni podatki v CNN ne smejo služiti le globinske slike, ampak oblaki 3D točk nasploh. Dve vrsti aplikacij bi imele precejšnjo korist od rezultatov tega projekta:</p>\r\n<p>&#167;aplikacije, kjer je nujno procesiranje v realnem času, kot je na primer avtonomna vožnja,</p>\r\n<p>&#167;aplikacije, kjer se generira ogromne količine 3D podatkov (LiDAR, večslikovna fotogrametrija) in je potrebna inteligentna avtomatizacija obdelave teh podatkov.</p>\r\n<p>V predlagani projektni skupini imamo ogromno izkušenj z supekvadričnim modeliranjem, saj smo avtorji aktualne metode. Po drugi strani, pa imamo tudi ogromno izkušenj z razvojem CNN rešitev nalog v računalniškem vidu. To dvoje nas izjemno kvalificira za predlagani projekt.</p>\r\n\r\n<p><b>Veda</b></p>\r\n<p>Tehnika</p>\r\n\r\n<p><b>Letni obseg</b></p>\r\n<p>1,72 FTE</p>\r\n<p> </p>\r\n<p><b><u>Sodelujoče raziskovalne organizacije &lt;https://www.sicris.si/public/jqm/prj.aspx?lang=slv&amp;opdescr=search&amp;opt=2&amp;subopt=403&amp;code1=cmn&amp;code2=auto&amp;psize=10&amp;hits=1&amp;page=1&amp;count=&amp;id=17293&amp;slng=&amp;search_term=J2-9228&amp;order_by&gt;</u></b></p>\r\n\r\n\r\n<p><b><u>Sestava projektne skupine &lt;https://www.sicris.si/public/jqm/prj.aspx?lang=slv&amp;opdescr=search&amp;opt=2&amp;subopt=402&amp;code1=cmn&amp;code2=auto&amp;psize=10&amp;hits=1&amp;page=1&amp;count=&amp;id=17293&amp;slng=&amp;search_term=J2-9228&amp;order_by&gt;</u></b></p>\r\n\r\n<p><b>Faze projekta</b></p>\r\n<p>&#167;WP1: razvij CNN za rekonstrukcijo posameznih SQ </p>\r\n<p>&#167;WP2: določi ustrezen format 3D točk za vhod v CNN </p>\r\n<p>&#167;WP3: generiraj zadostno število učnih primerov za učenje CNN </p>\r\n<p>Vsi trije delovni paketi načrtovani za prvo leto projekta se uspešno izvajajo.</p>\r\n\r\n<p><b>Bibliografske reference projekta</b></p>\r\n<p>&#167;SLABANJA, Jurij, MEDEN, Blaž, PEER, Peter, JAKLIČ, Aleš, SOLINA, Franc. Segmentation and reconstruction of 3D models from a point cloud with deep neural networks. V: ICT convergence powered by smart intelligence : ICTC 2018. [S. l.: s. n.]. 2018, str. 118-123, ilustr. [COBISS.SI-ID 1537994435], [Scopus up to 10. 2. 2019: no. of citations (TC): 0, pure citations (CI): 0] </p>\r\n\r\n<p><b>Financerji</b></p>\r\n<p>Javna agencija za raziskovalno dejavnost Republike Slovenije</p>\r\n\r\n",
            "end_date": "2021-06-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630772",
                    "ime": "Borut",
                    "priimek": "Batagelj",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630405",
                    "ime": "Aleš",
                    "priimek": "Jaklič",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630662",
                    "ime": "Peter",
                    "priimek": "Peer",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630376",
                    "ime": "Franc",
                    "priimek": "Solina",
                    "role": "Vodja projekta"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2018-07-01 00:00:00",
            "title": "Segmentacija in rekonstrukcija superkvadričnih modelov iz 3D podatkov s pomočjo nevronske mreže"
        }
    }
]