[
  {
    "abbreviation": "LASPP",
    "description": {
      "en": "Our main research topics include development of adaptive algorithms in areas of artificial neural networks, data clustering, data mining, information-theoretic modelling and reinforcement learning, and design of computer systems, ranging from high performance computing to on-chip designs. We are mainly focused on problems where the lack of theoretical knowledge prevents exact solutions and where special software and hardware are demanded for efficient processing. We are also involved in digital logic design of arithmetic circuits, processing on GPUs, and smart wireless sensor networks. More recently, the laboratory is engaged also in experimental research in the field of wireless networks, radio-based localisation and software-defined radio.",
      "sl": "Raziskovalno delo v laboratoriju je osredotočeno na razvoj adaptivnih algoritmov za potrebe mehkega računanja in podatkovnega rudarjenja in na načrtovanje računalniških sistemov. Smo aktivni pri načrtovanju hitrih in energijsko učinkovitih aritmetičnih vezij, pri programiranju časovno zahtevnih algoritmov na GPE in pri učinkoviti izrabi heterogenih sistemih. Razvijamo tudi pametna brezžična senzorska omrežja, ki jih poskušamo izboljšati s prepletanjem računalniških procesov. Rezultati našega dela so vključeni v številne izdelke po vsem svetu."
    },
    "id": 1,
    "title": {
      "en": "Laboratory for Adaptive Systems and Parallel Processing",
      "sl": "Laboratorij za adaptivne sisteme in paralelno procesiranje"
    }
  },
  {
    "abbreviation": "LA",
    "description": {
      "en": "We conduct research in the areas of approximation and randomised algorithms, linear algebra (matrix multiplication), combinatorial optimisation (routing, problems on graphs, issues regarding the robustness of a facility location), parallel computation (algorithm mapping and scheduling, algorithms in parallel systems, hardware supported multithreading, dataflow computing), algorithm engineering and experimental algorithmics (boosting algorithm efficiency in practice), compiler design (parsing methods, attribute grammars), operating system design, grid computing (data replication on data grids), as well as computability and complexity theory.",
      "sl": "V laboratoriju izvajamo raziskave s področij aproksimacijskih in verjetnostnih algoritmov, algoritmov linearne algebre, kombinatorične optimizacije (npr. usmerjanje podatkov v grafih, porazdeljevanje virov v grafih, itd.),  vzporednega računanja (npr. preslikavanje in razvrščanje algoritmov na rač. arhitekturah, uporaba večnitnosti, podatkovno-pretokovno računanje), prevajalnikov (npr. sintaksni analizatorji),  razvoja operacijskih sistemov, grid računanja (npr. replikacija podatkov) ter nasploh izračunljivosti in računske zahtevnosti."
    },
    "id": 2,
    "title": {
      "en": null,
      "sl": "Laboratorij za algoritmiko"
    }
  },
  {
    "abbreviation": "LAPS",
    "description": {
      "en": null,
      "sl": null
    },
    "id": 3,
    "title": {
      "en": "Laboratory for Architecture and Signal Processing",
      "sl": "Laboratorij za arhitekturo in procesiranje signalov"
    }
  },
  {
    "abbreviation": "BIOLAB",
    "description": {
      "en": "The laboratory carries out research in data mining, machine learning, data visualization, big data analysis and data fusion. We apply computational methods to solve practical problems and focus on systems biology, biomedicine and natural sciences. The laboratory is developing Orange, a comprehensive suite that joins machine learning and visual programming, and collaborates in development of cool interactive web-based data exploration platforms like dictyExpress.",
      "sl": "Laboratorij za bioinformatiko se ukvarja s podatkovno analitiko, strojnim učenjem in zlivanjem podatkov. Razvite tehnike uporablja predvsem v bioinformatiki (odtod tudi ime): raziskuje pristope umetne inteligence za iskanje odgovorov na vprašanja s področja sistemske biologije, funkcijske genomike in biomedicine. Laboratorij razvija tudi programsko opremo, kot je Orange za analizo in vizualizacijo podatkov ter dictyExpress za analizo genske ekspresije."
    },
    "id": 4,
    "title": {
      "en": "Bioinformatics Laboratory",
      "sl": "Laboratorij za bioinformatiko"
    }
  },
  {
    "abbreviation": "LBRSO",
    "description": {
      "en": "The laboratory conducts research in the field of biomedical signal and imaging data. Our research includes describing physiological phenomena, modelling physiologic relationships, graphically displaying anatomic details and physiologic functions, visualising biomedical signals, developing standardised databases, developing detection and recognition techniques, evaluating the performance of recognition techniques, analysing bioelectric patterns, and developing performance measures and protocols, biomedical information technologies and software.",
      "sl": "Laboratorij je vključen v temeljne raziskave povezane z biomedicinskimi signali in  slikami. Glavni raziskovalni cilji so: razumevanje in opisovanje fizioloških fenomenov, grafično prikazovanje anatomskih detajlov in fizioloških funkcij in razmerij, vizualizacija biomedicinskih signalov in slik, razvoj standardiziranih podatkovnih baz z namenom študije fizioloških mehanizmov in vrednotenja zmogljivosti ter robustnosti razpoznavalnih tehnik, postavljanje kriterijev detekcije in razpoznavalnih tehnik za avtomatsko analizo bioelektričnih vzorcev, itd."
    },
    "id": 5,
    "title": {
      "en": "Laboratory for Biomedical Computer Systems and Imaging",
      "sl": "Laboratorij za biomedicinske računalniške sisteme in oslikave"
    }
  },
  {
    "abbreviation": "LeM",
    "description": {
      "en": "The laboratory focuses on advanced (lightweight) communications (e.g. the Internet of Things), security, privacy, e-business, and human factor modelling. Our research devotes particular attention to the analysis and design of advanced systems (from PKI to critical infrastructures), cryptographic protocols, advanced security and privacy analytics (e.g., big data methods for searching for precursory signals), and the quantitative treatment of the human factor. We have patented lightweight cryptographic protocols and developed practical (industry relevant) food supply chain management solutions based on RFIDs.",
      "sl": "Laboratorij za e-Medije se ukvarja z raziskavami na področjih elektronskega poslovanja, varnosti in zasebnosti ter zvočnega procesiranja. Na prvem področju to vključuje tako poslovne kot tehnološke vidike digitalne transformacije. Na drugem področju raziskave vključujejo kriptografske protokole, varnostne arhitekture in varnost ter zasebnost v informacijskih sistemih. Pri zvočnem procesiranju pa je fokus trenutno na digitalni umetnosti. Raziskovalne aktivnosti zajemajo še modeliranje človeškega dejavnika z razvojem rešitev, ki podpirajo sprejemanje odločitev pri upravljanju informacijskih sistemov in kritičnih infrastruktur. Rezultati naših raziskav so implementirani v okviru mnogih projektov (med katerimi so tudi mednarodno nagrajeni projekti s področja kritičnih infrastruktur), nadalje so rezultati raziskav privedli do implementacije upravljanja oskrbovalnih verig v prehrambnem sektorju, patenta ter objav v najuglednejših znanstvenih revijah."
    },
    "id": 6,
    "title": {
      "en": "Laboratory of e-media",
      "sl": "Laboratorij za e-medije"
    }
  },
  {
    "abbreviation": "LI",
    "description": {
      "en": "The focus of the research here includes software development methodologies and business process evaluation. We offer efficient approaches to the evaluation of information systems, specific information solutions and specific IT related processes. The approaches break down IT products or IT processes into key elements and evaluate them through a comprehensive set of criteria. We have excellent references in the areas of information system strategic planning and context aware applications, where we have developed a context engine prototype.",
      "sl": "Glavne raziskovalne aktivnosti laboratorija vključujejo: (1) Metodologije razvoja programske opreme in evalvacijo poslovnih procesov: zasnovali smo sodobne in učinkovite metode za evalvacijo informacijskih sistemov, obvladovanje sprememb v informacijskem sistemu in obvladovanje odpora končnih uporabnikov pri IT projektih; (2) Strateško planiranje informatike: s tega področja imamo veliko izkušenj in referenc. (3) Kontekstno odvisne aplikacije: Razvili smo prototip kontekstnega strežnika in nameravamo nadaljevati z raziskavami na tem področju."
    },
    "id": 7,
    "title": {
      "en": "Information Systems Laboratory",
      "sl": "Laboratorij za informatiko"
    }
  },
  {
    "abbreviation": "LIIS",
    "description": {
      "en": "The laboratory has established strong foundation in service computing, cloud computing, digital transformation and conducts research in the field of the integration and interoperability of applications, cloud-native architectures, microservices and APIs, devices, information systems, architectures and platforms. We focus on software architectures, platforms, design patterns. We work on technologies for the execution, monitoring and optimization of business processes and on IoT integration and mobility issues, including novel localization, authentication and gait analysis algorithms.",
      "sl": "V laboratoriju raziskujemo na področju integracije in interoperabilnosti aplikacij, naprav, informacijskih sistemov, arhitektur in platform. Osredotočamo se predvsem na programske platforme, kot so Java EE, HTML5, SOA, ukvarjamo pa se tudi z orkestracijo, upravljanjem API-jev, elastičnostjo, s PaaS, SaaS,  IaaS, itd. Raziskujemo tehnologije, ki omogočajo izvedbo, spremljanje in optimizacijo poslovnih procesov. Vključeni smo v razvoj platform FI-WARE. Raziskave osredotočamo tudi na integracijo z napravami IoT in raziskavami, povezanimi z mobilnostjo rešitev."
    },
    "id": 8,
    "title": {
      "en": "Laboratory for Integration of Information Systems",
      "sl": "Laboratorij za integracijo informacijskih sistemov"
    }
  },
  {
    "abbreviation": "LKM",
    "description": {
      "en": "The laboratory apursuesresearch in machine learning, neural networks, statistics, image, text and data mining. Recent research has been related to the generation of semi-artificial data, the analysis of big data with the MapReduce approach, evaluating the reliability of single models’ predictions, text summarisation using archetypal analysis, web-user profiling, applying evolutionary computation to data mining, spatial data mining with multi-level directed graphs, bottom-up inductive logic programming, heuristic search methods in clickstream mining, multi-view learning, mining of heterogeneous networks and e-learning.",
      "sl": "V LKM raziskujemo področja podatkovnega rudarjenja, nevronskih mrež, umetne inteligence, analize velikih podatkovnih baz, analize podatkovnih tokov, večina raziskav pa zajema strojno učenje. Razvijamo in uporabljamo nove pristope in algoritme za modeliranje podatkov na različnih področjih. Sodelujemo z zdravniki, farmacevti, biologi ter strokovnjaki na področju športa. Naša raziskovalna podpodročja so modeliranje numeričnih, simbolnih, slikovnih, tekstovnih in prostorskih podatkov, medicinska diagnostika in prognostika, generiranje delno umetnih podatkov, itd."
    },
    "id": 9,
    "title": {
      "en": "Laboratory for Cognitive Modeling",
      "sl": "Laboratorij za kognitivno modeliranje"
    }
  },
  {
    "abbreviation": "LKRV",
    "description": {
      "en": "We focus on cryptography and computer security, discrete mathematics, coding theory and statistical design. We have extensive experience in applied cryptography, especially public key cryptosystems (elliptic curve cryptosystems), cryptographic protocols (AKC) and their implementations in restricted environments, such as smart cards (including HSM and FPGA). We also study algebraic combinatorics (distance-regular graphs, association schemes, finite geometries, codes, finite fields and the like), probability and statistics.",
      "sl": "Laboratorij deluje na področju kriptografije in računalniške varnosti. Posvečamo se tudi diskretni matematiki, teoriji kodiranja in statističnemu načrtovanju. Ukvarjamo se predvsem z uporabno kriptografijo s poudarkom na kriptosistemih z javnimi ključi (kriptosistemi z eliptičnimi krivuljami), kriptografskih protokolih in njihovih implementacijah v omejenih okoljih (pametne kartice). Pokrivamo tudi področje diskretnih struktur (konkretno, algebraično kombinatoriko, končne geometrije in obsege, optimizacijo, ...) ter področje verjetnosti in statistike."
    },
    "id": 10,
    "title": {
      "en": "Laboratory for Cryptography and Computer Security",
      "sl": "Laboratorij za kriptografijo in računalniško varnost"
    }
  },
  {
    "abbreviation": "LMMRI",
    "description": {
      "en": "We are involved in research in various spheres of continuous and discrete mathematics. On the one hand our research topics include commutative algebra, linear algebra, nonlinear dynamical systems, Brownian motion, martingales, algebraic topology, computational topology, topological data analysis and scientific computing. On the discrete side of the mathematical spectrum, however, we deal with problems in graph theory, particular the structural and colouring problems of graphs, which are also connected with problems in computational geometry.",
      "sl": "Raziskovalna področja laboratorija gredo v smeri zvezne in diskretne matematike. Raziskovalno delujemo na problemih komutativne in linearne algebre, nelinearnih dinamičnih sistemov, Brownovega gibanja in martingalov, algebraične topologije kot tudi računske topologije, uporabe topoloških metod v analizi podatkov in problemi numerične analize. Na diskretni strani matematičnega spektra raziskujemo predvsem na področju teorije grafov, natančneje nas zanimajo problemi iz strukturne in kromatične teorije grafov, tudi v povezavi  z računsko geometrijo."
    },
    "id": 11,
    "title": {
      "en": "Laboratory for Mathematical Methods in Computer and Information Science",
      "sl": "Laboratorij za matematične metode v računalništvu in informatiki"
    }
  },
  {
    "abbreviation": "LPT",
    "description": {
      "en": "Areas of interest include data acquisition, management, integration, analysis and visualisation, all within the framework of information system development, management and governance. Special interest is devoted to internet of things, big data, real-time data management, the analysis of large networks, data streams, information extraction, etc. We work closely with industry partners in developing and testing new technologies and approaches.",
      "sl": "V laboratoriju se ukvarjamo z raziskavami na področju podatkovnih tehnologij, ki vključujejo zajem, integracijo, analizo in vizualizacijo podatkov. Posebne ekspertize imamo na področju analize omrežij, zajema, iskanja in ekstrakcije podatkov s spleta, ipd. V sodelovanju z industrijskimi partnerji smo razvili številne prototipe in nove tehnologije. Pred leti smo ustanovili podjetje, ki je danes vodilno slovensko podjetje na področju detekcije goljufij v zavarovalništvu. Za svoje delo in prenos znanja v gospodarstvo smo prejeli več nagrad in priznanj."
    },
    "id": 12,
    "title": {
      "en": "Laboratory for Data Technologies",
      "sl": "Laboratorij za podatkovne tehnologije"
    }
  },
  {
    "abbreviation": "LRK",
    "description": {
      "en": "Our research is focused on communication networks and protocols, cloud architectures and services, cloud and network security, virtualization, ICT sustainability, computer supported learning systems and the use of agile methodologies. We have researched the orchestration of complex virtual environments, container orchestration, examined SDN and NFV and their use in cloud environments, and developed our own virtual cloud laboratory. Our latest project focuses on carrier-grade cloud solutions for large telco providers.",
      "sl": "Glavna raziskovalna področja so: komunikacijska omrežja in protokoli, oblačne arhitekture in storitve, varnost omrežij in oblakov, virtualizacija omrežij, infrastrukture in podatkovne shrambe, kontejnerske in unikernel tehnologije, računalniško podprta učna okolja, itd. Na področju oblačne arhitekture smo raziskovali avtomatizacijo izgradnje kompleksnih virtualnih okolij (orkestracija). Pripravljali smo orkestracijo infrastrukture vsebnikov (kontejner) za mikrostoritve in vključevanje le teh v oblake. Raziskovali smo rabo SDN/NFV in uporabo teh konceptov v oblačnih okoljih ter integracijo protokolov za upravljanje z identitetami, avtentikacijo, avtorizacijo in oddaljeno administracijo v velika produkcijska okolja in v oblačne sisteme."
    },
    "id": 13,
    "title": {
      "en": "Computer Communications Laboratory",
      "sl": "Laboratorij za računalniške komunikacije"
    }
  },
  {
    "abbreviation": "LRSS",
    "description": {
      "en": "The laboratory is focused on the computational methods for modelling, simulation and analysis of fundamentally different system families. We are interested in computational approaches in systems and synthetic biology, the analysis of coordinated behaviour in biological systems, the design of quantum-dot cellular automata processing structures, and the understanding of human behaviour through the analysis of mobile sensing data. The laboratory therefore consists of four groups, the Computational Biology Group, the Collective Behaviour Group, the Quantum-dot Cellular Automata group and the Mobile Computing Group.",
      "sl": "Raziskave laboratorija so usmerjene v računske metode za modeliranje, simulacijo in analizo bioloških sistemov s procesnimi zmožnostmi, bioloških sistemov, ki odražajo skupinsko dinamiko, in kvantnih celičnih  avtomatov (QCA). Laboratorij je tako sestavljen iz treh skupin, in sicer Skupine za računske metode v sistemski in sintezni biologiji, Skupine za skupinsko dinamiko in Skupine QCA. Rezultati našega dela so bili objavljeni v najodmevnejših znanstvenih revijah, kot sta na primer Nanotechnology in Animal Behaviour."
    },
    "id": 14,
    "title": {
      "en": "Computer Structures and Systems Laboratory",
      "sl": "Laboratorij za računalniške strukture in sisteme"
    }
  },
  {
    "abbreviation": "LRV",
    "description": {
      "en": "We research the capture, processing and interpretation of 2D and 3D visual data, machine learning in computer vision, and the use of images in computer-human interactions. We work in the following specific areas: interactive visual signage systems, 3D documentation in archaeology and cultural heritage, interpretation of images in biometry, medicine, geology and meteorology, the forensic analysis of images and video, virtual and augmented reality, as well as in the production of computer games and in new media art installations (in cooperation with the Academy of Fine Arts).",
      "sl": "Raziskujemo na področjih računalniškega vida in multimedije, posebej nas zanima zajem, obdelava in interpretacija 3D slikovnih podatkov, razumevanje in interpretacija človeškega telesa na slikah, strojno učenje v računalniškem vidu. Zanimajo nas še: interaktivni slikovni informacijski vmesniki, 3D dokumentiranje v arheologiji in kulturni dediščini, 3D modeliranje, interpretacija medicinskih slik in slik v umetnostni zgodovini, forenzična analiza slik in videa, aplikacije za učenje znakovnega jezika gluhih in produkcija novomedijskih umetniških instalacij v sodelovanju z ALU UL."
    },
    "id": 15,
    "title": {
      "en": "Computer Vision Laboratory",
      "sl": "Laboratorij za računalniški vid"
    }
  },
  {
    "abbreviation": "LGM",
    "description": {
      "en": "The laboratory performs R&D in the fields of multimedia technologies, human-computer interaction and computer graphics. Our main focus is on audio processing and music information retrieval (audio understanding, organization of music archives), interactive 3D visualization (medical imaging, games, VR/AR), and e-Learning (learning for people with disabilities, gamification). We have extensive experience in developing software solutions for desktop, mobile and cloud platforms and are active in the development of visualizations, interactive learning systems, and didactic games.",
      "sl": "V LGM se ukvarjamo z raziskavami in razvojem na področju medijskih tehnologij, komunikacije človek-računalnik in računalniške grafike. Osredotočeni smo predvsem na obdelavo zvočnih signalov in pridobivanje informacij iz glasbe (semantični opisi zvočnih posnetkov, indeksiranje, organizacija glasbenih arhivov), interaktivno 3D vizualizacijo in igre (vizualizacija v medicini) ter e-Izobraževanje. Imamo veliko izkušenj z razvojem namiznih, mobilnih in spletnih/oblačnih rešitev. Pri delu sodelujemo s partnerji pri številnih slovenskih, EU in industrijskih projektih."
    },
    "id": 17,
    "title": {
      "en": "Laboratory of Computer Graphics and Multimedia ",
      "sl": "Laboratorij za računalniško grafiko in multimedije"
    }
  },
  {
    "abbreviation": "LTPO",
    "description": {
      "en": "The laboratory is involved in teaching and research in the areas of software engineering and information systems, with an emphasis on agile software development methods (i.e. factors affecting successful adoption, agile project management, performance evaluation, the introduction of lean concepts, and similar), graph grammars and graph algorithms (parsing graph grammars, etc.), model driven development (reverse engineering, domain specific languages),  and web data mining (stochastic models for user behaviour analysis, separating interleaved web sessions, etc.).",
      "sl": "V laboratoriju raziskujemo postopke za razvoj programske opreme in informacijskih sistemov s poudarkom na agilnih metodah, grafnih gramatikah in modelno vodenem razvoju. Predmet raziskav so: Agilni razvoj programske opreme (faktorji, ki vplivajo na uspešno uvedbo agilnih metod, itd.); Grafne gramatike; Modelno voden razvoj (gradnja platformno neodvisnih modelov spletnih aplikacij s postopki obratnega inženirstva, itd.); Analiza obiskov spletnih mest (Uporaba stohastičnih modelov za analizo obnašanja uporabnikov in razpletanje prepletenih sej z uporabo hevrističnih metod)."
    },
    "id": 18,
    "title": {
      "en": "Software Engineering Laboratory",
      "sl": "Laboratorij za tehnologijo programske opreme"
    }
  },
  {
    "abbreviation": "LUVSS",
    "description": {
      "en": "The laboratory is involved in basic and applied research of visually enabled intelligent systems. We have extensive experience with visual object tracking, object detection and categorization, incremental visual learning, as well as with systems for human-robot interactive learning and the development of computer vision solutions for smart mobile devices. Our experience has been accumulated in collaboration with a variety of research partners in a number of the EU, national and industry funded projects which address these research issues.",
      "sl": "V laboratoriju se ukvarjamo s sistemi, ki uporabljajo vid za zaznavanje okolja in interakcijo z njim. Primeri takšnih sistemov so mobilni roboti, inteligentna okolja itd. Imamo izkušnje z vizualnim sledenjem predmetom, z detekcijo in kategorizacijo predmetov, z inkrementalnim učenjem na osnovi vizualne informacije, s sistemi za interakcijo med človekom in strojem. Te izkušnje smo osvojili v sodelovanju z mnogimi raziskovalnimi partnerji iz Evrope in ZDA v okviru dela na mnogih evropskih, nacionalnih ter industrijskih projektih."
    },
    "id": 19,
    "title": {
      "en": "Visual Cognitive Systems Laboratory",
      "sl": "Laboratorij za umetne vizualne spoznavne sisteme"
    }
  },
  {
    "abbreviation": "LUI",
    "description": {
      "en": "The laboratory carries out research in machine learning (particularly argument based machine learning, inductive logic programming, robot learning), qualitative reasoning with robotics applications, intelligent robotics (planning, learning for planning), machine learning in medicine, and intelligent tutoring systems (ITS for programming and game playing, automated hint generation and the automatic assessment of the level of difficulty of problems for humans).",
      "sl": "Laboratorij izvaja raziskave iz naslednjih področij: strojno učenje (posebej argumentirano strojno učenje – ABML, induktivno logično programiranje, robotsko učenje), kvalitativno sklepanje z aplikacijami v robotiki (planiranje, učenje za planiranje), aplikacije strojnega učenja v medicini, inteligentni poučevalni sistemi (za programiranje in igranje iger, avtomatsko generiranje namigov, avtomatsko ocenjevanje težavnosti problemov za ljudi)."
    },
    "id": 20,
    "title": {
      "en": "Artificial Intelligence Laboratory",
      "sl": "Laboratorij za umetno inteligenco"
    }
  },
  {
    "abbreviation": "LUSY",
    "description": {
      "en": "The prime area of research interest is efficient data handling in distributed pervasive environments, which store terabytes of data that present a challenge in at least two areas: the efficient storage and handling of the data. The distributed environment is inherently capable of parallel processing and requires a proper data and work distribution. Our research is concentrated on three areas: unstructured text handling, data deduplication and on-line streaming data processing. We are also active in the area of Computer Science Education.",
      "sl": "Osnovno raziskovalno področje laboratorija predstavlja delo s podatki v porazdeljenih okoljih, in sicer kako učinkovito hraniti več tera-bajtov podatkov in kako z njimi učinkovito rokovati. Porazdeljeno okolje samo po sebi omogoča vzporedno procesiranje, kar zahteva ustrezno porazdelitev podatkov in samega dela. Trenutno je naše raziskovanje usmerjeno na tri področja: rokovanje z nestrukturiranimi podatki, razpodvajanje podatkov in sprotno procesiranje podatkov. Delo laboratorija se širi tudi na področje poučevanja računalništva in informatike."
    },
    "id": 103,
    "title": {
      "en": "Laboratory for Ubiquitous systems",
      "sl": "Laboratorij za vseprisotne sisteme"
    }
  }
]