[
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/spela-arhar-holdt",
    "descSl": null,
    "name": "Špela Arhar Holdt",
    "linkEn": "/en/employees/spela-arhar-holdt"
  },
  {
    "descEn": "\nMarko Bajec is a Full Professor at the Faculty of Computer & Information Science, University of Ljubljana. He is the Head of the Laboratory for Data Technologies and Iot Demo Center. His research interests that primarily focus on IT and data Governance include: information retrieval, web search and extraction, data integration, data management, data analysis, software development methods, IT/IS strategy planning. In his career he has led or coordinated over 30 applied and research projects. For his contribution in transferring knowledge to industry he received several awards and recognitions.\n",
    "linkSl": "/sl/o-fakulteti/osebje/marko-bajec",
    "descSl": "\nMarko Bajec je redni profesor na Fakulteti za računalništvo in informatiko Univerze v Ljubljani ter vodja Laboratorija za podatkovne tehnologije in IoT Demo Centra. Predava več predmetov s področja informatike in podatkovnih baz. V okviru aplikativnega in raziskovalnega dela se ukvarja z obvladovanjem informatike ter uporabo podatkovnih tehnologij v okviru različnih domen, kot so internet stvari, pametna mesta, pametni domovi, oskrbovana stanovanja, telemedicina ipd.\n",
    "name": "Marko Bajec",
    "linkEn": "/en/employees/marko-bajec"
  },
  {
    "descEn": "\nI received the Ph.D. in Computer Science from Faculty of Computer and Information Science, University of Ljubljana in Fabruary, 2007. My research areas are pattern recognition, computer vision, and machine learning, with an emphasis on biometrics and face recognition.\n",
    "linkSl": "/sl/o-fakulteti/osebje/borut-batagelj",
    "descSl": "\nSem asistent na  Fakulteti za računalništvo in informatiko Univerze v Ljubljani in član Laboratorija za računalniški vid.\r\nLeta 2007 sem doktoriral na področju iskanja in prepoznavanja obrazov z naslovom doktorske disertacije:  Prepoznavanje človeških obrazov s pomočjo hibridnega sistema, leta 2004 magistriral na temo: Iskanje obrazov na osnovi barv s pomočjo statističnih metod razpoznavanja vzorcev in leta 2001 diplomiral na temo: Sistem za aktivno opazovanje žive slike na internetu.\r\nRaziskovalno delam na področju umetne inteligence, strojnega učenja in razpoznavanja vzorcev. V okviru raziskav me še posebej zanimajo metode za iskanje, prepoznavanje in kategorizacijo človeških obrazov na slikah.\nSem aktivni član društva za povezovanje umetnosti in znanosti - ArtNetLab in član slovenskega društva razpoznavanja vzorcev - SDRV.\nZanima me tudi interaktivna računalniška umetnost in v tem okviru sem soavtor instalacije: 15 sekund slave in sistema za virtualno smučanje.\n",
    "name": "Borut Batagelj",
    "linkEn": "/en/employees/borut-batagelj"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/urban-baumkirher",
    "descSl": null,
    "name": "Urban Baumkirher",
    "linkEn": "/en/employees/urban-baumkirher"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/katarina-bebar",
    "descSl": null,
    "name": "Katarina Bebar",
    "linkEn": "/en/employees/katarina-bebar"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/miha-bejek",
    "descSl": null,
    "name": "Miha Bejek",
    "linkEn": "/en/employees/miha-bejek"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/aljosa-besednjak",
    "descSl": null,
    "name": "Aljoša Besednjak",
    "linkEn": "/en/employees/aljosa-besednjak"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/jasna-bevk",
    "descSl": null,
    "name": "Jasna Bevk",
    "linkEn": "/en/employees/jasna-bevk"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/janez-bindas",
    "descSl": null,
    "name": "Janez Bindas",
    "linkEn": "/en/employees/janez-bindas"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/neli-blagus",
    "descSl": "\nNeli Blagus je mlada raziskovalka na Univerzi v Ljubljani, Fakulteti za Računalništvo in Informatiko, kjer opravlja tudi podiplomski študijski program Računalništvo in Informatika. Leta 2010 je zaključila dodiplomski Interdisciplinarni študij Računalništvo in Matematika.\n \n",
    "name": "Neli Blagus",
    "linkEn": "/en/employees/neli-blagus"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/marko-boben",
    "descSl": "\nAsistent na Fakulteti za računalništvo in informatiko.  \nIzobrazba\nuniv. dipl. mat.\n",
    "name": "Marko Boben",
    "linkEn": "/en/employees/marko-boben"
  },
  {
    "descEn": "\nI am an assistant and  researcher in Laboratory for computer graphics and multimedia. My research includes fields of computer graphics, user interfaces, human computer interaction, multi-touch, music information retrieval, ...\n",
    "linkSl": "/sl/o-fakulteti/osebje/ciril-bohak",
    "descSl": "\nSem asistent in raziskovalec v Laboratoriju za računalniško grafiko in multimedije. Raziskujem na področju računalniške grafike, uporabniških vmesnikov, uporabe kretenj v računalništvu, večdotični (multi-touch) vmesniki ...\n",
    "name": "Ciril Bohak",
    "linkEn": "/en/employees/ciril-bohak"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/alenka-bone",
    "descSl": null,
    "name": "Alenka Bone",
    "linkEn": "/en/employees/alenka-bone"
  },
  {
    "descEn": "\nZoran Bosnić works as a full professor at Artificial Intelligence Department in the Laboratory for Cognitive Modelling. He gives lectures on the following courses: Computer Networks, Functional Programming, and also lectures several classes at the doctoral studies. His research work combines advanced statistical methods with useful application areas such as mining from data streams, recommender systems, user behaviour profiling, e-learning systems and computer communications.\nEDUCATION\n2001 - B.Sc. degree from the Faculty of Computer and Information Science, University of Ljubljana, Slovenia\n2003 - M.Sc. degree from the Faculty of Computer and Information Science, University of Ljubljana, Slovenia\n2007 - Ph.D. degree from the Faculty of Computer and Information Science, University of Ljubljana, Slovenia\n",
    "linkSl": "/sl/o-fakulteti/osebje/zoran-bosnic",
    "descSl": "\nZoran Bosnić je zaposlen na Katedri za umetno inteligenco, v Laboratoriju za kognitivno modeliranje. Na fakulteti predava Računalniške komunikacije, Funkcijsko programiranje, sodeluje pa tudi pri izvajanju predmetov na doktorskem študiju. Na raziskovalnem področju se ukvarja s strojnim učenjem, regresijskim napovedovanjem, učenjem iz podatkovnih tokov, e-učenjem in priporočilnimi sistemi.\nIzobrazba\n2001 - dokončal univerzitetni študij RI na FRI\n2003 - zaključil magistrski študij na FRI\n2007 - pridobil doktorat znanosti na FRI\n",
    "name": "Zoran Bosnić",
    "linkEn": "/en/employees/zoran-bosnic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/narvika-bovcon",
    "descSl": null,
    "name": "Narvika Bovcon",
    "linkEn": "/en/employees/narvika-bovcon"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/borja-bovcon",
    "descSl": null,
    "name": "Borja Bovcon",
    "linkEn": "/en/employees/borja-bovcon"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/franc-branko-mocnik",
    "descSl": null,
    "name": "Franc Branko Močnik",
    "linkEn": "/en/employees/franc-branko-mocnik"
  },
  {
    "descEn": "\nIvan Bratko is professor of computer science at University of Ljubljana. He has B.Sc. and M.Sc. degrees in electrical engineering, and a Ph.D. degree in computer science, all from the University of Ljubljana. He is head of Artificial intelligence Laboratory, Faculty of Computer and Information Sc. of Ljubljana University. Until 2002, professor Bratko also directed the AI group at J. Stefan Institute in Ljubljana.\nProfessor Bratko has conducted research in machine learning, knowledge-based systems, qualitative modelling, intelligent robotics, heuristic programming and computer chess. His main interests in machine learning have been in learning from noisy data, combining learning and qualitative reasoning, constructive induction, Inductive Logic Programming and various applications of machine learning, including medicine and control of dynamic systems.\nProfessor Bratko has published over 200 scientific papers and a number of books, including Prolog Programming for Artificial Intelligence (Addison-Wesley/Pearson Education, third edition, 2001), KARDIO: a Study in Deep and Qualitative Knowledge for Expert Systems (MIT Press, 1989; co-authored by I. Mozetič and N. Lavrač), and Machine Learning and Data Mining: Methods and Applications (Wiley, 1998; co-edited by R.S. Michalski and M. Kubat).\nHe has been member of the editorial boards of a number of scientific journals, including Artificial Intelligence, Machine Learning, Journal of AI Research, Journal of ML Research, and KAIS (Journal of Knowledge and Information Systems). He was one of the founders and the first chairman of SLAIS (Slovenian AI Society) and chairman of ISSEK, International School for the Synthesis of Expert Knowledge, based in Udine, Italy. He is member of SAZU (Slovene Academy of Arts and Sciences) and a Fellow of ECCAI.\nHe has been visiting professor or visiting scientist at various universities, including Edinburgh University, Strathclyde University, Sydney University, University of New South Wales, Polytechnic University of Madrid, University of Klagenfurt, Delft University of Technology.\n",
    "linkSl": "/sl/o-fakulteti/osebje/ivan-bratko",
    "descSl": "\nProf. Bratko je predstojnik laboratorija za Umetno inteligenco na Fakulteti za računalništvo in informatiko, do leta 2002 pa je vodil tudi Odsek za inteligentne sisteme na Inštitutu Jožef Stefan. Njegova področja raziskovanja so strojno učenje, kvalitativno modeliranje, inteligentna robotika, hevristično programiranje in programi za igranje šaha. V strojnem učenju se posveča predvsem učenju iz šumnih podatkov, povezovanju učenja in kvalitativnega sklepanja, konstruktivno indukcijo, induktivnim logičnim programiranjem in aplikacijami strojnega učenja, med drugim v medicini in vodenju dinamičnih sistemov.\nProf. Bratko je avtor več kot 200 znanstvenih člankov in številnih knjig, med njimi Prolog Programming for Artificial Intelligence (Addison-Wesley/Pearson Education, third edition, 2001), KARDIO: a Study in Deep and Qualitative Knowledge for Expert Systems (MIT Press, 1989; s soavtorji I. Mozetič in N. Lavrač) in Machine Learning and Data Mining: Methods and Applications (Wiley, 1998; sourednika R.S. Michalski in M. Kubat).\nProf. Bratko je član uredniških odborov številnih znanstvenih revij, kot so  Artificial Intelligence, Machine Learning, Journal of AI Research, Journal of ML Research, in KAIS (Journal of Knowledge and Information Systems). Je eden od ustanoviteljev in prvi predsednik SLAIS (Slovenian AI Society) in predsednik ISSEK, International School for the Synthesis of Expert Knowledge, ki ima sedež v Vidmu v Italiji. Je član SAZU (Slovenska akademija znanosti in umetnosti) in ECCAI.\nKot gostujoči profesor ali raziskovalec je deloval na različnih univerzah, med drugim na Edinburgh University, Strathclyde University, Sydney University, University of New South Wales, Polytechnic University of Madrid, University of Klagenfurt, Delft University of Technology.\n",
    "name": "Ivan Bratko",
    "linkEn": "/en/employees/ivan-bratko"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/andrej-brodnik",
    "descSl": "\nGlej/see http://lusy.fri.uni-lj.si.\n",
    "name": "Andrej Brodnik",
    "linkEn": "/en/employees/andrej-brodnik"
  },
  {
    "descEn": "\nHe currently holds the position of associate professor on the Faculty of Computer and Information Science, University of Ljubljana, Slovenia. His research interests include computer architecture and organization, parallel processing, computer arithemtic, embedded systems and digital design.\n",
    "linkSl": "/sl/o-fakulteti/osebje/patricio-bulic",
    "descSl": "\nNa Fakulteti za računalništvo in informatiko predavam pri predmetih Organizacija računalniških sistemov (2. letnik UNI), Digitalno načrtovanje (3. letnik UNI), Vgrajeni sistemi (3. letnik VSP) in Vzporedni in porazdeljeni sistemi in algortmi (3. letnik VSP). Raziskovalno se ukvarjam z arhitekturo in organizacijo računalnikov, računalniško aritmetiko, vgrajenimi sistemi, paralelnimi računalniki ter razvojem digitalnih sistemov. \nIzobrazba\n1998 - univ. dipl. inž. el., FE UNI-LJ\n2001 - mag. rač. in inf., FRI UNI-LJ\n2004 - dr. rač. in inf., FRI, UNI-LJ\n",
    "name": "Patricio Bulić",
    "linkEn": "/en/employees/patricio-bulic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/mojca-ciglaric",
    "descSl": null,
    "name": "Mojca Ciglarič",
    "linkEn": "/en/employees/mojca-ciglaric"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/jaka-cijan",
    "descSl": null,
    "name": "Jaka Cijan",
    "linkEn": "/en/employees/jaka-cijan"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/zala-cimperman",
    "descSl": null,
    "name": "Zala Cimperman",
    "linkEn": "/en/employees/zala-cimperman"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/tomaz-curk",
    "descSl": "\nNa FRI predavam bioinformatiko in strojno učenje. Raziskovalno se ukvarjam predvsem z bioinformatiko, kjer je uporaba metod strojnega učenja ključna za uspešno obvladovanje in odkrivanje znanj iz obsežnih bioloških zbirk podatkov.\n",
    "name": "Tomaž Curk",
    "linkEn": "/en/employees/tomaz-curk"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/jernej-cvek",
    "descSl": null,
    "name": "Jernej Cvek",
    "linkEn": "/en/employees/jernej-cvek"
  },
  {
    "descEn": "\nHello, I am Luka Čehovin. I am an assistant professor and a researcher at the Visual Cognitive Systems Lab.\n \nResearch interests\n\nhuman-computer interaction\nmotion perception understanding\ncomputer graphics\n\n",
    "linkSl": "/sl/o-fakulteti/osebje/luka-cehovin-zajc",
    "descSl": "\nSem docent ter raziskovalec v Laboratoriju za umetne vizualne spoznavne sisteme.\n \nRaziskovalni interesi\n\ninterakcija človek-računalnik\nrazumevanje dojemanja gibanja\nračunalniška grafika\n\n",
    "name": "Luka Čehovin Zajc",
    "linkEn": "/en/employees/luka-cehovin-zajc"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/rok-cesnovar",
    "descSl": null,
    "name": "Rok Češnovar",
    "linkEn": "/en/employees/rok-cesnovar"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/jaka-cibej",
    "descSl": null,
    "name": "Jaka Čibej",
    "linkEn": "/en/employees/jaka-cibej"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/uros-cibej",
    "descSl": "\nUroš Čibej je asistent na Fakulteti za računalništvo in informatiko. Poučuje predmete Teoretične osnove računalništva 1, Teorija izračunljivosti, Algoritmi in podatkovne stukture 2, Teoretične osnove računalništva 2 in Osnove programiranja 2. Področja njegovega raziskovanja so: porazdeljeni sistemi, teorija razmeščanja, teorija zahtevnosti, aproksimativni, verjetnosti in porazdeljeni algoritmi.\n",
    "name": "Uroš Čibej",
    "linkEn": "/en/employees/uros-cibej"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/andrej-copar",
    "descSl": "\nSem mladi raziskovalec v Laboratoriju za bioinformatiko pod mentorstvom  prof. dr. Blaža Zupana. Ukvarjam se z razvojem metod na področju strojnega učenja, s poudarkom na paralelni matrični faktorizaciji in zlivanjem podatkov.\nNajdete me lahko v sobi R3.22.\n",
    "name": "Andrej Čopar",
    "linkEn": "/en/employees/andrej-copar"
  },
  {
    "descEn": "\nI research machine learning, data mining, with emphasis on data visualization, and I know some statistics. I spend most of my time programming an open-source component-based system for machine learning and data mining Orange. I was also involved in development of an inteligent assistant for discovery of genetic networks from mutant data GenePath.\nI also teach courses in programming and in didactics of computer science. My wife and I translated the material from CS Unplugged to Slovenian, I teach Scratch in primary schools, I'm guilty that summer schools at the faculty have been extended to primary school children, I am a member of program committee of the Bebras competition, I am quite involved in the organization of Code Week and give professional development courses to teachers.\nEducation\nI studied computer science at the Faculty of  Computer and Information Science in Ljubljana, where I received BSc degree in 1996, MSc in 1999 and PhD in 2002, all under mentorship of prof. Dr. Bratko and co-mentorship of prof. Dr. Blaz Zupan. The area of the dissertation was artificial inteligence, in particular function decomposition, a method for data-based constructive induction without a predefined set of operators.\n",
    "linkSl": "/sl/o-fakulteti/osebje/janez-demsar",
    "descSl": "\nPo rodu sem iz Laboratorija za umetno inteligenco, po odcepu Laboratorija za bioinformatiko pa sem (ostal) v slednjem. Ukvarjam se s strojnim učenjem, vizualizacijo in poznam nekaj malega statistike. Kot programer sodelujem pri razvoju odprtokodnega komponentnega sistema za strojno učenje in podatkovno analitiko Orange, sodeloval pa sem tudi pri snovanju sistema za inteligentno podporo pri odkrivanju genetskih mrež na podlagi podatkov o mutantih Genepath.\nZadnje čase me bolj kot vse to zanima poučevanje računalništva. Skupaj z ženo sva prevedla CS Unplugged v Vidro, otroke v šoli sem učil tudi Scratch, kriv sem, da FRI od poletja 2013 organizira Poletne šole tudi za osnovnošolce, sodelujem v Programskem svetu tekmovanja Bober, pomagam pri akcijah kot je Teden programiranja, predavam na izobraževanjih za učitelje, se hecam z otroki na Znanstivalu Hiše eksperimentov... Poleg spodaj naštetih predmetov predavam tudi predmete na Pedagoški fakulteti.\nIzobrazba\nLeta 1990 sem se vpisal na Fakulteto za naravoslovje in tehnologijo, Oddelek za Fiziko, leta 1996 pa končal Fakulteto za računalništvo in informatiko. Na slednji sem začel delati kot mladi raziskovalec in leta 2002 zaključil doktorski študij z disertacijo na temo funkcijske dekompozicije, metode konstruktivne indukcije brez vnaprej podane množice operatorjev. \n",
    "name": "Janez Demšar",
    "linkEn": "/en/employees/janez-demsar"
  },
  {
    "descEn": "\nBorn: 30.9.1946 in Aurisina ( Italy )\nNationality: Slovenian, Citizenship: Slovenian\nForeign languages: Italian, English, German, French\nPosition held:\nHead of Department for automation, robotics and biocybernetics and later Head of Department of Electronics at Josef Stefan Research Institute (10 years) , vicepresident of Iskra Delta Computers (8 years), vicedean for Research and Development at the Faculty of Electrical and Computer Engineering, University of Ljubljana (4 years), Dean at the Faculty of Computer and Information Science, University of Ljubljana (4 years),  visiting professor at University of Udine (Italy), Head of Chair for Software at the Faculty of Computer and Information Science, Ljubljana, Chair of IEEE Slovenia section.\nResponsible for many projects devoted to the computer supported simulation and automation of different technological processes. Responsible for many projects related to multimedia and computer literacy. Co-author of SW support of first Slovenian robots, collaborator in the Italian regional educational project \"Factories of the future\". Member of Program Committee  for computer literacy of Slovenian Ministry of Education and Science.\nPresent functions:\nHead of Laboratory for Computer Graphics and Multimedia. Responsible for several projects in the field of multimedia and related technologies. Coordinator of a project for computer supported education in Slovenian schools.  Senior member of IEEE and Chairman of  CoLoS association, Chair of Slovenian IEEE Computer chapter, member of European Academy of Science.\n",
    "linkSl": "/sl/o-fakulteti/osebje/sasa-divjak",
    "descSl": null,
    "name": "Saša Divjak",
    "linkEn": "/en/employees/sasa-divjak"
  },
  {
    "descEn": "\nHis research interest is in adaptive systems and structures, parallel processing, information theory, inference, natural and learning algorithms. He is occupied with research, application oriented and bilateral projects on a regular basis. The research results are published in the scientific publications with SCI and INSPEC impact factors and presented on the international scientific conferences. He is member of Advisory Committee of the ICANNGA conference (International Conference on the Adaptive and Natural computiNG Algorithms).\nActivities and Events\nOrganization of ICANNGA 2011 conference to be held in Ljubljana, Slovenia.\n",
    "linkSl": "/sl/o-fakulteti/osebje/andrej-dobnikar",
    "descSl": "\nAndrej Dobnikar se raziskovalno ukvarja predvsem z adaptivnimin sistemi in strukturami, paralelnim procesiranjem ter informacijsko teorijo, inferenčnimi, naravnimi in učilnimi algoritmi. Redno sodeluje na raziskovalnih, aplikativnih in bilateralnih projektih. Rezultate svojega dela objavlja  v revijah z SCI in  INSPEC faktorji  ter  na  mednarodnih konferencah.  Napisal je  tudi šest učbenikov za predmete, ki jih predava na visokem strokovnem, univerzitetnem in podiplomskem študiju. Je stalni član svetovalnega komiteja mednarodne konference ICANNGA (mednarodna konferenca o adaptivnih in naravnih računskih algoritmih).\n",
    "name": "Andrej Dobnikar",
    "linkEn": "/en/employees/andrej-dobnikar"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/tomaz-dobravec",
    "descSl": "\nTomaž Dobravec je asistent na Fakulteti za računalništvo in informatiko Univerze v Ljubljani. Tu je bil najprej zaposlen kot mladi raziskovalec, od leta 2001 pa sodeluje v pedagoškem procesu na področjih programiranja, algoritmov in operacijskih sistemov. Raziskovalno in praktično se ukvarja predvem z razvojem in analizo algoritmov ter s teorijo programskih jezikov.\n",
    "name": "Tomaž Dobravec",
    "linkEn": "/en/employees/tomaz-dobravec"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/matej-dobrevski",
    "descSl": null,
    "name": "Matej Dobrevski",
    "linkEn": "/en/employees/matej-dobrevski"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/roman-dorn",
    "descSl": null,
    "name": "Roman Dorn",
    "linkEn": "/en/employees/roman-dorn"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/miha-drole",
    "descSl": null,
    "name": "Miha Drole",
    "linkEn": "/en/employees/miha-drole"
  },
  {
    "descEn": "\nAssistant at the following courses: Image Based Biometry and Operating Systems. Previous courses: Web Programming.\nTeaching assistant - PhD student under the mentorship of assoc. prof. dr. Peter Peer in the Laboratory of Computer Vision and comentorship of ass. prof. dr. Vitomir Štruc.\nMy main research interests are in the field of biometry, deep neural networks and computer vision.\n",
    "linkSl": "/sl/o-fakulteti/osebje/ziga-emersic",
    "descSl": "\nDoktorski študent - asistent v Laboratoriju za računalniški vid pod mentorstvom izr. prof. dr. Petra Peera in somentorstvom izr. prof. dr. Vitomirja Štruca.\nNa raziskovalnem področju se ukvarjam z biometrijo, globokimi nevronskimi mrežami in računalniškim vidom.\nSem asistent pri predmetih Slikovna Biometrija (MAG, izvaja se v angleščini) in Operacijski sistemi (VSP).\n",
    "name": "Žiga Emeršič",
    "linkEn": "/en/employees/ziga-emersic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/ales-erjavec",
    "descSl": null,
    "name": "Aleš Erjavec",
    "linkEn": "/en/employees/ales-erjavec"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/jana-faganeli-pucer",
    "descSl": null,
    "name": "Jana Faganeli Pucer",
    "linkEn": "/en/employees/jana-faganeli-pucer"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/gasper-fele-zorz",
    "descSl": null,
    "name": "Gašper Fele Žorž",
    "linkEn": "/en/employees/gasper-fele-zorz"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/gasper-fijavz",
    "descSl": null,
    "name": "Gašper Fijavž",
    "linkEn": "/en/employees/gasper-fijavz"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/mia-filic",
    "descSl": null,
    "name": "Mia Filić",
    "linkEn": "/en/employees/mia-filic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/aleksandra-franc",
    "descSl": null,
    "name": "Aleksandra Franc",
    "linkEn": "/en/employees/aleksandra-franc"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/damir-franetic",
    "descSl": "\nasistent za matematiko ",
    "name": "Damir Franetič",
    "linkEn": "/en/employees/damir-franetic"
  },
  {
    "descEn": "\nFÜRST, Luka. Attributed context-sensitive graph grammars. Elektrotehniški vestnik, 2014, vol. 81, no. 1/2, str. 27-32.\nFÜRST, Luka, LEONARDIS, Aleš. Feature selection for object detection: the best group vs. the group of best. MIPRO 2014, Opatija, Hrvaška, maj 2014, str. 1192-197.\nFÜRST, Luka. Interactive graph grammar induction. World Usability Day 2013, Ljubljana, Slovenija, november 2013, str. 25-28.\nFÜRST, Luka, MERNIK, Marjan, MAHNIČ, Viljan. Converting metamodels to graph grammars: doing without advanced graph grammar features. Sprejeto v Software and Systems Modeling.\nFÜRST, Luka, MAHNIČ, Viljan. Introductory programming course: motivating students with prior knowledge. World Transactions on Engineering and Technology Education, 2013, vol. 11, no. 4, str. 400-405.\nFÜRST, Luka, MERNIK, Marjan, MAHNIČ, Viljan. Graph grammar induction as a parser-controlled heuristic search process. Lecture Notes in Computer Science, vol. 7233, str. 121-136 [predstavljeno na Applications of Graph Transformation with Industrial Relevance (AGTIVE), 4. mednarodni simpozij, Budimpešta, Madžarska, oktober 2011].\nFÜRST, Luka, MAHNIČ, Viljan. A cooperative development system for an interactive introductory programming course. World Transactions on Engineering and Technology Education, 2012, vol. 10, no. 2, str. 122-127.\nFÜRST, Luka, MERNIK, Marjan, MAHNIČ, Viljan. Improving the graph grammar parser of Rekers and Schürr. IET Software. 2011, vol. 5, no. 2, str. 246-261.\nFÜRST, Luka, FIDLER, Sanja, LEONARDIS, Aleš. Selecting features for object detection using an AdaBoost-compatible evaluation function. Pattern Recognition Letters. 2008, vol. 29, no. 11, str. 1603-1612.\n",
    "linkSl": "/sl/o-fakulteti/osebje/luka-furst",
    "descSl": "\nFÜRST, Luka. Attributed context-sensitive graph grammars. Elektrotehniški vestnik, 2014, vol. 81, no. 1/2, str. 27-32.\nFÜRST, Luka, LEONARDIS, Aleš. Feature selection for object detection: the best group vs. the group of best. MIPRO 2014, Opatija, Hrvaška, maj 2014, str. 1192-197.\nFÜRST, Luka. Interactive graph grammar induction. World Usability Day 2013, Ljubljana, Slovenija, november 2013, str. 25-28.\nFÜRST, Luka, MERNIK, Marjan, MAHNIČ, Viljan. Converting metamodels to graph grammars: doing without advanced graph grammar features. Sprejeto v Software and Systems Modeling.\nFÜRST, Luka, MAHNIČ, Viljan. Introductory programming course: motivating students with prior knowledge. World Transactions on Engineering and Technology Education, 2013, vol. 11, no. 4, str. 400-405.\nFÜRST, Luka, MERNIK, Marjan, MAHNIČ, Viljan. Graph grammar induction as a parser-controlled heuristic search process. Lecture Notes in Computer Science, vol. 7233, str. 121-136 [predstavljeno na Applications of Graph Transformation with Industrial Relevance (AGTIVE), 4. mednarodni simpozij, Budimpešta, Madžarska, oktober 2011].\nFÜRST, Luka, MAHNIČ, Viljan. A cooperative development system for an interactive introductory programming course. World Transactions on Engineering and Technology Education, 2012, vol. 10, no. 2, str. 122-127.\nFÜRST, Luka, MERNIK, Marjan, MAHNIČ, Viljan. Improving the graph grammar parser of Rekers and Schürr. IET Software. 2011, vol. 5, no. 2, str. 246-261.\nFÜRST, Luka, FIDLER, Sanja, LEONARDIS, Aleš. Selecting features for object detection using an AdaBoost-compatible evaluation function. Pattern Recognition Letters. 2008, vol. 29, no. 11, str. 1603-1612.\n",
    "name": "Luka Fürst",
    "linkEn": "/en/employees/luka-furst"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/peter-gabrovsek",
    "descSl": null,
    "name": "Peter Gabrovšek",
    "linkEn": "/en/employees/peter-gabrovsek"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/anton-zvonko-gazvoda",
    "descSl": null,
    "name": "Anton Zvonko Gazvoda",
    "linkEn": "/en/employees/anton-zvonko-gazvoda"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/sandi-gec",
    "descSl": null,
    "name": "Sandi Gec",
    "linkEn": "/en/employees/sandi-gec"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/dejan-georgiev-0",
    "descSl": null,
    "name": "Dejan Georgiev",
    "linkEn": "/en/employees/dejan-georgiev-0"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/primoz-godec",
    "descSl": null,
    "name": "Primož Godec",
    "linkEn": "/en/employees/primoz-godec"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/teja-goli",
    "descSl": null,
    "name": "Teja Goli",
    "linkEn": "/en/employees/teja-goli"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/rok-gomiscek",
    "descSl": "\nSem doktorski študent - asistent v Laboratoriju za bioinformatiko.\n",
    "name": "Rok Gomišček",
    "linkEn": "/en/employees/rok-gomiscek"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/vesna-gracner",
    "descSl": null,
    "name": "Vesna Gračner",
    "linkEn": "/en/employees/vesna-gracner"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/miha-grohar",
    "descSl": null,
    "name": "Miha Grohar",
    "linkEn": "/en/employees/miha-grohar"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/vida-groznik",
    "descSl": null,
    "name": "Vida Groznik",
    "linkEn": "/en/employees/vida-groznik"
  },
  {
    "descEn": "\n\nMatej Guid works as a researcher at the Laboratory of Algorithmics. His research interest include heuristic search, intelligent tutoring systems, computer game-playing, and argument-based machine learning.\n\n",
    "linkSl": "/sl/o-fakulteti/osebje/matej-guid",
    "descSl": "\n\nDocent Matej Guid je zaposlen kot raziskovalec v Laboratoriju za algoritmiko. Njegovi glavni raziskovalni interesi obsegajo področje razvoja metod umetne inteligence z aplikacijo v gradnji ekspertnih sistemov, razvoju inteligentnih sistemov za poučevanje in pri računalniškem igranju iger. V kontekstu strojnega učenja se ukvarja z razvojem metod, ki omogočajo učinkovito interakcijo z domenskim strokovnjakom. V zadnjem času se intenzivno posveča izzivom, povezanimi z uporabo metod umetne inteligence na področju digitalnega marketinga. Več podrobnosti o raziskovalnem delu najdete na osebni spletni strani (http://www.ailab.si/matej).\n\n",
    "name": "Matej Guid",
    "linkEn": "/en/employees/matej-guid"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/veselko-gustin",
    "descSl": null,
    "name": "Veselko Guštin",
    "linkEn": "/en/employees/veselko-gustin"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/dr-marjana-harcet",
    "descSl": null,
    "name": "dr. Marjana Harcet",
    "linkEn": "/en/employees/dr-marjana-harcet"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/bojan-heric",
    "descSl": null,
    "name": "Bojan Heric",
    "linkEn": "/en/employees/bojan-heric"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/ana-herzog",
    "descSl": null,
    "name": "Ana Herzog",
    "linkEn": "/en/employees/ana-herzog"
  },
  {
    "descEn": "\nPhD student in Computer Science in the Bioinformatics Laboratory under the supervision of Assoc. Prof. Janez Demšar. My area of research includes analysis of networks and their local structure.\n",
    "linkSl": "/sl/o-fakulteti/osebje/tomaz-hocevar",
    "descSl": "\nDoktorski študent računalništva v Laboratoriju za bioinformatiko pod mentorstvom izr. prof. dr. Janeza Demšarja. Moje področje raziskovanja vključuje analizo omrežij in njihove lokalne strukture.\n",
    "name": "Tomaž Hočevar",
    "linkEn": "/en/employees/tomaz-hocevar"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/alen-horvat",
    "descSl": null,
    "name": "Alen Horvat",
    "linkEn": "/en/employees/alen-horvat"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/tomaz-hovelja",
    "descSl": "\nPozdravljeni!\n",
    "name": "Tomaž Hovelja",
    "linkEn": "/en/employees/tomaz-hovelja"
  },
  {
    "descEn": "\nI am a young researcher under the mentorship of prof. dr. Denis Trček in the Laboratory of e-media.\nMy main research fields are analytics of big data, semantic technologies and business process modeling for the purposes of information systems security.\nI am an asistent for the course Computer based sound production.\n",
    "linkSl": "/sl/o-fakulteti/osebje/aleks-huc",
    "descSl": "\nMladi raziskovalec v Laboratoriju za e-Medije pod mentorstvom prof. dr. Denisa Trčka.\nNa raziskovalnem področju se ukvarjam z analitiko velikih podatkov in uporabo semantičnih tehnologij ter modeliranja poslovnih procesov za namene zagotavljanja varnosti informacijskih sistemov.\nSem asistent pri predmet Računalniška zvočna produkcija.\n",
    "name": "Aleks Huč",
    "linkEn": "/en/employees/aleks-huc"
  },
  {
    "descEn": "\nNejc Ilc is an assistant at the Faculty of Computer and Information science in Ljubljana. His work in the Laboratory of Adaptive Systems and Parallel Processing involves practical lessons and research on machine learning (clustering algorithms), soft computing and distributed systems.\nActivities and Events\nOrganization of the international conference ICANNGA 2011 in Ljubljana.\nEducation\n2009, BSc in Computer and Information science , University of Ljubljana, Faculty of Computer and Information Science.\nWork experience\n2009 - , Assistant, University of Ljubljana, Faculty of Computer and Information Science.\n",
    "linkSl": "/sl/o-fakulteti/osebje/nejc-ilc",
    "descSl": "\nNejc Ilc je zaposlen kot asistent na Fakulteti za računalništvo in informatiko v Ljubljani. Poleg vodenja laboratorijskih vaj se ukvarja z raziskovanjem na področju algoritmov za razvrščanje, naravnih algoritmov in porazdeljenih sistemov.\nIzobrazba\n2009, Univerzitetni diplomirani inženir računalništva in informatike, Univerza v Ljubljani, Fakulteta za računalništvo in informatiko.\nIzkušnje\n2009, Univerzitetni diplomirani inženir računalništva in informatike, Univerza v Ljubljani, Fakulteta za računalništvo in informatiko.\n",
    "name": "Nejc Ilc",
    "linkEn": "/en/employees/nejc-ilc"
  },
  {
    "descEn": "\nMy research areas include: biomedical signal and image processing, digital signal processing, biomedical computer systems and human-computer interaction.\n",
    "linkSl": "/sl/o-fakulteti/osebje/franc-jager",
    "descSl": "\nMoja področja raziskav obsegajo: obdelavo biomedicinskih signalov in slik, digitalno procesiranje signalov, biomedicinske računalniške sisteme in komunikacijo človek računalnik.\n",
    "name": "Franc Jager",
    "linkEn": "/en/employees/franc-jager"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/ales-jaklic",
    "descSl": null,
    "name": "Aleš Jaklič",
    "linkEn": "/en/employees/ales-jaklic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/martin-jakomin",
    "descSl": null,
    "name": "Martin Jakomin",
    "linkEn": "/en/employees/martin-jakomin"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/miha-janez",
    "descSl": null,
    "name": "Miha Janež",
    "linkEn": "/en/employees/miha-janez"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/marko-jankovic",
    "descSl": "\nMarko Janković je mladi raziskovalec na Univerzi v Ljubljani, Fakulteti za Računalništvo in Informatiko.\nRaziskovalno se ukvarja predvsem z rudarjenjem po programskih repozitorijih in metodologijami razvoja programske opreme.\n",
    "name": "Marko Janković",
    "linkEn": "/en/employees/marko-jankovic"
  },
  {
    "descEn": "\nDavid Jelenc obtained his BSc and his PhD at University of Ljubljana (Faculty of Computer and Information Science). He is with the Laboratory for e-media where he works as a researcher and teaching assistant.\nHis research interests include computational trust and reputation models, agent-based simulations, computer networks and information security.\n",
    "linkSl": "/sl/o-fakulteti/osebje/david-jelenc",
    "descSl": "\nDavid Jelenc je diplomiral in doktoriral na Fakulteti za računalništvo in informatiko Univerze v Ljubljani. Zaposlen je v Laboratoriju za e-medije, kjer opravlja delo raziskovalca ter asistenta.\nRaziskovalno se ukvarja z računskimi modeli za obvladovanje zaupanja in ugleda, agentnimi simulacijami, računalniškimi komunikacijami ter informacijsko varnostjo.\n",
    "name": "David Jelenc",
    "linkEn": "/en/employees/david-jelenc"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/peter-jenko",
    "descSl": null,
    "name": "Peter Jenko",
    "linkEn": "/en/employees/peter-jenko"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/gregor-jerse",
    "descSl": null,
    "name": "Gregor Jerše",
    "linkEn": "/en/employees/gregor-jerse"
  },
  {
    "descEn": "\nHis research area covers Cloud Computing, Service Oriented Architectures and Integration of Information Systems.\n",
    "linkSl": "/sl/o-fakulteti/osebje/matjaz-branko-juric",
    "descSl": "\nRaziskovalno se ukvarja s področjem računalništva v oblaku (Cloud Computing), storitveno orientiranimi arhitekturami (SOA) in integracijo informacijskih sistemov. \n",
    "name": "Matjaž Branko Jurič",
    "linkEn": "/en/employees/matjaz-branko-juric"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/aleksandar-jurisic",
    "descSl": null,
    "name": "Aleksandar Jurišić",
    "linkEn": "/en/employees/aleksandar-jurisic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/iga-jurkota-rebrovic",
    "descSl": null,
    "name": "Iga Jurkota Rebrović",
    "linkEn": "/en/employees/iga-jurkota-rebrovic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/maher-kaddoura",
    "descSl": null,
    "name": "Maher Kaddoura",
    "linkEn": "/en/employees/maher-kaddoura"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/benjamin-kastelic",
    "descSl": null,
    "name": "Benjamin Kastelic",
    "linkEn": "/en/employees/benjamin-kastelic"
  },
  {
    "descEn": "\n\n\nD. Križaj, M. Meža, J. Bajc, A. Kavčič, and B. Pečar, \"Moderno poučevanje naravoslovja in tehnike z uporabo fleksibilnega merilnega sistema z odprtokodnim programjem - eEksperimenti = Modern teaching of natural sciences using flexible measurement system with open source software - eEksperiments,\" in Vzgoja in izobraževanje v informacijski družbi - VIVID 2015 : zbornik referatov : conference proceedings, 2015, pp. 237-247. \nD. Križaj, M. Meža, J. Bajc, A. Kavčič, and B. Pečar, \"E-eksperimenti - moderno poučevanje naravoslovja in tehnike z uporabo fleksibilnega merilnega sistema z odprtokodnim programjem = E-experiments - modern science and technology teaching with the use of a flexible measurement system with Open Source software,\" in Učimo se drug od drugega : zbornik povzetkov prispevkov, 2015, pp. 236-237. \nA. Kavčič, C. Bohak, M. Pesek, and M. Marolt, \"Edoo : involving teachers in the development of e-learning material,\" in Open education for a multicultural world : OCWC Global Conference, 23-25 April Ljubljana, Slovenia, 2014, pp. 1-4. \nA. Kavčič, M. Pesek, C. Bohak, and M. Marolt, \"Edoo : online match-making portal for educational content production,\" in Proceedings of the 1st Workshop on Defining a European Research Agenda on Information Systems and Management in eMedia Industries, Bled, Slovenia, 9th-13th June 2013, 2013, pp. 14-16. \nA. Kavčič, M. Pesek, C. Bohak, and M. Marolt, \"Spletni portal za sodelovanje učiteljev in razvijalcev elektronskih učnih gradiv = Web portal for teacher - developer collaboration in electronic learning materials production,\" in Vzgoja in izobraževanje v informacijski družbi : zbornik referatov : conference proceedings, 2013, pp. 92-99. \nM. Makovec, M. Eskelinen, R. Testen, T. Hečimović, C. Bohak, and A. Kavčič, \"Diagnoza akutnega vnetja slepiča s pomočjo točkovnega sistema = The diagnosis of acute appendicitis with assistance of scoring system,\" in Urgentna medicina : izbrana poglavja 2012 : zbornik : selected topics [2012] : proceedings, 2012, pp. 216-218. \nA. Kavčič, \"Pomen standardov in specifikacij za elektronska učna gradiva = Importance of standards and specifications for electronic learning materials : vabljeno predavanje,\" in (Zbornik), 2011, pp. 158-164. \nA. Kavčič, \"Implementing content packaging standards,\" in EUROCON 2011, 2011, pp. 1-4. \nJ. Južna and A. Kavčič, \"Standardi za pakiranje elektronskih učnih gradiv = Packaging standards for electronic learning materials,\" in Zbornik vseh prispevkov, 2010, pp. 640-646. \nA. Kavčič, \"Informatization of learning and training in Slovenian armed forces,\" in Eurocon 2009 : proceedings, 2009, pp. 326-331.\nA. Kavčič, \"Specifications and standards for use of educational digital content,\" in Research, reflections and innovations in integrating ICT in education. Vol. 1, 2009, pp. 577-581. \nM. Kljun, J. Vičič, B. Kavšek, and A. Kavčič, \"Evaluation comparisons and evaluations of learning management systems,\" in ITI 2007 : proceedings of the ITI 2007, 2007, pp. 363-368. \nJ. Južna, A. Kavčič, and S. Divjak, \"Metadata for electronic learning resources = Metapodatki pri elektronskih učnih virih,\" in Vzgoja in izobraževanje v informacijski družbi : zbornik konference : conference proceedings, 2007, pp. 194-198. \nA. Kavčič, J. Južna, and S. Divjak, \"Učinkovita uporaba obstoječih gradiv za e-izobraževanje = Effective use of existing e-learning materials,\" in Zbornik, 2007, pp. 355-359. \nA. Kavčič, \"Fuzzy user modeling for adaptation in educational hypermedia,\" IEEE transactions on systems, man and cybernetics. Pt. C, Applications and reviews, vol. 34, iss. 4, pp. 439-449, 2004. \nM. Marolt, A. Kavčič, M. Privošnik, and S. Divjak, \"On detecting note onsets in piano music,\" in Communications and information technology for development : proceedings, 2002, pp. 385-389. \n\n\n",
    "linkSl": "/sl/o-fakulteti/osebje/alenka-kavcic",
    "descSl": "\nAlenka Kavčič je asistentka na Fakulteti za računalništvo in informatiko. Poleg pedagoških obveznosti je vključena v vrsto raziskovalnih projektov, ki so povezani z multimedijo in internetnimi tehnologijami, računalniško podprtem učenju in poučevanju, interakciji človeka z računalnikom ter navidezno in obogateno resničnostjo. Njeno glavno raziskovalno področje so hipermedijski sistemi in računalniško podprto učenje, posebej prilagodljivi hipermediji in modeliranje uporabnika, spletni izobraževalni sistemi ter informacijske tehnologije v izobraževanju.\nIzobrazba\n\nDoktorat iz računalništva, junij 2001, Univerza v Ljubljani.\r\n\tNaslov: Prilagajanje v spletnih izobraževalnih hipermedijih z upoštevanjem nezanesljivosti uporabnikovega znanja (povezava).\nMagisterij iz računalništva, december 1998, Univerza v Ljubljani.\r\n\tNaslov: Prilagodljivi hipermedijski učni sistemi (povezava).\nDiploma iz računalništva, september 1992, Univerza v Ljubljani.\r\n\tNaslov: Rekonstrukcija 3D objektov iz vec 2D slik.\n\r\n\t \n\n",
    "name": "Alenka Kavčič",
    "linkEn": "/en/employees/alenka-kavcic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/silvana-kavcic",
    "descSl": null,
    "name": "Silvana Kavčič",
    "linkEn": "/en/employees/silvana-kavcic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/maja-kerkez",
    "descSl": null,
    "name": "Maja Kerkez",
    "linkEn": "/en/employees/maja-kerkez"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/peter-marijan-kink",
    "descSl": null,
    "name": "Peter Marijan Kink",
    "linkEn": "/en/employees/peter-marijan-kink"
  },
  {
    "descEn": "\nTeaching Database Basics, Databases I & II, Programming I, Operating Systems, Algorithms and Data Structures II, Multimedia Technologies, Communication Methods, Interaction and Information Design.\n",
    "linkSl": "/sl/o-fakulteti/osebje/bojan-klemenc",
    "descSl": null,
    "name": "Bojan Klemenc",
    "linkEn": "/en/employees/bojan-klemenc"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/jelena-klisara",
    "descSl": null,
    "name": "Jelena Klisara",
    "linkEn": "/en/employees/jelena-klisara"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/vid-klopcic",
    "descSl": null,
    "name": "Vid Klopčič",
    "linkEn": "/en/employees/vid-klopcic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/petar-kochovski",
    "descSl": null,
    "name": "Petar Kochovski",
    "linkEn": "/en/employees/petar-kochovski"
  },
  {
    "descEn": "\nDušan Kodek is a professor emeritus of computer science. He was a chair of the Theoretical Computer Science  group and a head of the   Laboratory for Architecture and Signal Processing at the Faculty of Computer and Information Science.   \n",
    "linkSl": "/sl/o-fakulteti/osebje/dusan-kodek",
    "descSl": "\nDušan Kodek je zaslužni profesor za računalništvo in informatiko, bil je predstojnik Katedre za teoretično računalništvo in predstojnik  Laboratorija za arhitekturo in procesiranje signalov.\n",
    "name": "Dušan Kodek",
    "linkEn": "/en/employees/dusan-kodek"
  },
  {
    "descEn": "\nIgor Kononenko received his Ph.D. in 1990 in computer science from University of Ljubljana, Slovenia. He is the professor at the Faculty of Computer and Information Science in Ljubljana (courses: Algorithms and data strucures 1, Artificial Intelligence, Intelligent Systems, Machine learning)\" and the head of Laboratory for Cognitive Modeling. His research interests include artificial intelligence, machine learning, neural networks and cognitive modeling. He is the (co)author of about 210 papers and 10 textbooks. He is the member of the editorial board of Applied Intelligence Journal (Kluwer Ac. Publ.) and Informatica Journal, he was also twice a chair of program comitee of International cognitive conference in Ljubljana. Besides artificial intelligence he is interested also in natural intelligence: self-healing, complementary medicine,   relation between science and spirituality and spiritual wisdom.\nProf. Kononenko is the coauthor of the book:  MACHINE LEARNING AND DATA MINING: Introduction to Principles and Algorithms, published by Horwood Publishing in 2007 and the book TEACHERS OF WISDOM.\n",
    "linkSl": "/sl/o-fakulteti/osebje/igor-kononenko",
    "descSl": "\nIgor Kononenko je doktoriral leta 1990 iz računalništva in informatike na Univerzi v Ljubljani. Je redni profesor na Fakulteti za računalništvo in informatiko v Ljubljani ter predstojnik Laboratorija za kognitivno modeliranje. Njegova raziskovalna področja so umetna inteligenca, strojno učenje, nevronske mreže in kognitivno modeliranje. Je (so)avtor 210 člankov na teh področjih ter 10 učbenikov. Je član uredniškega odbora revij Applied Intelligence Journal (Kluwer Ac. Publ.) in Informatica Journal, dvakrat je bil predsednik programskega odbora Mednarodne kognitivne konference v Ljubljani. Poleg umetne inteligence ga zanima tudi naravna inteligenca: samozdravljenje, komplementarna medicina, relacija med znanostjo in duhovnostjo in duhovna modrost.\nJe soavtor knjige (skupaj z Matjažem Kukarjem) MACHINE LEARNING AND DATA MINING: Introduction to Principles and Algorithms, ki je izšla pri angleški znanstveni založbi Horwood Publishing, ter soavtor knjige (skupaj z Ireno Roglič Kononenko) UČITELJI MODROSTI.\n",
    "name": "Igor Kononenko",
    "linkEn": "/en/employees/igor-kononenko"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/miran-koprivec",
    "descSl": null,
    "name": "Miran Koprivec",
    "linkEn": "/en/employees/miran-koprivec"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/domen-kosir",
    "descSl": null,
    "name": "Domen Košir",
    "linkEn": "/en/employees/domen-kosir"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/jan-kralj",
    "descSl": null,
    "name": "Jan Kralj",
    "linkEn": "/en/employees/jan-kralj"
  },
  {
    "descEn": "\nMarjan Krisper is an Associate Professor of Information Systems at University of Ljubljana, Faculty of Computer and Information Science. He received his Master in Information Systems Engineering from University of Ljubljana, Slovenia, in 1977, and his Ph.D. in Expert Systems from University of Belgrade, Yugoslavia, in 1989. His research interests include Electronic Business, Information Systems Development Methodologies, Mobile Applications, Information Systems Strategic Planning, Data Mining, and Expert Systems. His articles have appeared in international journals and in proceedings of many international conferences. He was a project leader of various information systems development and other projects. He has strong practical and teaching interests in Electronic Business implementations, Information Systems Strategic Planning and other areas. He is a member of AIS (Association of Information Systems), senior member of PMI (Project Management Institute) Slovenian Chapter and a member of ACM. He became an Associate Professor in 2007. Professor Krisper is Chair of Information Systems and Head of Information Systems Laboratory. He is also a board member of Technology Network ICT.\n",
    "linkSl": "/sl/o-fakulteti/osebje/marjan-krisper",
    "descSl": "\nZaposlil se je leta 1972 kot raziskovalec na Univerzi v Ljubljani. Od leta 1978 do 1982 je opravljal delo pomočnika ministra.\nNaziv docenta na Univerzi v Ljubljani je pridobil leta 1982 in od takrat poučuje področja informacijskih sistemov in njihovega razvoja. V letu 2007 je bil izvoljen v naziv izrednega profesorja.\nLeta 1992 je postal predstojnik Laboratorija za informatiko, leta 1995 pa je prevzel vostvo katedre za informatiko na Fakulteti za računalništvo in informatiko.\nNjegova bibliografija obsega več kot 200 strokovnih sestavkov in znanstvenih razprav.\nVodi številne projekte razvoja informaciskih sistemov, elektronskega poslovanja in metodologij razvoja informacijskih sistemov v največjih sistemih v gospodarstvu, državni upravi in javnem sektorju. Hkrati je tudi član projektnega sveta Tehnološke mreže ICT.\n",
    "name": "Marjan Krisper",
    "linkEn": "/en/employees/marjan-krisper"
  },
  {
    "descEn": "\nMatej Kristan is an associate professor at the Faculty of Computer and Information Science and at the Faculty of Electrical Engineering at the University of Ljubljana, at which he received his doctorate in electrical engineering in 2008. His research interests lie in the field of statistical methods for machine learning with application in computer vision. In the context of computer vision his research focuses on methods for object tracking, dynamic stochastic models, object detection and categorization using hierarchical models, and applications of computer vision on mobile robots.\nActivities and events\n\nCoorganizer of the Computer Vision Winter Workshop 2012, Mala Nedelja, Slovenija, 1-3 februar, 2012. (http://cvww2012.vicos.si/)\nMember of a supervisory board of Slovenian pattern recognition society, SDRV\n\n",
    "linkSl": "/sl/o-fakulteti/osebje/matej-kristan",
    "descSl": "\nMatej Kristan je izredni profesor na Fakulteti za računalništvo in informatiko ter na Fakulteti za Elektrotehniko, Univerze v Ljubljani, kjer je leta 2008 doktoriral. Njegovi glavni raziskovalni interesi obsegajo področje statističnih metod umetne inteligence in strojnega učenja z aplikacijo v računalniškem vidu. V kontekstu računalniškega vida se ukvarja z metodami za sledenje objektov, dinamičnimi stohastičnimi modeli, detekcijo objektov in kategorizacijo s pomočjo hierarhičnih modelov, ter uporabo računalniškega vida na mobilnih robotskih platformah. Več podrobnosti o predmetih in raziskovalnem delu najdete na osebni spletni strani (http://www.vicos.si/People/Matejk).\n",
    "name": "Matej Kristan",
    "linkEn": "/en/employees/matej-kristan"
  },
  {
    "descEn": "\nI am assistant professor at Faculty of computer and information science, in the  Cognitive modelling laboratory.\n",
    "linkSl": "/sl/o-fakulteti/osebje/matjaz-kukar",
    "descSl": "\n\n\nSem docent na Fakulteti za računalništvo in informatiko, član Laboratorija za kognitivno modeliranje (LKM). Leta 2001 sem doktoriral iz računalništva in informatike, leta 1996 magistriral in leta 1993 diplomiral na Fakulteti za računalništvo in informatiko Univerze v Ljubljani.\n \n\n\nRaziskovalno delam na področju umetne inteligence, predvsem strojnega učenja, podatkovnega rudarjenja in analize podatkov. V okviru strojnega učenja me še posebej zanimajo aplikacije v medicini, ROC analiza, cenovno občutljivo učenje ter ocenjevanje zanesljivosti.\n \n\n\n\n\nSem avtor ali soavtor več kot 60 večinoma mednarodnih publikacij.\n\n\n",
    "name": "Matjaž Kukar",
    "linkEn": "/en/employees/matjaz-kukar"
  },
  {
    "descEn": "\nI graduated and received PhD from University of Ljubljana, Faculty of Computer and Information Science in 2004 where I am currently employed as a teaching assistant. My research areas include intelligent agents, multi-agent systems, ontologies and data mining.\nI'm member of The Society of Digital Information and Wireless Communications (SDIWC) and Slovenskega društva Informatika (SDI).\nEducation\n\n\nDoctor of Philosophy in Computer Science, University of Ljubljana, Faculty of Computer and Information Science, 2010.\nBachelor of Science in Computer Systems and Informatics, University of Ljubljana, Faculty of Computer and Information Science, 2004.\n\n\nWork experience\n\n\nTeaching Assistant, University of Ljubljana, Faculty of Computer and Information Science (2009 - now)\nJunior researcher, University of Ljubljana, Faculty of Computer and Information Science (2004 - 2009)\nResearcher, University of Ljubljana, Faculty of Computer and Information Science (2002 - 2004)\nDemonstrator and system administrator, University of Ljubljana, Faculty of Electrical Engineering (2001 - 2003)\nTeacher and system administrator, Primary school Medvode (2001 - 2002)\nResearcher and developer, IS.Edico (1997 - 2000)\n\n\n",
    "linkSl": "/sl/o-fakulteti/osebje/dejan-lavbic",
    "descSl": "\nLeta 2004 sem diplomiral in leta 2010 doktoriral na področju računalništva in informatike na Univerzi v Ljubljani, Fakulteta za računalništvo in informatiko, kjer sem trenutno tudi zaposlen kot asistent.\nNa raziskovalnem področju se ukvarjam z inteligentnimi agenti, večagentnimi sistemi, odkrivanjem zakonitosti v podatkih, ontologijami in semantičnim spletom.\nSem član The Society of Digital Information and Wireless Communications (SDIWC) in Slovenskega društva Informatika (SDI).\nIzobrazba\n\nDoktor računalniških znanosti, Univerza v Ljubljani, Fakulteta za računalništvo in informatiko, 2010.\nUniverzitetni inženir računalništva in informatike, Univerza v Ljubljani, Fakulteta za računalništvo in informatiko, 2004.\n\nIzkušnje\n\nDoktor računalniških znanosti, Univerza v Ljubljani, Fakulteta za računalništvo in informatiko, 2010.\nUniverzitetni inženir računalništva in informatike, Univerza v Ljubljani, Fakulteta za računalništvo in informatiko, 2004.\n\n",
    "name": "Dejan Lavbič",
    "linkEn": "/en/employees/dejan-lavbic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/timotej-lazar",
    "descSl": null,
    "name": "Timotej Lazar",
    "linkEn": "/en/employees/timotej-lazar"
  },
  {
    "descEn": "\nI am primarily interested in computer graphics, simulations, fuzzy logic, processing structures of the future and the modelling of artificial life. Indeed the application of fuzzy logic to the modelling of artificial life was also the topic of my PhD dissertation. What I find most appealing in this merging is to assist biologists, ethologists, behaviourists, etc. by enabling the rules of behaviour of artificial animals, or animats, to be described linguistically. Other than that I spend quite a lot of time researching different and apparently unrelated fields like the integration of the Bluetooth technology into hospital information systems, modelling and simulation of organized groups, and multi-valued logic, based on quantum-dot cellular automata.\nActivities and events\n\n2009, Visiting Scientist at University of Rhode Island, USA (Departments of Computer Science and Statistics, and Biological Sciences)\n\nEducation\nI finished the Computer Science Programme at the Technical School Centre in Nova Gorica in 1994 and continued my studies at the University of Ljubljana, Faculty of Computer and Information Science until my PhD dissertation in 2005.\n",
    "linkSl": "/sl/o-fakulteti/osebje/iztok-lebar-bajec",
    "descSl": "\nRaziskovalno me zanimajo predvsem področja računalniške grafike, simulacij, mehke logike, procesnih sistemov prihodnosti in modeliranja umetnega življenja. Ravno modeliranje umetnega življenja s pomočjo mehke logike je bila tema moje doktorske disertacije. Eden izmed raziskovalnih ciljev je, s pomočjo mehke logike, omogočiti opisno postavljanje pravil obnašanja umetnih živih bitij, ali animatov, tistim, ki o njih največ vedo - torej biologom, etologom, behavioristom, ... Drugače pa se moja raziskovalna žeja gasi na različnih in navidezno nepovezanih področjih, kot so uporaba Bluetooth tehnologije v bolnišnicah, modeliranje in simulacija gibanja organiziranih skupin ter večvrednostna logika na osnovi kvantnih celularnih avtomatov.\nIzobrazba\nKončal sem srednjo računalniško šolo v Tehniškem šolskem centru v Novi Gorici, študij pa do doktorata znanosti nadaljeval na Fakulteti za računalništvo in informatiko.\n",
    "name": "Iztok Lebar Bajec",
    "linkEn": "/en/employees/iztok-lebar-bajec"
  },
  {
    "descEn": "\nAleš Leonardis is a Professor of computer science. He is a head of the Visual Cognitive Systems Laboratory at the Faculty of Computer and Information Science, University of Ljubljana. \n",
    "linkSl": "/sl/o-fakulteti/osebje/ales-leonardis",
    "descSl": "\nAleš Leonardis je redni profesor računalništva in informatike in predstojnik Laboratorija za umetne vizualne spoznavne sisteme na Fakulteti za računalništvo in informatiko Univerze v Ljubljani.\n",
    "name": "Aleš Leonardis",
    "linkEn": "/en/employees/ales-leonardis"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/ziga-lesar",
    "descSl": null,
    "name": "Žiga Lesar",
    "linkEn": "/en/employees/ziga-lesar"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/jure-leskovec",
    "descSl": null,
    "name": "Jure Leskovec",
    "linkEn": "/en/employees/jure-leskovec"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/matjaz-licen",
    "descSl": null,
    "name": "Matjaž Ličen",
    "linkEn": "/en/employees/matjaz-licen"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/jaka-lindic",
    "descSl": null,
    "name": "Jaka Lindič",
    "linkEn": "/en/employees/jaka-lindic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/nikola-ljubesic-0",
    "descSl": null,
    "name": "Nikola Ljubešić",
    "linkEn": "/en/employees/nikola-ljubesic-0"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/sonja-lojk",
    "descSl": null,
    "name": "Sonja Lojk",
    "linkEn": "/en/employees/sonja-lojk"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/jure-lokovsek",
    "descSl": null,
    "name": "Jure Lokovšek",
    "linkEn": "/en/employees/jure-lokovsek"
  },
  {
    "descEn": "\nHe currently holds the position of associate professor on the Faculty of Computer and Information Science, University of Ljubljana, Slovenia. His research interests include soft computing methods, distributed processing and their applications.\nEducation\n\n1994, BSc in Physics, University of Ljubljana, Faculty of Mathematics and Physics\n1997, MSc in Computer Science, Univeristy of Ljubljana, Faculty of Computer and Information Science\n2000, PhD in Computer Science, Univeristy of Ljubljana, Faculty of Computer and Information Science\n\nWork experience\n\n1994 - 1999, Researcher in industry, Sava, d.d., Slovenia\n2000 - 2004, Assistant, University of Ljubljana, Faculty of Computer and Information Science\n2004 - 2010, Assistant Professor, University of Ljubljana, Faculty of Computer and Information Science\n2010-, Associate Professor, University of Ljubljana, Faculty of Computer and Information Science\n\n",
    "linkSl": "/sl/o-fakulteti/osebje/uros-lotric",
    "descSl": "\nZaposlen je kot učitelj na Fakulteti za računalništvo in infromatiko Univerze v Ljubljani. Raziskovalno se ukvarja predvsem z razvojem novih metod mehkega računanja in uporabo le-teh v praksi. Aktiven je tudi na področju prenosa metod mehkega računanja na sisteme za porazdeljeno procesiranje kot so omrežja Grid, gruče računalnikov in zmogljive grafične kartice. Z industrijo največ sodeluje pri razvoju kompleksnih sistemov vodenja proizvodnih procesov.\nIzobrazba\n\nUniverzitetni diplomirani inženir fizike, 1994, Univerza v Ljubljani,Fakulteta za matematiko in fiziko\nMagister računalništva in informatike, 1997, Univerza v Ljubljani, Fakulteta za računalništvo in informatiko\nDoktor računalništva in informatike, 2000, Univerza v Ljubljani, Fakulteta za računalništvo in informatiko\n\nIzkušnje\n\nUniverzitetni diplomirani inženir fizike, 1994, Univerza v Ljubljani,Fakulteta za matematiko in fiziko\nMagister računalništva in informatike, 1997, Univerza v Ljubljani, Fakulteta za računalništvo in informatiko\nDoktor računalništva in informatike, 2000, Univerza v Ljubljani, Fakulteta za računalništvo in informatiko\n\n",
    "name": "Uroš Lotrič",
    "linkEn": "/en/employees/uros-lotric"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/alan-lukezic",
    "descSl": null,
    "name": "Alan Lukežič",
    "linkEn": "/en/employees/alan-lukezic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/nives-macerl",
    "descSl": "\nNives Macerl je diplomirala na Ljubljanski Pravni fakulteti in kot univerzitetna diplomirana pravnica opravljala delo pravnice v podjetju ETI Elektroelement d.d. Izlake, karierno pot nadaljevala na Agenciji RS za revidiranje lastninskega preoblikovanja podjetij ter pred nastopom dela kot tajnik fakultete, vodila Sektor za upravne zadeve na Agenciji RS za okolje. Delo tajnika fakultete opravlja od 1.10.2009 in vodi ter z 29 sodelavci skrbi za izvedbo upravno-administrativnih in strokovno-tehničnih nalog.\n",
    "name": "Nives Macerl",
    "linkEn": "/en/employees/nives-macerl"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/viljan-mahnic",
    "descSl": null,
    "name": "Viljan Mahnič",
    "linkEn": "/en/employees/viljan-mahnic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/ivan-majhen",
    "descSl": null,
    "name": "Ivan Majhen",
    "linkEn": "/en/employees/ivan-majhen"
  },
  {
    "descEn": "\nMatija Marolt is assist. prof. at Faculty of Computer and Information Science, where he is head of Laboratory for Computer Graphics and Multimedia. His research interests are in music/audio information retrieval, computer graphics and visualisation. He focuses on problems such as melody and rhythm estimation, audio segmentation and organisation, search and visualisation of music collections.\n",
    "linkSl": "/sl/o-fakulteti/osebje/matija-marolt",
    "descSl": "\nMatija Marolt je docent na Fakulteti za računalništvo in informatiko, kjer je vodja Laboratorija za računalniško grafiko in multimedije. Raziskovalno se ukvarja s področji pridobivanja informacij iz zvoka in glasbe, računalniške grafike in vizualizacije. Še posebej ga zanimajo problemi kot so iskanje melodije in ritma v skladbah, segmentacija zvočnih posnetkov ter organizacija, iskanje in vizualizacija glasbenih zbirk.\n",
    "name": "Matija Marolt",
    "linkEn": "/en/employees/matija-marolt"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/matej-martinc",
    "descSl": null,
    "name": "Matej Martinc",
    "linkEn": "/en/employees/matej-martinc"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/teodora-matic",
    "descSl": null,
    "name": "Teodora Matić",
    "linkEn": "/en/employees/teodora-matic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/blaz-meden",
    "descSl": "\nAsistent pri predmetu Osnove oblikovanja.\nDoktorski študent - asistent pod mentorstvom izr. prof. dr. Petra Peera in somentorstvom doc. dr. Vitomirja Štruca. \nNa raziskovalnem področju se ukvarjam z analizo slik in biometrijo.\n",
    "name": "Blaž Meden",
    "linkEn": "/en/employees/blaz-meden"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/jan-meznaric",
    "descSl": "\nDoktorski študent - asistent v Laboratoriju za integracijo informacijskih sistemov.\n",
    "name": "Jan Meznarič",
    "linkEn": "/en/employees/jan-meznaric"
  },
  {
    "descEn": "\nMr. Miran Mihelčič was born in 1942 in Ljubljana, Slovenia. After he finished secondary school of economics and faculty of economics in Ljubljana and obtained the title of bachelor of science in economics he joined – in 1965 - the big Slovenian enterprise, engaged in broad variety of installations and some dependent products, IMP, Ljubljana, with almost 3000 employees. From 1972 to 1975 he was head of organization and information system department in the same enterprise. Already as a master of business administration (1972 at University of Ljubljana) he joined the Chamber of economy of Slovenia in Ljubljana in 1975 as head of market, production and allocation of gross domestic product department.\nSince 1972 he has been lecturing at the University of Ljubljana, first as a contracting lecturer, then, since 1982 as an employee of the forerunner of the nowadays Faculty of computer and information science. Today he lectures in the latter. After he had gained PhD in BA in 1982 (University of Ljubljana), he obtained the British scholarship (Leverhulme Trust) for nine months’ research work at the nowadays Cranfield University. From 1981 to 2005, this time as a full professor, he has been given classes to the under-graduated and post-graduated students at 8 faculties of the Ljubljana and the Maribor University, regarding topics in business economics, theory of organization, income distribution and business functions.\nIn his research work he mostly deals with analysis of the quality of formal social units’ organization, governors’ and managers’ decision-making and their information systems, issues in the field of income distribution, and with the contents of governance and management functions.\nIn 2001 he has been given a title of honorary member of the Union of Economists of Slovenia.\n",
    "linkSl": "/sl/o-fakulteti/osebje/miran-mihelcic",
    "descSl": "\nMiran Mihelčič, rojen leta 1942 v Ljubljani, se je po končani ekonomski srednji šoli in ekonomski fakulteti v Ljubljani leta 1965 najprej zaposlil v IMP – Industrijskem montažnem podjetju, Ljubljana. V letih 1972 – 1975 je bil v tem podjetju ravnatelj službe za organizacijo in informacijske sisteme. Že kot magister poslovno-organizacijskih znanosti (1972) se je leta 1975 zaposlil na Gospodarski zbornici Slovenije v Ljubljani kot ravnatelj službe za trg, ustvarjanje in delitev dohodka.\nOd leta 1972 predava na Univerzi v Ljubljani, najprej kot zunanji predavatelj, nato pa od leta 1981 kot redno zaposlen v predhodnicah današnje Fakultete za računalništvo in informatiko v Ljubljani in danes v njej. Po doktoratu leta 1982 je leta 1985 dobil  in izrabil devetmesečno britansko štipendijo za raziskovalno delo v sedanji univerzi v Cranfieldu. V letih od 1981 do 2005, zdaj kot redni profesor, je skupaj predaval na dodiplomskem ter podiplomskem študiju 8 fakultet ljubljanske ter mariborske univerze in sicer vsebine, povezane z ekonomiko poslovanja združbe, teorijo organizacije, delitvijo dohodka in poslovnimi funkcijami.\nV raziskovalnem delu se zlasti posveča analizi kakovosti organizaciji združbe, odločanju ravnateljev na podlagi informacijskih sistemov, delitveni problematiki ter vsebini funkcij upravljanja in ravnateljevanja.\nLeta 2001 ga Zveza ekonomistov Slovenije imenovala za častnega člana te strokovne združbe.\n",
    "name": "Miran Mihelčič",
    "linkEn": "/en/employees/miran-mihelcic"
  },
  {
    "descEn": "\nI am a member of the Laboratory for algorithms and data structures and mostly interested in algorithms, discrete problems, combinatorial optimization, computational complexity as well as operating systems, virtual machines and system software. At first my focus was more theoretical but now I am quite excited on bridging the gap between theory and practice and hence the specific areas such as algorithm engineering, experimental algorithmics, beyond worst-case analysis and also development of system software.\nActivities and Events\n\n\nMember of EuroCG 2015 organizing commitee\nCoorganizer of LADS3 2014\nMember of ALGO 2012 organizing commitee\n\n\n",
    "linkSl": "/sl/o-fakulteti/osebje/jurij-mihelic",
    "descSl": "\nSem član Laboratorija za algoritme in podatkovne strukture. Zanimajo med predvsem algoritmi, diskretni problemi, kombinatorična optimizacija, računska zahtevnost in tudi operacijski sistemi, navidezni stroji, programski jeziki ter sistemska programska oprema. Prvotno sem bil morda malce bolj teoretično usmerjen, v zadnjem času pa me privlači predvsem povezava oz. uporaba teorije v praksi in s tem specifična področja kot so npr. inženiring algoritmov, eksperimentalna algoritmika, analiza algoritmov preko najslabšega primera in tudi razvoj sistemske programske opreme.\n",
    "name": "Jurij Mihelič",
    "linkEn": "/en/employees/jurij-mihelic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/iztok-mihevc",
    "descSl": null,
    "name": "Iztok Mihevc",
    "linkEn": "/en/employees/iztok-mihevc"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/david-modic",
    "descSl": null,
    "name": "David Modic",
    "linkEn": "/en/employees/david-modic"
  },
  {
    "descEn": "\nI am a teaching assistant at the Faculty of Computer and Information Science in Ljubljana. My research interests are fuzzy logic and unconventional computing.\n",
    "linkSl": "/sl/o-fakulteti/osebje/miha-moskon",
    "descSl": "\nSem asistent na Fakulteti za računalništvo in informatiko. Vodim vaje pri predmetih s področja računalniških omrežij in sistemov in nekonvencionalnega računalništva. V zadnjem času svoje raziskave posvečam povezavam med biološkimi sistemi in računalništvom. Ukvarjam se z različnimi pristopi k računalniškemu modeliranju bioloških sistemov in z zmožnostmi gradnje umetnih bioloških sistemov zmožnih procesiranja podatkov. Poleg tega me zanima še področja mehke logike, umetnega življenja in senzorskih omrežij.\nIzobrazba\nDiploma na Fakulteti za računalništvo in informatiko (2007)\nDoktorat na Fakulteti za računalništvo in informatiko (2012)\n",
    "name": "Miha Moškon",
    "linkEn": "/en/employees/miha-moskon"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/martin-mozina-1",
    "descSl": null,
    "name": "Martin Možina",
    "linkEn": "/en/employees/martin-mozina-1"
  },
  {
    "descEn": "\nI am a mathematician teaching computer science students math. My research interests are connected to topology and its applications to computer science. Lately I have been working mostly in computational topology. Computational topoogy is an exciting growing field on the border between mathematics and computer science, the central topic of the European Science Foundation networking programme  Algebraic and Computational Topology. I am also a member of the Institute for Mathematics, Physics and Mechanics of Slovenia. \n",
    "linkSl": "/sl/o-fakulteti/osebje/nezka-mramor-kosta",
    "descSl": "\nŠtudente računalništva in informatike na FRI z veseljem poučujem matematiko. Moje raziskovalno delo je povezano z uporabo matematičnih metod v računalništvu. Zadnje čase me najbolj zanima področje računske topologije, bolj natančno, topološke analize podatkov. Računska topologija je dokaj novo znanstveno področje na meji med matematiko in računalništvom, ki pa se zadnja leta močno razvija.\n",
    "name": "Nežka Mramor Kosta",
    "linkEn": "/en/employees/nezka-mramor-kosta"
  },
  {
    "descEn": "\n1. PETRONI, Mattia, ZIMIC, Nikolaj, MRAZ, Miha, MOŠKON, Miha. Stochastic simulation algorithm for gene regulatory networks with multiple binding sites. Journal of computational biology, ISSN 1557-8666. [Online ed.], 2015, 1-9, ilustr. http://online.liebertpub.com/doi/abs/10.1089/cmb.2014.0064, doi: 10.1089/cmb.2014.0064. [JCR]\n2.STRAŽAR, Martin, MRAZ, Miha, ZIMIC, Nikolaj, MOŠKON, Miha. An adaptive genetic algorithm for parameter estimation of biological oscillator models to achieve target quantitative system response. Natural computing, ISSN 1567-7818, Mar. 2014, vol. 13, no. 1, str. 119-127, https://repozitorij.uni-lj.si/IzpisGradiva.php?id=49737, [JCR]\n3. MOŠKON, Miha, MRAZ, Miha. Systematic approach to computational design of gene regulatory networks with information processing capabilities. IEEE/ACM transactions on computational biology and bioinformatics, ISSN 1545-5963. [Print ed.], 2014, vol. 11, no. 2, str. 431-440, ilustr. http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=6690102, doi: 10.1109/TCBB.2013.2295792. [COBISS.SI-ID 10323028], [JCR]\n4. MOŠKON, Miha, NOVAK, Štefan, MEDEOT, Marino, LEBAR BAJEC, Iztok, ZIMIC, Nikolaj, MRAZ, Miha. Solving the logistic problems with optimal resource assignment using fuzzy logic methods. J. adv. transp., June 2013, str. 447-460, ilustr. http://onlinelibrary.wiley.com/doi/10.1002/atr.173/abstract, doi: 10.1002/atr.173. [COBISS.SI-ID 8198740], [JCR]\n5.  MOŠKON, Miha, MRAZ, Miha. Modelling and analysing the information processing capabilities of simple biological systems. Math. model. anal. (Spaud.), Sep. 2012, vol. 17, no. 4, str. 467-484, graf. prikazi. http://inga.vgtu.lt/~art/. [COBISS.SI-ID 9330004], [JCR]\n6. JANEŽ, Miha, PEČAR, Primož, MRAZ, Miha. Layout design of manufacturable quantum-dot cellular automata. Microelectron. j.. [Print ed.], Jul. 2012, vol. 43, no. 7, str. 501-513, ilustr. http://www.sciencedirect.com/science/article/pii/S0026269212000717. [COBISS.SI-ID 9040468], [JCR] \n7. LEBAR BAJEC, Iztok, MRAZ, Miha. Multi-valued logic based on quantum-dot cellular automata. Int. j. unconv. comput.. [Print ed.], 2007, vol. 3, no. 4, str. 311-322, ilustr. [COBISS.SI-ID 6082644], [JCR]\n8. LEBAR BAJEC, Iztok, ZIMIC, Nikolaj, MRAZ, Miha. The ternary quantum-dot cell and ternary logic. Nanotechnology (Bristol), 2006, vol. 17, no. 8, str. 1937-1942, ilustr. [COBISS.SI-ID 5201748] , [JCR]\n9. LEBAR BAJEC, Iztok, ZIMIC, Nikolaj, MRAZ, Miha. Towards the bottom-up concept : extended quantum-dot cellular automata. Microelectron. eng.. [Print ed.], 2006, vol. 83, no. 4/9, str. 1826-1829, ilustr. [COBISS.SI-ID 5212244] , [JCR]\n10. LEBAR BAJEC, Iztok, ZIMIC, Nikolaj, MRAZ, Miha. Simulating flocks on the wing : the fuzzy approach. J. theor. biol., Mar. 2005, vol. 233, no. 2, str. [199]-220, ilustr. [COBISS.SI-ID 4574804] , [JCR]\n",
    "linkSl": "/sl/o-fakulteti/osebje/miha-mraz",
    "descSl": "\nSem redni profesor na Fakulteti za računalništvo in informatiko, kjer predavam predmete s področij modeliranja, nekonvenvionalnega procesiranja, ter vrednotenja zmogljivosti in zanesljivosti računalniških sistemov. Raziskovalno me zanimata predvsem področji alternativnih procesnih platform in alternativnih decizijskih postopkov (angl. unconventional computing).\n",
    "name": "Miha Mraz",
    "linkEn": "/en/employees/miha-mraz"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/jon-natanael-muhovic",
    "descSl": null,
    "name": "Jon Natanael Muhovič",
    "linkEn": "/en/employees/jon-natanael-muhovic"
  },
  {
    "descEn": "\nMiha Nagelj is a research assistant at University of Ljubljana, Faculty of Computer and Information Science. He is also a PhD student in Computer and Information Science in the Laboratory for Integration of Information Systems under the supervision of prof. Matjaž B. Jurič.\n",
    "linkSl": "/sl/o-fakulteti/osebje/miha-nagelj",
    "descSl": "\nMiha Nagelj je mladi raziskovalec na Fakulteri za računalništvo in informatiko na Univerzi v Ljubljani. Na fakulteti opravlja tudi doktorski študij računalništva in informatike v Laboratoriju za integracijo informacijskih sistemov pod mentorstvom prof. dr. Matjaža B. Juriča.\n",
    "name": "Miha Nagelj",
    "linkEn": "/en/employees/miha-nagelj"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/matej-nanut",
    "descSl": null,
    "name": "Matej Nanut",
    "linkEn": "/en/employees/matej-nanut"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/polona-oblak",
    "descSl": null,
    "name": "Polona Oblak",
    "linkEn": "/en/employees/polona-oblak"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/tanja-oblak-crnic",
    "descSl": null,
    "name": "Tanja Oblak Črnič",
    "linkEn": "/en/employees/tanja-oblak-crnic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/amra-omanovic",
    "descSl": null,
    "name": "Amra Omanović",
    "linkEn": "/en/employees/amra-omanovic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/bojan-orel",
    "descSl": "\nSem redni profesor na Fakulteti za računalništvo in informatiko, kjer predavam matematične predmete.\nPri raziskovalnem delu se ukvarjam z numerično analizo, predvsem me zanimajo metode za reševanje diferencialnih enačb.\n",
    "name": "Bojan Orel",
    "linkEn": "/en/employees/bojan-orel"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/radko-osredkar",
    "descSl": null,
    "name": "Radko Osredkar",
    "linkEn": "/en/employees/radko-osredkar"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/matjaz-pancur",
    "descSl": null,
    "name": "Matjaž Pančur",
    "linkEn": "/en/employees/matjaz-pancur"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/jan-pavlin-0",
    "descSl": null,
    "name": "Jan Pavlin",
    "linkEn": "/en/employees/jan-pavlin-0"
  },
  {
    "descEn": "\nCo-organizer of the Unconstrained Ear Recognition Challenge @ IEEE/IAPR International Joint Conference on Biometrics\nCo-guest editor @ IET Biometrics; special issue: Unconstrained Ear Recognition\nCoordinator of the double degree study programme with the Kyungpook National University, South Korea\n",
    "linkSl": "/sl/o-fakulteti/osebje/peter-peer",
    "descSl": "\nSoorganizator tekmovanja Unconstrained Ear Recognition Challenge @ IEEE/IAPR International Joint Conference on Biometrics\nGostujoči sourednik @ IET Biometrics; posebna številka: Unconstrained Ear Recognition\nKoordinator dvojnega študijskega programa s Kyungpook National University, Južna Koreja\n\n",
    "name": "Peter Peer",
    "linkEn": "/en/employees/peter-peer"
  },
  {
    "descEn": "\nI am an assistant professor at the Faculty of Computer and Information Science, University of Ljubljana, Slovenia. My research covers mobile computing, wireless networks and information and communicaton technologies for development. Lately I have been focused on mobile sensing, anticipatory mobile computing, and the analysis of mobile data traces.\nActivities and Events\n\nI am looking for motivated PhD students! I have a number of active and potential projects on mobile sensing, mobile data analysis, and data for development, and I am looking for people to work with on these. The University of Ljubljana, Slovenia is one of the top research universities in the region, offers a range of teaching and research fellowships and is located in one of the most beautiful parts of Europe. Please email me (Veljko.Pejovic [at] fri.uni-lj.si) if you want to chat about PhD studies here.\nIn addition, please get in contact if you are interested in doing your bachelor or masters thesis under my supervision.\n\nEducation\n\n\nPhD, Computer Science, University of California, Santa Barbara, USA, 2012\ndipl. ing (BS) University of Belgrade, Serbia, 2006\n\n\n",
    "linkSl": "/sl/o-fakulteti/osebje/veljko-pejovic",
    "descSl": "\n\nV. Pejovic\nInvestigating The Role of Task Engagement in Mobile Interruptibility\r\n\tTo appear at Smarttention, Please! Intelligent Attention Management on Mobile Devices Workshop, collocated with MobileHCI, Copenhagen, Denmark, August 2015.\nA. Lima, M. De Domenico, V. Pejovic and M. Musolesi\nDisease Containment Strategies based on Mobility and Information Dissemination \r\n\tNature Scientific Reports, 10650; doi: 10.1038/srep10650 (2015).\nV. Pejovic and M. Musolesi\nAnticipatory Mobile Computing: A Survey of the State of the Art and Research Challenges\r\n\tACM Computing Surveys, Volume 47 Issue 3, April 2015.\nV. Pejovic, D. L. Johnson, M. Zheleva, E. M. Belding and A. Lysko\nVillageLink: A Channel Allocation Technique for Wide-Area White Space Networks.\r\n\tIn White Space Communication (pp. 249-280). Springer International Publishing, 2015.\nA. Mehrotra, V. Pejovic and M. Musolesi\nSenSocial: A Middleware for Integrating Online Social Networks and Mobile Sensing Data Streams\r\n\tTo appear in ACM/IFIP/USENIX Middleware'14, Bordeaux, France, December 2014.\nV. Pejovic and M. Musolesi\nAnticipatory Mobile Computing for Behaviour Change Interventions\r\n\tMobile Systems for Computational Social Science Workshop (with UbiComp'14), Seattle, WA, USA, September 2014.\nV. Pejovic and M. Musolesi\nInterruptMe: Designing Intelligent Prompting Mechanisms for Pervasive Applications\r\n\tUbiComp'14, Seattle, WA, USA, September 2014. Best Paper Nominee (top 4%).\nV. Pejovic, D. L. Johnson, M. Zheleva, E. M. Belding and A. Lysko\nVillageLink: Wide-Area Wireless Coverage\r\n\tCOMSNETS'14, Bangalore, India, January 2014.\nN. Lathia, V. Pejovic, K. Rachuri, C. Mascolo, M. Musolesi and P. J. Rentfrow\nSmartphones for Large-Scale Behavior Change Intervention\r\n\tIEEE Pervasive Computing, Vol 12 (3), (2013)\nA. Lima, M. De Domenico, V. Pejovic and M. Musolesi\nExploiting Cellular Data for Disease Containment and Information Campaigns Strategies in Country-Wide Epidemics\r\n\tThird International Conference on the Analysis of Mobile Phone Datasets (NETMOB'13). Boston, MA, USA, May 2013.\nV. Pejovic and E. M. Belding\nWhiteRate: A Context-aware Approach to Wireless Transmission Adaptation.\r\n\tIEEE Transactions on Mobile Computing, in press, (2013)\nV. Pejovic, D. L. Johnson, M. Zheleva,E. M. Belding, L. Parks and G. van Stam\nThe Bandwidth Divide: Obstacles to Efficient Broadband Adoption in Rural Sub-Saharan Africa.\r\n\tInternational Journal of Communication, Vol 6 (2012).\nD.L. Johnson, V. Pejovic, E. M. Belding and G. van Stam\nVillageShare: Facilitating content generation and sharing in rural networks.\r\n\tACM DEV'12, Atlanta, GA, USA, March 2012.\nA.Anand, V. Pejovic, E. M. Belding and D. L. Johnson\nVillageCell: Cost Effective Cellular Connectivity in Rural Areas.\r\n\tICTD'12, Atlanta, GA, USA, March 2012.\nVillageCell poster\nV. Pejovic and E. M. Belding\nA Context-aware Approach to Wireless Transmission Adaptation.\r\n\tIEEE SECON'11, Salt Lake City, UT, USA, June 2011.\nWhiteRate source code\nD. L. Johnson, V. Pejovic, E. M. Belding, and G. van Stam\nTraffic Characterization and Internet Usage in Rural Africa.\r\n\tWWW, Hyderabad, India, March 2011.\nPresentation at UCSB MAT by Elizabeth Belding and Veljko Pejovic\nM. P. Wittie, V. Pejovic, L. Deek, K. C. Almeroth, and B. Y. Zhao,\nExploiting Locality of Interest in Online Social Network.\r\n\tACM CoNEXT, Philadelphia, PA, USA, December 2010.\nMedia coverage in IEEE Spectrum\nV. Pejovic and E. M. Belding,\nEnergy-Efficient Communication in Next Generation Rural-Area Wireless Networks.\r\n\tThe Second ACM SIGMOBILE Workshop on Cognitive Wireless Networking (CoRoNet), Chicago, IL, USA, September 2010.\nV. Pejovic, E. M. Belding and M. Marina,\nAn Energy-Flow Model for Self-Powered Routers and its Application for Energy-Aware Routing.\r\n\tNetworked Systems for Developing Regions (NSDR) Workshop, Big Sky, MT, USA, October 2009.\n\n \n",
    "name": "Veljko Pejović",
    "linkEn": "/en/employees/veljko-pejovic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/darja-peljhan",
    "descSl": null,
    "name": "Darja Peljhan",
    "linkEn": "/en/employees/darja-peljhan"
  },
  {
    "descEn": "\nTeaching assistant for the following courses:\n\nE-learning (masters)\nMultimedia technologies\n\nhttp://www.musiclab.si\nhttp://www.naspletu.org\n",
    "linkSl": "/sl/o-fakulteti/osebje/matevz-pesek",
    "descSl": "\nhttp://www.musiclab.si\nhttp://www.naspletu.org\n",
    "name": "Matevž Pesek",
    "linkEn": "/en/employees/matevz-pesek"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/irena-pestotnik",
    "descSl": null,
    "name": "Irena Pestotnik",
    "linkEn": "/en/employees/irena-pestotnik"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/zvonimir-petkovsek",
    "descSl": null,
    "name": "Zvonimir Petkovšek",
    "linkEn": "/en/employees/zvonimir-petkovsek"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/matej-piculin",
    "descSl": "\nMatej Pičulin je doktorski študent-asistent v zadnjem letniku študija. Raziskovalno se ukvarja z uporabo pristopov evolucijskega računanja v strojnem učenju.\n",
    "name": "Matej Pičulin",
    "linkEn": "/en/employees/matej-piculin"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/ratko-pilipovic",
    "descSl": null,
    "name": "Ratko Pilipović",
    "linkEn": "/en/employees/ratko-pilipovic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/ljubo-pipan",
    "descSl": null,
    "name": "Ljubo Pipan",
    "linkEn": "/en/employees/ljubo-pipan"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/ziga-pirnar",
    "descSl": null,
    "name": "Žiga Pirnar",
    "linkEn": "/en/employees/ziga-pirnar"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/gregor-pirs",
    "descSl": null,
    "name": "Gregor Pirš",
    "linkEn": "/en/employees/gregor-pirs"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/david-podgorelec",
    "descSl": null,
    "name": "David Podgorelec",
    "linkEn": "/en/employees/david-podgorelec"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/matevz-pogacnik",
    "descSl": null,
    "name": "Matevž Pogačnik",
    "linkEn": "/en/employees/matevz-pogacnik"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/rok-povsic",
    "descSl": null,
    "name": "Rok Povšič",
    "linkEn": "/en/employees/rok-povsic"
  },
  {
    "descEn": "\nMarko Poženel is an Assistant. His main areas of research include Agile methods of software developments and clickstream data.\n",
    "linkSl": "/sl/o-fakulteti/osebje/marko-pozenel",
    "descSl": "\nLep pozdrav. Sem asistent na Fakulteti za računalništvo in informatiko za področje računalništvo in informatika. Vodim vaje pri predmetih: Programiranje I, Osnove programiranja I in Tehnologija informacijskih sistemov.\n",
    "name": "Marko Poženel",
    "linkEn": "/en/employees/marko-pozenel"
  },
  {
    "descEn": "\nAjda Pretnar is a researcher at the Faculty of Computer and Information Science and a PhD student the at Faculty of Arts. She is combining anthropology and machine learning to find new methodologies for computational social sciences. She also teaches data mining and machine learning with Orange.\nEDUCATION\n2012 - B.A. degree from the Faculty of Arts, University of Ljubljana, Slovenia\n2014 - M.A. degree from the School of Political Sciences, University of Bologna, Italy\n",
    "linkSl": "/sl/o-fakulteti/osebje/ajda-pretnar",
    "descSl": "\nAjda Pretnar je raziskovalka na Fakulteti za računalništvo in informatiko in doktorkska študentka na Filozofski fakulteti Univerze v Ljubljani. S povezovanjem antropologije in strojnega učenja razvija nove računalniško podprte metodologije za družboslovne vede. Poučuje podatkovno rudarjenje in strojno učenje z orodjem za podatkovno analitiko Orange.\nIZOBRAZBA\n2012 - Etnologija in kulturna antropologija (1. bolonjska stopnja), Filozofska fakulteta, Univerza v Ljubljani\n2014 - Interdisciplinarne raziskave in študiji Vzhodne Evrope (2. bolonjska stopnja), Šola za politične vede, Univerza v Bologni, Italija\n",
    "name": "Ajda Pretnar",
    "linkEn": "/en/employees/ajda-pretnar"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/matej-prijatelj",
    "descSl": null,
    "name": "Matej Prijatelj",
    "linkEn": "/en/employees/matej-prijatelj"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/ziga-pusnik",
    "descSl": null,
    "name": "Žiga Pušnik",
    "linkEn": "/en/employees/ziga-pusnik"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/martin-raic",
    "descSl": null,
    "name": "Martin Raič",
    "linkEn": "/en/employees/martin-raic"
  },
  {
    "descEn": "\nČLANKI:\n\nPETRIČ, Karl, PETRIČ, Teodor, KRISPER, Marjan, RAJKOVIČ, Vladislav. User profiling on a pilot digital library with the final result of a new adaptive knowledge management solution. Knowl. organ., 2011, vol. 38, no. 2, str. 96-113.\nRAJKOVIČ, Vladislav. Group decision making : integrating different interests into a joint decision. Organizacija (Kranj), 2011, let. 44, št. 6, str. 175-178, doi: 10.2478/v10051-011-0018-5.\nKLJAJIĆ BORŠTNAR, Mirjana, KLJAJIĆ, Miroljub, ŠKRABA, Andrej, KOFJAČ, Davorin, RAJKOVIČ, Vladislav. The relevance of facilitation in group decision making supported by a simulation model. Syst. dyn. rev., 2011, vol. 27, no. 3, str. 270-293.\nKOVAČ, Tatjana, RESMAN, Metod, RAJKOVIČ, Vladislav. The model for evaluating the influence of student participation on school quality. Napredak, 2010, god. 151, br. 3-4, str. 335-349.\nŠUŠTERŠIČ, Olga, RAJKOVIČ, Uroš, DINEVSKI, Dejan, JEREB, Eva, RAJKOVIČ, Vladislav. Evaluating patients' health using a hierarchical multi-attribute decision model. J. int. med. res., 2009, vol. 37, no. 5, str. 1646-1654.\nCUNDRIČ, Andreja, KERN, Tomaž, RAJKOVIČ, Vladislav. A qualitative model for road investment appraisal. Transp. policy (Oxf.)., jul. 2008, vol. 15, no. 4, str. 225-231.\nPIVK, Aleksander, CIMIANO, Philipp, SURE, York, GAMS, Matjaž, RAJKOVIČ, Vladislav, STUDER, Rudi. Transforming arbitrary tables into logical form with TARTAR. Data knowl. eng., 2007, vol. 60, no. 3, str. 567-595.\nJEREB, Eva, RAJKOVIČ, Uroš, RAJKOVIČ, Vladislav. A hierarchical multi-attribute system approach to personnel selection. Int. j. sel. assess., 2005, vol. 13, no. 3, str. 198-205.\nRAJKOVIČ, Vladislav, ŠUŠTERŠIČ, Olga, RAJKOVIČ, Uroš, PORENTA, Aleš. Slovenski pregledovalnik mednarodne klasifikacije prakse zdravstvene nege = Slovene browser for international classification for nursing practice (ICNP). Obzor. zdrav. neg., 2004, letn. 38, št. 3, str. 193-197.\nLESKOŠEK, Bojan, BOHANEC, Marko, RAJKOVIČ, Vladislav. The use of expert methods in the orientation of children into different sports. Acta Univ. Carol., Kinanthropol., 2002, vol. 38, no. 2, str. 33-44, tabele, graf. prikazi.\nŠUŠTERŠIČ, Olga, RAJKOVIČ, Vladislav, LESKOVAR, Robert, BITENC, Iztok, BERNIK, Mojca, RAJKOVIČ, Uroš. An information system for community nursing. Public health nurs. (Boston, Mass.), 2002, vol. 19, no. 3, str. 184-190.\nTOMŠIČ, Blaž, RAJKOVIČ, Vladislav. Uporaba lupine ekspertnega sistema DEX v procesu načrtovanja delovanj. Bilt. Slov. vojs., 2001, letn. 3, št. 2, str. 57-65.\nJEREB, Eva, RAJKOVIČ, Vladislav. Use of an expert system in personnel selection. Inf. manag., Jul./Dec. 2001, vol. 14, no. 3/4, str. 12-13, 24-25, 28.\nBOHANEC, Marko, CESTNIK, Bojan, RAJKOVIČ, Vladislav. Quasitative multi-attribute modeling and its application housting. Revue des systèmes de décision, 2001, vol. 10, str. 175-193.\nBOHANEC, Marko, ZUPAN, Blaž, RAJKOVIČ, Vladislav. Applications of qualitative multi-attribute decision models in health care. International journal of medical informatics., 2000, vol. 58-59, str. 191-205.\nBOHANEC, Marko, RAJKOVIČ, Vladislav. Multi-attribute decision modeling : industrial applications of DEX. Informatica (Ljublj.), 1999, vol. 23, spec. issue, No. 4, str. 487-491.\nBOHANEC, Marko, RAJKOVIČ, Vladislav, SEMOLIČ, Brane, POGAČNIK, Aljana. Knowledge-based portfolio analysis for project evaluation. Inf. manage., 1995, 28, št. 5, str. 293-302.\nBOHANEC, Marko, URH, Božo, RAJKOVIČ, Vladislav. Evaluating options by combined qualitative and quantitative methods. Acta psychol., 1992, vol. 80, no. 1/3, str. 67-89.\nBOHANEC, Marko, RAJKOVIČ, Vladislav. DEX : an expert system shell for decision support. Sistemica (Lima), 1990, vol. 1, str. 145-157.\nRAJKOVIČ, Vladislav, BOHANEC, Marko, BATAGELJ, Vladimir. Knowledge engineering techniques for utility identification. Acta psychol., 1988, let. 68, št. 1/3, str. 271-286.\nEFSTATHIOU, J., RAJKOVIČ, Vladislav. Multiattribute decision making using a fuzzy heuristic approach. IEEE trans. syst. man cybern., 1979, vol. 9, str. 326-333.\nEFSTATHIOU, J., RAJKOVIČ, Vladislav. Multi-attribute using fuzzy, heuristic approach. Int. j. man-mach. stud., 1979, vol. 12, str. 141-156.\n\nUČBENIKI:\n\nJEREB, Eva, BOHANEC, Marko, RAJKOVIČ, Vladislav. Dexi : računalniški program za večparametrsko odločanje : uporabniški priročnik. Kranj: Moderna organizacija, 2003. 91 str., graf. prikazi. ISBN 961-232-149-3.\nKRAPEŽ, Alenka, RAJKOVIČ, Vladislav. Tehnologije znanja pri predmetu informatika : vodnik za izpeljavo sklopa tehnologije znanja, (Modeli poučevanja in učenja, Informatika). 1. natis. Ljubljana: Zavod Republike Slovenije za šolstvo, 2003. 92 str., ilustr. ISBN 961-234-440-X.\nBRATKO, Ivan, RAJKOVIČ, Vladislav. Računarstvo s programskim jezikom Paskal, (Biblioteka Zanimljiva nauka). 2. izd. Beograd: Nolit, 1989. 391 str., ilustr. ISBN 86-19-01714-4.\nBRATKO, Ivan, RAJKOVIČ, Vladislav. Računarstvo s programskim jezikom Paskal, (Biblioteka Zanimljiva nauka). Beograd: Nolit, 1986. 391 str., ilustr. ISBN 86-19-00914-1.\n\nUREDNIŠTVO:\n\nKERN, Tomaž (ur.), RAJKOVIČ, Vladislav (ur.). People and sustainable organization. Frankfurt am Main: Peter Lang, 2011. 439 str., ilustr., tabele. ISBN 978-3-631-62113-4.\nRAJKOVIČ, Vladislav (ur.), ŠUŠTERŠIČ, Olga (ur.). Informacijski sistem patronažne zdravstvene nege. Kranj: SZF, 1999. 86.\nŠUŠTERŠIČ, Olga (ur.), ŠLAJMER JAPELJ, Majda (ur.), CIBIC, Darja (ur.), RAJKOVIČ, Vladislav (ur.). Mednarodna klasifikacija prakse zdravstvene nege : alfa verzija. Kranj: Moderna organizacija, 1998. 136 str., graf. prikazi. ISBN 961-232-026-8.\nBOHANEC, Marko (ur.), KAPUS, Venceslav (ur.), LESKOŠEK, Bojan (ur.), RAJKOVIČ, Vladislav (ur.). Talent : ekspertni sistem za usmerjanje otrok in mladine v športne panoge, Uporabniški priročnik, (Računalniško opismenjevanje). 2. natis. Ljubljana; Ministrstvo za šolstvo in šport: Zavod Republike Slovenije za šolstvo, 1997. 97 str., graf. prikazi, tabele. ISBN 961-234-017-X.\nBERKELEY, Dina (ur.), WIDEMEYER, George R. (ur.), BREZILLON, Patrick (ur.), RAJKOVIČ, Vladislav (ur.). Context sensitive decision support systems. 1st ed. London [etc.]: Chapman & Hall, 1998. XI, 265 str., graf. prikazi. ISBN 0-412-83740-4.\n\n",
    "linkSl": "/sl/o-fakulteti/osebje/vladislav-rajkovic",
    "descSl": "\nVladislav Rajkovič (http://lopes1.fov.uni-mb.si) je profesor za področje informacijskih sistemov na Univerzi v Mariboru, Fakulteti za organizacijske vede in raziskovalni sodelavec Inštituta Jožef Stefan, odsek za inteligentne sisteme. Poučuje predmete s področij informacijskih sistemov, baz podatkov, podatkovnih komunikacij in sistemov za podporo odločanju na dodiplomskem in podiplomskem študiju. Njegovo raziskovalno področje predstavljajo informacijski sistemi in metode umetne inteligence za pomoč pri odločanju. V zadnjem času se še posebej ukvarja z uporabo hierarhičnih odločitvenih modelov na področju e-zdravstva. Je ustanovni član Slovenskega društva informatika in Association of Information Systems. Sodeluje v uredniških odborih domačih in tujih revij. Vodil oz. sodeloval je pri številnih projektih s področja informacijskih sistemov s posebnim poudarkom na podpori kompleksnim odločitvenim procesom. Vrsto let sodeluje pri uvajanju računalništva in informatike v slovenske šole.\nIzobrazba\nUniverzitetna diploma (1970) na Fakulteti za elektrotehniko, Univerza v Ljubljani.\nMagisterij (1975) na Fakulteti za elektrotehniko, Univerza v Ljubljani.\nDoktorat (1987) na Fakulteti za elektrotehniko in računalništvo, Univerza v Ljubljani.\nIzkušnje\nUniverzitetna diploma (1970) na Fakulteti za elektrotehniko, Univerza v Ljubljani.\nMagisterij (1975) na Fakulteti za elektrotehniko, Univerza v Ljubljani.\nDoktorat (1987) na Fakulteti za elektrotehniko in računalništvo, Univerza v Ljubljani.\n",
    "name": "Vladislav Rajkovič",
    "linkEn": "/en/employees/vladislav-rajkovic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/jan-ravnik",
    "descSl": null,
    "name": "Jan Ravnik",
    "linkEn": "/en/employees/jan-ravnik"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/mateja-ravnik",
    "descSl": null,
    "name": "Mateja Ravnik",
    "linkEn": "/en/employees/mateja-ravnik"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/andreja-retelj",
    "descSl": null,
    "name": "Andreja Retelj",
    "linkEn": "/en/employees/andreja-retelj"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/matija-rezar",
    "descSl": null,
    "name": "Matija Rezar",
    "linkEn": "/en/employees/matija-rezar"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/anze-rezelj",
    "descSl": null,
    "name": "Anže Rezelj",
    "linkEn": "/en/employees/anze-rezelj"
  },
  {
    "descEn": "\nBorut Robič is a Professor of computer science at the Faculty of Computer and Information Science, University of Ljubljana. He is a Head of the Theoretical Computer Science Chair, and Head of the Laboratory for Algorithmics. Since 2005 he has been serving as the president of the Academic Assembly of the faculty. His research interests are in computability and complexity theory,  algorithms, and parallel computing. Prof. Robič is the author of The Foundations of Computability Theory, and co-author of the Processor Architecture, and Introduction to Parallel Computing.\n",
    "linkSl": "/sl/o-fakulteti/osebje/borut-robic",
    "descSl": "\nBorut Robič je redni profesor računalništva in informatike, predstojnik Katedre za teoretično računalništvo  in predstojnik Laboratorija za algoritmiko na Fakulteti za računalništvo in informatiko Univerze v Ljubljani. Od 2005 je predsednik Akademskega zbora fakultete. Ukvarja se s področji izračunljivosti, računske zahtevnosti, algoritmov in vzporednega računanja. Je avtor monografij The Foundations of Computability Theory in soavtor monografij Introduction to Parallel Computing ter Processor Architecture.\n",
    "name": "Borut Robič",
    "linkEn": "/en/employees/borut-robic"
  },
  {
    "descEn": "\nMy research interests include machine learning, data mining, intelligent data analysis, cognitive modeling, artificial intelligence, and their applications. In machine learning and data mining I am interested in ensemble learning, feature evaluation, probability prediction, cost-sensitive learning, feature subset selection, regression, natural language processing, and constructive induction (recent papers, free software). I am (co)author of approximately 50 publications. My papers have more than 2000 citations according to Scholar.\nMore about me is on my personal web site. I tweet as @MarkoRobnikS.\nEducation\nI received my Ph.D. in Computer Science and Informatics from University of Ljubljana, Faculty of Computer and Information Sciences in 2001 (I graduated in 1993 and finished my M.Sc. in 1997 at the same institution). \n",
    "linkSl": "/sl/o-fakulteti/osebje/marko-robnik-sikonja",
    "descSl": "\nRaziskovalno delam na področjih strojnega učenja, podatkovnega rudarjenja in analitike, inteligentne analize podatkov, iskanja znanja iz podatkov, kognitivnega modeliranja, umetne inteligence in njihove uporabe. V okviru strojnega učenja me še posebej zanimajo ocenjevanje atributov, razlaga prediktorjev, cenovno občutljivo učenje, učenje verjetnosti, obdelava naravnega jezika, regresija, konstruktivna indukcija in statistične metode,(nekaj člankov, prosto dostopna programska oprema). Sem avtor ali soavtor okoli 60 publikacij. Moji članki so v mednarodnih publikacijah citirani več kot 2000 krat.\nŠtudentje pred zaključkom študija si lahko ogledajo teme diplomskih nalog, ki jih predlagam.\nNekaj o meni je na moji osebni strani. Na Twitterju sem @MarkoRobnikS.\nIzobrazba\nLeta 2001 sem doktoriral iz računalništva in informatike, leta 1997 magistriral in leta 1993 diplomiral na Fakulteti za računalništvo in informatiko Univerze v Ljubljani. \n",
    "name": "Marko Robnik Šikonja",
    "linkEn": "/en/employees/marko-robnik-sikonja"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/igor-rozanc",
    "descSl": "\nIgor Rožanc je višji predavatelj na Fakulteti za računalništvo. Pedagoško sodeluje predvsem pri predmetih s področja programiranja in razvoja programske opreme, kjer je v zadnjem času tudi predavatelj pri predmetih I. bolonjske stopnje Algoritmi in podatkovne strukture I in Testiranje in kakovost.  Raziskovalno se ukvarja s področjem tehnologije programske opreme, še zlasti z modeli za zagotavljanje kakovosti programske opreme, merjenjem ter testiranjem programske opreme. V okviru Laboratorija za tehnologijo programske opreme je vzdrževal stari spletni študijski informacijski sistem e-Študent. \nIzobrazba\n\nDoktor računalniških znanosti, maj 2003, Univerza v Ljubljani\nMagister računalništva in informatike, januar 1996, Fakulteta za računalništvo in informatiko\n(Univerzitetni) diplomirani inženir računalništva in informatike, december 1992, Fakulteta za računalništvo in informatiko\n\nIzkušnje\n\nDoktor računalniških znanosti, maj 2003, Univerza v Ljubljani\nMagister računalništva in informatike, januar 1996, Fakulteta za računalništvo in informatiko\n(Univerzitetni) diplomirani inženir računalništva in informatike, december 1992, Fakulteta za računalništvo in informatiko\n\n",
    "name": "Igor Rožanc",
    "linkEn": "/en/employees/igor-rozanc"
  },
  {
    "descEn": "\nMr. Robert Rozman is assistant for courses on Digital Signal Processing and Principles of Computer Architecture.\nHis research efforts focus on speech (processing, recognition and synthesis), spoken user interfaces and contemporary communications systems (VOIP and convergent communication technologies in general).\nActivities and Events\nHe finished Secondary Computer School in Maribor (SERŠ) and then studied computer science at the Faculty of  Computer and Information Science in Ljubljana, where he received BSc degree, MSc and PhD.\n",
    "linkSl": "/sl/o-fakulteti/osebje/robert-rozman",
    "descSl": "\nSem asistent na Fakulteti za računalništvo in informatiko, kjer vodim laboratorijske vaje pri predmetih Digitalno procesiranje signalov (UNI,VS) in Osnove računalniške arhitekture.\nRaziskovalno se ukvarjam s področji tvorbe, razpoznavanja in procesiranja govornih signalov, govornih uporabniških vmesnikov in sodobnih govornih komunikacij (spletne telefonije in širše področje konvergenčnih komunikacijskih tehnologij).\nIzobrazba\nSrednja elektro-računalniška šola v Mariboru (SERŠ). Diploma, magisterij in doktorat na Fakulteti za računalništvo in informatiko, Univerza v Ljubljani.\n",
    "name": "Robert Rozman",
    "linkEn": "/en/employees/robert-rozman"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/ksenija-rozman",
    "descSl": null,
    "name": "Ksenija Rozman",
    "linkEn": "/en/employees/ksenija-rozman"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/taja-runovc-0",
    "descSl": null,
    "name": "Taja Runovc",
    "linkEn": "/en/employees/taja-runovc-0"
  },
  {
    "descEn": "\nRok Rupnik is an Senior-lecturer of Information Systems at University of Ljubljana, Faculty of Computer and Information Science. He received his Master in Information Systems Engineering from University of Ljubljana, Slovenia, in 1998, and his Ph.D. in Mobile applications from University of Ljubljana, Slovenia, in 2002. His research interests include Electronic Business, Information Systems Development Methodologies, Mobile Applications, Data Mining, and CRM. His articles have appeared in proceedings of many international conferences and journals. He had an important role in various information systems development and other projects. He has strong practical and teaching interests in CRM implementation, Information Systems Strategic Planning, developing Data Mining applications and other areas. He is a member of AIS (Association of Information Systems), senior member of PMI (Project Management Institute) Slovenian Chapter, member of ACM and a member of IEEE.\n",
    "linkSl": "/sl/o-fakulteti/osebje/rok-rupnik",
    "descSl": "\nRok Rupnik je zaposlen kot višji predavatelj na Fakulteti za računalništvo in informatiko v Ljubljani, kjer je leta 1998 magistriral in leta 2002 doktoriral. Njegovo raziskovalno področje obsega metodologije razvoja informacijskih sistemov, širše področje elektronskega poslovanja, inteligentne agente, odkrivanje zakonitosti v pogatkih, stratško planiranje informacijskih sistemov ter mobilne aplikacije in mobinlo pposlovanje. V svoji karieri je sodeloval pri več razvojnih projektih informacijskih sistemov, na večini od njih v vlogi koordinatorja in vodje razvoja. Z vidno vlogo ali vlogo vodje oz. koordinatorja projekta pa je sodeloval tudi na različnih ostalih projektih širšega področja informacijskih sistemov: izdelave strateških planov razvoja informatike za večje poslovne sisteme, izdelava strateških študij, raziskovalni projekti, itd. Med drugim je tudi soavtor in urednik Enotne metodologije razvoja informacijskih sistemov. Je član Slovenskega društva informatika, IEEE, ACM, združenja AIS (Association for Information Systems), ISACA in ustanovitveni član slovenske sekcije PMI (Project Management Institute).\n",
    "name": "Rok Rupnik",
    "linkEn": "/en/employees/rok-rupnik"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/aleksander-sadikov",
    "descSl": null,
    "name": "Aleksander Sadikov",
    "linkEn": "/en/employees/aleksander-sadikov"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/miha-schaffer",
    "descSl": null,
    "name": "Miha Schaffer",
    "linkEn": "/en/employees/miha-schaffer"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/petra-simonic",
    "descSl": null,
    "name": "Petra Simonič",
    "linkEn": "/en/employees/petra-simonic"
  },
  {
    "descEn": "\nDanijel Skočaj is a researcher with the Faculty of Computer and Information Science, University of Ljubljana. He received the PhD degree from the same institution in 2003. His main research interests lie in the field of cognitive vision and artificial cognitive systems and include automatic modeling of objects from visual information with the emphasis on the robust and incremental appearance-based visual learning and recognition as well as the design and development of cognitive system with the emphasis on the interactive learning of categorical knowledge.\nActivities and Events\n\n\nCoorganizer of the Workshop on Interactive Robot Learning @ RSS 2008, Zurich, Švica, 28. junij 2008.\nWorkshops chair at the ECCV 2006, Graz, Austria, 7-13 May 2006.\nMember of the executive board o fthe Slovenian Pattern Recognition Society.\nCo-organizer of the Cognitive Systems Kickoff, Bled, Slovenia, 28-30 October 2004.\nProgram chair of the Computer Vision Winter Workshop 2004, Piran, Slovenia, 2-4 February 2004\n\n\n",
    "linkSl": "/sl/o-fakulteti/osebje/danijel-skocaj",
    "descSl": "\nDanijel Skočaj je docent na Fakulteti za računalništvo in informatiko Univerze v Ljubljani, kjer je leta 2003 tudi doktoriral. Njegovi glavni raziskovalni interesi segajo na področje umetnega spoznavnega vida ter spoznavnih sistemov in vključujejo avtomatsko modeliranje predmetov iz vizualne informacije s poudarkom na robustnem in inkrementalnem vizualnem učenju in razpoznavanju na podlagi videza ter snovanju in razvoju umetnih spoznavnih sistemov s poudarkom na interaktivnem učenju.\n",
    "name": "Danijel Skočaj",
    "linkEn": "/en/employees/danijel-skocaj"
  },
  {
    "descEn": "\nBoštjan Slivnik is an Assistant Professor. His main areas of research include compilers and grid techology.\nActivities and Events\n\nProgram Committee member of The Technical Track on \"Programming Languages\" of The ACM Symposium on Applied Computing (Fortaleza, Ceara, Brazil, March 16-20, 2008).\nProgram Committee member 1st Workshop on Advances in Programming Languages (WAPL 2007) of International Multiconference on Computer Science and Information Technology (Wisla, Poland, October 15-17, 2007).\nProgram Committee member of The Technical Track on \"Programming Languages\" of The ACM Symposium on Applied Computing (Seoul, Korea, March 11-15, 2007).\n\n",
    "linkSl": "/sl/o-fakulteti/osebje/bostjan-slivnik",
    "descSl": "\nBoštjan Slivnik je docent za računalništvo in informatiko. Njegovi glavni raziskovalni področji sta prevajalniki ter vzporedni in porazdeljeni sistemi.\n",
    "name": "Boštjan Slivnik",
    "linkEn": "/en/employees/bostjan-slivnik"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/davor-sluga",
    "descSl": "\nDoktorski študent v Laboratoriju za adaptivne sisteme in paralelno procesiranje pod mentorstvom izr. prof. dr. Uroša Lotriča.\n",
    "name": "Davor Sluga",
    "linkEn": "/en/employees/davor-sluga"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/ales-smodis",
    "descSl": null,
    "name": "Aleš Smodiš",
    "linkEn": "/en/employees/ales-smodis"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/tim-smole",
    "descSl": null,
    "name": "Tim Smole",
    "linkEn": "/en/employees/tim-smole"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/ales-smonig-grnjak",
    "descSl": null,
    "name": "Aleš Smonig Grnjak",
    "linkEn": "/en/employees/ales-smonig-grnjak"
  },
  {
    "descEn": "\nI am an assistant professor at the Faculty of Computer and Information science, University of Ljubljana, and member of the Laboratory for Biomedical Computer  Systems and Imaging. I  graduated in 1997, in 2000 I got my masters degree and in 2004 I defended my PhD thesis in the field of computer and information science at theFaculty of Computer and Information science, University of Ljubljana.\nMy research interests are in the field of designing and implementing user interfaces, usability testing, human computer interaction and analysis of biomedical signals.\n",
    "linkSl": "/sl/o-fakulteti/osebje/ales-smrdel",
    "descSl": "\nSem asistent na Fakulteti za računalništvo in informatiko  Univerze v Ljubljani ter član Laboratorija za biomedicinske računalniške sisteme in oslikave. Diplomiral sem leta 1997, leta 2000 sem magistriral  in leta 2004 doktoriral iz računalništva in informatike na Fakulteti za računalništvo in informatiko Univerze v Ljubljani.\nRaziskovalno delam na področju analize biomedicinskih signalov, specifično na analizi elektrokardiogramov, kjer se pretežno ukvarjam z odkrivanjem in karakterizacijo prehodnih ishemičnih epizod.\n",
    "name": "Aleš Smrdel",
    "linkEn": "/en/employees/ales-smrdel"
  },
  {
    "descEn": "\n\nFranc Solina.  15 sekund slave in virtualno smucanje / 15 Seconds of Fame and Virtual Skiing. Exhibition Catalogue. ArtNetLab, Ljubljana, 2005.\nFranc Solina.  15 seconds of fame. Leonardo 37(2):105-110+125, 2004.\nJaka Krivic, Franc Solina.  Part-level object recognition using superquadrics. Computer Vision and Image Understanding 95(2):105-126, 2004.\nAles Jaklic, Franc Solina.  Moments of Superellipsoids and their Application to Range Image Registration. IEEE Transactions on Society, Man and Cybernetics--Part B: Cybernetics 33(4):648--657, 2003.\nPeter Peer, Franc Solina.  Panoramic depth imaging: Single standard camera approach. International Journal of Computer Vision 47(1/2/3):149--160, 2002.\nFranc Solina, Slavko Krapez, Ales Jaklic.  Multimedia Dictionary and Synthesis of Sign Language. In Mahbubur Rahman Syed, Editor, Design and Management of Multimedia Information Systems Idea Group Publishing, Hershey PA, 2001, pages 268--281.\nAles Jaklic, Ales Leonardis, Franc Solina.  Segmentation and Recovery of Superquadrics. Computational imaging and vision 20, Kluwer, Dordrecht, 2000.\nAles Leonardis, Franc Solina, Ruzena Bajcsy, Editors. Confluence of Computer Vision and Computer Graphics. NATO Science Series 3. High Technology, Vol. 84, Kluwer, Dordrecth, 2000.\nBor Prihavec, Franc Solina.  User interface for video observation over the internet. Journal of network and computer applications 21:219-237, 1998.\nFranc Solina and Ales Leonardis.  Proper scale for modeling visual data. Image and Vision Computing 16(2):89--98, 1998.\nAles Leonardis, Ales Jaklic, and Franc Solina. Superquadrics for segmentation and modeling range data. IEEE Transactions on Pattern Recognition and Machine Intelligence PAMI-19(11):1289--1295, November 1997.\nFranc Solina and Ruzena Bajcsy.  Recovery of parametric models from range images: The case for superquadrics with global deformations. IEEE Transactions on Pattern Analysis and Machine Intelligence PAMI-12(2):131--147, 1990.\n\n",
    "linkSl": "/sl/o-fakulteti/osebje/franc-solina",
    "descSl": "\nFranc Solina je redni profesor računalništva in informatike in predstojnik Laboratorija za računalniski vid na Fakulteti za računalništvo in informatiko Univerze v Ljubljani.\nIzobrazba\n\nPh.D. Computer Science (1987), University of Pennsylvania, GRASP Lab\nDipl. Ing. (1979) in Mag. (1982) iz elektrotehnike, Univerza v Ljubljani, Fakulteta za elektrotehniko\nMatura (1974) Gimnazija Bežigrad, Ljubljana\n\n",
    "name": "Franc Solina",
    "linkEn": "/en/employees/franc-solina"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/blaz-sovdat",
    "descSl": null,
    "name": "Blaž Sovdat",
    "linkEn": "/en/employees/blaz-sovdat"
  },
  {
    "descEn": "\nI am a third year PhD student in Computer Science ant Faculty of Computer Science and member of the Bioinformatics Laboratory (Biolab). My research lies on the intersection of machine learning, bioinformatics and computational biology. Specifically, my work concerns learning from multiple data sources, kernel methods and low-rank matrix approximation, focusing on scability and computational complexity. These considerations are essential when dealing with large datasets, such as protein-RNA interactions or modeling gene regulatory networks.\n \nThe teaching duties include courses Introduction to Bioinformatics, Algorithms and Data Structures, Data Mining and Programming. In every course, I try to project the contents based on solid mathematical principles from logic, probability and linear algebra.\nActivities and Events\nI am a part of the Orange Data Mining development team.\n",
    "linkSl": "/sl/o-fakulteti/osebje/martin-strazar",
    "descSl": "\nSem študent doktorskega študija FRI in raziskovalec v Laboratoriju za bioinformatiko. Raziskovalno delujem na področjih strojnega učenja, bioinformatike in računske biologije. Natančneje, zanimajo me učenje iz več podatkovnih virov, jedrne metode (ang. kernel methods) in matrična faktorizacija, pri čemer se osredotočam na računsko zahtevnost in razumljivost modelov. Slednje igra bistveno vlogo pri problemih z velikimi podatkovnimi zbirkami, kot so interakcije med proteini in RNA ali modeliranje regulatornih genskih omrežij.\nUčim pri predmetih Uvod v Bioinformatiko, Testiranje in kakovost, Podatkovno rudarjenje in Osnove programiranja. Pri učenju poskušam študente navdušiti k čim bolj splošnemu razmišljanju in podajam snov na temeljih logike, verjetnostne teorije in linearne algebre.\nSem del ekipe razvijalcev Orange Data Mining in Single cell Orange.\n",
    "name": "Martin Stražar",
    "linkEn": "/en/employees/martin-strazar"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/enika-svete",
    "descSl": null,
    "name": "Enika Svete",
    "linkEn": "/en/employees/enika-svete"
  },
  {
    "descEn": "\nLuka Šajn was born on 24.10.1977 in Ljubljana, Slovenia. He finished his PhD studies from the University of Ljubljana in 2007 with the thesis \"Multi-resolution parametrization for texture classification and its application in analysis of scintigraphy images\". His research interests are in: automating medical report’s classification, cell counting, multi-resolution pattern parametrization, ischaemic heart-disease diagnosing from scintigraphic images and whole-body bone scintigraphy segmentation. Currently he is a researcher and an assistant professor at the same faculty.\nActivities and Events\n\nDissertation\nTitle\r\nMulti-resolution parametrization for texture classification and its application in analysis of scintigraphy images\nAbstract\r\nThe dissertation contributes to the new approaches in the major area of computer science, specifically in the domain field of machine learning, computer vision, texture parametrization and intelligent data analysis in medical applications. \r\nIn the dissertation multiresolutional texture parametrization is addressed and the original algorithm ARes for finding more informative resolutions in the sense of classification accuracy is proposed. ARes is designed to be used in combination with the existing parametrization algorithm ArTex developed by Bevk (2005). The results obtained using the ArTex parametrization algorithm in combination with ARes are compared with standard parametrization methods such as Gabor filters, Haar and Laws wavelets and Image Processor. \r\nOur study explores the multiresolutional texture parametrization approach based on the image content with regard to the parametrization quality, especially in case of the ArTex algorithm. The tested parametrization algorithms (geometric algorithms, signal processing methods and statistical methods) using multiresolutional approach have demonstrated significant improvements in results over one scale parametrization. This supports the hypothesis that the resolution selection is important for texture parametrization. The developed algorithm ARes in combination with the ArTex algorithm has shown to be an appropriate tool as it achieves statistically significant improvements over single resolution and also over equidistant resolutions. The algorithm ARes in many cases also improves the performance of other parametrization algorithms in comparison to single resolution approach, whereas compared to the equidistant resolution approach it usually shows no significant improvement. We have confirmed that the use of the equidistant resolution space when parameterizing textures significantly outperforms the use of the exponential resolution space, which is used by majority of authors.\r\nFor the multiresolution parametrization applicative domain two medical cases have been used, sequential diagnostics of coronary artery disease and diagnostics of whole-body bone scintigraphy.\n\n",
    "linkSl": "/sl/o-fakulteti/osebje/luka-sajn",
    "descSl": "\nLuka Šajn je zaposlen kot asistent v Laboratoriju za računalniški vid. Sodeluje pri izvajanju vaj na univerzitetnem in visokem strokovnem študiju računalništva in informatike. Na raziskovalnem področju se ukvarja s strojnim učenjem, analizo tekstur, večresolucijsko parametrizacijo, analizo medicinskih slik in segmentacijo človeškega okostja.\nIzobrazba\n2002 - univerzitetni dipl. inž. računalništva in informatike\n2007 - doktor znanosti\n",
    "name": "Luka Šajn",
    "linkEn": "/en/employees/luka-sajn"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/luka-sarc",
    "descSl": null,
    "name": "Luka Šarc",
    "linkEn": "/en/employees/luka-sarc"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/gregor-sega",
    "descSl": null,
    "name": "Gregor Šega",
    "linkEn": "/en/employees/gregor-sega"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/andrej-seruga",
    "descSl": null,
    "name": "Andrej Šeruga",
    "linkEn": "/en/employees/andrej-seruga"
  },
  {
    "descEn": "\nIgor Škraba is a lecturer at the Faculty of Computer and Infomrmation Science, where he teaches the following courses: Computer Architecture and Organization Primer 1 and 2, Input Output Systems and Digital Signal Processing. He is a member of the Laboratory for Architecture and Signal Processing.\n",
    "linkSl": "/sl/o-fakulteti/osebje/igor-skraba",
    "descSl": "\nIgor Škraba je predavatelj za računalništvo in informatiko in član Laboratorija za arhitekturo in procesiranje signalov na Fakulteti za računalništvo in informatiko.\n",
    "name": "Igor Škraba",
    "linkEn": "/en/employees/igor-skraba"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/tadej-skvorc",
    "descSl": null,
    "name": "Tadej Škvorc",
    "linkEn": "/en/employees/tadej-skvorc"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/ales-spetic",
    "descSl": null,
    "name": "Aleš Špetič",
    "linkEn": "/en/employees/ales-spetic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/branko-ster",
    "descSl": null,
    "name": "Branko Šter",
    "linkEn": "/en/employees/branko-ster"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/marina-stros-bracko",
    "descSl": null,
    "name": "Marina Štros-Bračko",
    "linkEn": "/en/employees/marina-stros-bracko"
  },
  {
    "descEn": "\nMy research and professional work is in the field of probability, statistics, machine learning, and applications of these methods to interesting practical problems that require such data analysis and modelling. I'm especially interested in Markov and other stochastic processes, Monte Carlo methods, Bayesian statistics, and the use of quantitative methods in sports (player evaluation, simulation, statistical analysis, forecasting).\n\r\nStudents who share similar interests are always welcome.\n",
    "linkSl": "/sl/o-fakulteti/osebje/erik-strumbelj",
    "descSl": "\nRaziskovalno in strokovno delujem na področju verjetnosti, statistike in strojnega učenja ter aplikacij teh metod pri reševanju zanimivih praktičnih problemov, ki zahtevajo tovrstno analizo podatkov in modeliranje. Še posebej me zanimajo markovski in drugi stohastični procesi, metode Monte Carlo, Bayesova statistika in uporaba kvantitativnih metod v športu (ocenjevanje igralcev, simulacija, statistična analiza, napovedovanje).\n\r\nŠtudentje, ki jih te teme zanimajo, so vedno dobrodošli.\nIzobrazba\n\n2007-2011 - Doktorski študij (FRI).\n2002-2007 - Dodiplomski študij, univ. dipl. inž. rač. in inf. (FRI).\n\n",
    "name": "Erik Štrumbelj",
    "linkEn": "/en/employees/erik-strumbelj"
  },
  {
    "descEn": "\nLovro Šubelj is assistant professor at University of Ljubljana, Faculty of Computer and Information Science.\nHis main research interests include complex network analysis and link analysis.\n",
    "linkSl": "/sl/o-fakulteti/osebje/lovro-subelj",
    "descSl": "\nLovro Šubelj je docent na Univerzi v Ljubljani, Fakulteti za Računalništvo in Informatiko.\nRaziskovalno se ukvarja predvsem z analizo kompleksnih omrežij in analizo povezav.\n",
    "name": "Lovro Šubelj",
    "linkEn": "/en/employees/lovro-subelj"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/domen-tabernik",
    "descSl": null,
    "name": "Domen Tabernik",
    "linkEn": "/en/employees/domen-tabernik"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/vesna-tanko",
    "descSl": null,
    "name": "Vesna Tanko",
    "linkEn": "/en/employees/vesna-tanko"
  },
  {
    "descEn": "\nI perform research in machine learning, focusing on the use of background knowledge for building prediction models. In collaboration with partners, such as a group at Baylor College of Medicine that studies a social amoeba Dictyostelium discoideum, we analyse gene expression data. I help develop Orange, a data mining toolkit, and its Bioinformatics add-on. I like Python, nature and to move.\nI am a teaching assistant for Programming 1, Bussiness inteligence and Introduction to bioinformatics in academic year 2012/13.\nMy desk is in R3.22.\n",
    "linkSl": "/sl/o-fakulteti/osebje/marko-toplak",
    "descSl": "\nRaziskujem uporabo predznanja pri gradnji napovednih modelov, natančneje uporabo predznanja o povezanih skupinah značilk. Ukvarjam se z analizo podatkov o genskih izrazih naših partnerjev, kot je Baylor College of Medicine, ki raziskuje amebo Dictyostelium discoideum. Sodelujem pri razvoju programskega paketa za strojno učenje Orange in njegovega dodatka Orange Bioinformatics, ki razširi Orange z orodji za analizo podatkov o genskih izrazih. Rad imam Python, naravo ter gibanje.\nV študijskem letu 2012/13 sem asistent pri predmetih Programiranje 1, Poslovna inteligenca in Uvod v bioinformatiko.\nNajdete me v severnem delu tretjega nadstropja v sobi R3.22.\n",
    "name": "Marko Toplak",
    "linkEn": "/en/employees/marko-toplak"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/barbara-torkar",
    "descSl": null,
    "name": "Barbara Torkar",
    "linkEn": "/en/employees/barbara-torkar"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/denis-trcek",
    "descSl": null,
    "name": "Denis Trček",
    "linkEn": "/en/employees/denis-trcek"
  },
  {
    "descEn": "\nDr. Mira Trebar is an Assistant Professor and the head of the Laboratory for Computer Architecture at the Faculty of Computer and Information Science, University of Ljubljana. Her research activities were aimed at computer systems and soft computing methods (neural networks and support vector machine) in different kind of classification and prediction problems. Since 2009, she is a member of research program Pervasive computing which covers new computing paradigms and strongly linked networks with diverse computing devices.\nBy discovering the possibilities and emerge importance of radiofrequency identification in computer science applications, she started to encourage students with mentoring their bachelor thesis by using the technology in smart home applications and other fields. In 2008 she started the collaboration with a group at the University of Wolverhampton, UK and became a partner in an European project F2F – RFID from Farm to Fork which started in 2010. The main interest and the work done by now includes a traceability in a supply chain management system by using RFID technology to improve business processes of SMEs and build a database of the events in the supply chain.\nActivities and Events\n\n\nResearch program: Pervasive computing \nEU project: RFID from Farm to Fork, Food traceability - Fish pilot (Slovenia)\n\n\n",
    "linkSl": "/sl/o-fakulteti/osebje/mira-trebar",
    "descSl": "\nMira Trebar je docent za področje računalništvo in informatika.\n",
    "name": "Mira Trebar",
    "linkEn": "/en/employees/mira-trebar"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/jure-tuta",
    "descSl": null,
    "name": "Jure Tuta",
    "linkEn": "/en/employees/jure-tuta"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/matej-ulcar",
    "descSl": null,
    "name": "Matej Ulčar",
    "linkEn": "/en/employees/matej-ulcar"
  },
  {
    "descEn": "\nDamjan Vavpotič is an associate professor in the Faculty of Computer and Information Science at the University of Ljubljana. His primary research interests include software development methodologies, approaches to SW development methodology evaluation, and agile methodologies.\n",
    "linkSl": "/sl/o-fakulteti/osebje/damjan-vavpotic",
    "descSl": "\nDamjan Vavpotič je izredni profesor na Fakulteti za računalništvo in informatiko Univerze v Ljubljani in predstojnik Laboratorija za informatiko. Na raziskovalnem področju se ukvarja z metodologijami razvoja informacijskih sistemov in programske opreme. V okviru tega še zlasti z agilnimi pristopi, objektnim razvojem ter pristopi k vpeljevanju in evalvaciji metodologij v organizacijah. Raziskovalno se ukvarja tudi z evalvacijo pedagoških procesov. V okviru svoje strokovne dejavnosti je do danes vodil in sodeloval pri vrsti projektov, ki so med drugim obsegali: pripravo razvojnih procesov, vpeljevanje in evalvacijo metodologij razvoja informacijskih sistemov v organizacije, pripravo strateških načrtov informatike, analizo in načrtovanje informacijskih sistemov in relacijskih podatkovnih baz ter implementacijo in testiranje informacijskih sistemov.\n",
    "name": "Damjan Vavpotič",
    "linkEn": "/en/employees/damjan-vavpotic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/luka-vavtar",
    "descSl": null,
    "name": "Luka Vavtar",
    "linkEn": "/en/employees/luka-vavtar"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/zdenka-velikonja",
    "descSl": null,
    "name": "Zdenka Velikonja",
    "linkEn": "/en/employees/zdenka-velikonja"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/dejan-veluscek",
    "descSl": null,
    "name": "Dejan Velušček",
    "linkEn": "/en/employees/dejan-veluscek"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/dejan-vercic",
    "descSl": null,
    "name": "Dejan Verčič",
    "linkEn": "/en/employees/dejan-vercic"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/janos-vidali",
    "descSl": null,
    "name": "Janoš Vidali",
    "linkEn": "/en/employees/janos-vidali"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/tone-vidmar",
    "descSl": null,
    "name": "Tone Vidmar",
    "linkEn": "/en/employees/tone-vidmar"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/bostjan-vilfan",
    "descSl": null,
    "name": "Boštjan Vilfan",
    "linkEn": "/en/employees/bostjan-vilfan"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/mojca-vilfan",
    "descSl": null,
    "name": "Mojca  Vilfan",
    "linkEn": "/en/employees/mojca-vilfan"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/zvonko-virant",
    "descSl": null,
    "name": "Zvonko Virant",
    "linkEn": "/en/employees/zvonko-virant"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/ziga-virk",
    "descSl": null,
    "name": "Žiga Virk",
    "linkEn": "/en/employees/ziga-virk"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/matej-vitek",
    "descSl": null,
    "name": "Matej Vitek",
    "linkEn": "/en/employees/matej-vitek"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/petar-vracar",
    "descSl": "\nPetar Vračar\n",
    "name": "Petar Vračar",
    "linkEn": "/en/employees/petar-vracar"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/simon-vrhovec",
    "descSl": null,
    "name": "Simon Vrhovec",
    "linkEn": "/en/employees/simon-vrhovec"
  },
  {
    "descEn": "\n\nAsistant for mathematics\n\n",
    "linkSl": "/sl/o-fakulteti/osebje/martin-vuk",
    "descSl": "\nAsistent za matematiko\n",
    "name": "Martin Vuk",
    "linkEn": "/en/employees/martin-vuk"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/ales-watzak",
    "descSl": null,
    "name": "Aleš Watzak",
    "linkEn": "/en/employees/ales-watzak"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/gregor-weiss",
    "descSl": null,
    "name": "Gregor Weiss",
    "linkEn": "/en/employees/gregor-weiss"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/aljaz-zalar",
    "descSl": null,
    "name": "Aljaž Zalar",
    "linkEn": "/en/employees/aljaz-zalar"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/nikolaj-zimic",
    "descSl": null,
    "name": "Nikolaj Zimic",
    "linkEn": "/en/employees/nikolaj-zimic"
  },
  {
    "descEn": "\nI work as senior lecturer at the Faculty of Computer and Information Science. My primary research interests include software methodologies, method engineering, relational databases, NoSQL databases and web technologies.\n",
    "linkSl": "/sl/o-fakulteti/osebje/aljaz-zrnec",
    "descSl": "\nNa Fakulteti za računalništvo in informatiko poučujem predmet Podatkovne baze 2, ter izvajam vaje pri predmetih Podatkovne baze 2 in Osnove podatkovnih baz.\nNa raziskovalnem področju se ukvarjam z metodologijami razvoja programske opreme, prilagajanjem procesa razvoja IS, računalništvom v oblaku, NoSQL podatkovnimi bazami in spletnimi tehnologijami.\nIzobrazba\n\nUniverzitetni diplomirani inženir računalništva in informatike (Univerza v Ljubljani)\nMagister računalništva (Univerza v Ljubljani)\nDoktor računalniških znanosti (Univerza v Ljubljani)\n\n",
    "name": "Aljaž Zrnec",
    "linkEn": "/en/employees/aljaz-zrnec"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/helena-marija-zupan",
    "descSl": null,
    "name": "Helena Marija Zupan",
    "linkEn": "/en/employees/helena-marija-zupan"
  },
  {
    "descEn": "\nWouldn't it be great if we could have data mining tools that could consider everything there is and build models with which we could have an interesting, even enlightening discussion? Just like talking to a friend or a colleague? I can't say that we are anywhere close. But my lab has in the past years developed some exciting algorithms that can help us digest large volume of data sets, visualize them in a number of fancy ways, and even fuse them together into a single predictive model. For large-scale data fusion, we have lately tested some predictions in the wet labs and achieved some quite astonishing accuracy.\nI also enjoy building things. My Bioinformatics Lab develops Orange, a data mining suite with a cool visual programming interface. We are also authors of dictyExpress, a simple gene expression analytics that has found much use within Dictyostelium research community. Our first popular web application was GenePath: it is over ten years old but still runs! And we are teaming up with a spin-off Genialis to build data mining pipelines with simple web interfaces.\n",
    "linkSl": "/sl/o-fakulteti/osebje/blaz-zupan",
    "descSl": "\nPredavam in raziskujem na področju odkrivanja znanj iz podatkov. V raziskovalnih projektih mojega laboratorija te tehnike v uporabljamo predvsem na področjih biomedicine. Zadnje čase me predvsem veseli gradnja intuitivnih programskih sistemov za podatkovno analitiko in tehnike zlivanja podatkov. Mnogo teh testirajo in uporabljajo naši partnerji doma in v tujini. Eden od teh je Baylor College of Medicine, kjer sem gostujoči profesor.\nUživam v načrtovanju aplikacij in programiranju. Sem soavtor programa za podatkovno analitiko Orange, programa za interaktivno pregledovanje izraznih profilov genov dictyExpress, spletnega programa za odkrivanje genskih mrež GenePath (star več kot 10 let a začuda še vedno dela), in knjižnice za matrično faktorizacijo Nimfa. Pri razvoju programov za bioinformatično analizo podatkov sodelujemo tudi z laboratorijskim spin-offom Genialis.\nNa FRI me najdete v vrhnjem nadstropju, desno od stopnišča, skoraj pri balkonu, v pisarni R3.17 ali laboratoriju R3.20/22.\n",
    "name": "Blaž Zupan",
    "linkEn": "/en/employees/blaz-zupan"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/andrej-zupanc-0",
    "descSl": null,
    "name": "Andrej Zupanc",
    "linkEn": "/en/employees/andrej-zupanc-0"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/jure-zabkar",
    "descSl": null,
    "name": "Jure Žabkar",
    "linkEn": "/en/employees/jure-zabkar"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/lan-zagar-0",
    "descSl": null,
    "name": "Lan Žagar",
    "linkEn": "/en/employees/lan-zagar-0"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/manca-zerovnik-mekuc",
    "descSl": null,
    "name": "Manca Žerovnik Mekuč",
    "linkEn": "/en/employees/manca-zerovnik-mekuc"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/janez-zibert",
    "descSl": null,
    "name": "Janez Žibert",
    "linkEn": "/en/employees/janez-zibert"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/rok-zitko",
    "descSl": null,
    "name": "Rok Žitko",
    "linkEn": "/en/employees/rok-zitko"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/marinka-zitnik",
    "descSl": null,
    "name": "Marinka Žitnik",
    "linkEn": "/en/employees/marinka-zitnik"
  },
  {
    "descEn": "\nSlavko's main research interests are information retrieval and information extraction. Specifically, he is trying to enrich the extracted data from text using parallel and iterative combination of entity extraction, relationship extraction and coreference resolution techniques. Furthermore, his research also focuses on data merging, redundancy elimination and ontologies.\nMore research-related information can be found on his wiki: http://zitnik.si/research.\nHis personal blog: http://zitnik.si.\n",
    "linkSl": "/sl/o-fakulteti/osebje/slavko-zitnik",
    "descSl": "\nSlavko's main research interests are information retrieval and information extraction. Specifically, he is trying to enrich the extracted data from text using parallel and iterative combination of entity extraction, relationship extraction and coreference resolution techniques. Furthermore, his research also focuses on data merging, redundancy elimination and ontologies.\nMore research-related information can be found on his wiki: http://zitnik.si/research.\nHis personal blog: http://zitnik.si.\n",
    "name": "Slavko Žitnik",
    "linkEn": "/en/employees/slavko-zitnik"
  },
  {
    "descEn": null,
    "linkSl": "/sl/o-fakulteti/osebje/urska-znidaric",
    "descSl": null,
    "name": "Urška Žnidarič",
    "linkEn": "/en/employees/urska-znidaric"
  }
]