[{"id": 371, "si": {"title": "Napredne senzorske tehnologije in modeliranje za sledljivost žveplovih spojin v hladni verigi", "description": "<p>Rešitve na področju sledljivosti in hladne verige še vedno ostajajo resen izziv za raziskovalce in podjetja v smislu kakovosti in varnosti hrane za potrošnike po vsem svetu. Sposobnost prepoznavanja preteklih ali trenutne lokacije, kot tudi zgodovina in pogoji ravnanja so pomembni za lociranje pokvarjene ali nevarne hrane in izdelkov zato, da jih je mogoče hitro in enostavno odstraniti s polic. To zmanjšuje negativne gospodarske posledice in lahko potrdi prisotnost ali odsotnost pomembnih lastnosti živil za potrošnike na prodajnem mestu, še zlasti za pokvarljiva živila. Številne brezžične identifikacijske in senzorske naprave so neposredno povezane preko interneta in omogočajo zbiranje podatkov v procesih sledljivosti in hladne verige. Običajno se velika količina podatkov pošilja v posebna podatkovna skladišča in se kasneje analizira ter uporablja v sistemih za upravljanje. Tehnike modificirane atmosfere in tehnologije konzerviranja so bile skupaj s hladno verigo odobrene kot ključna orodja za preprečevanje kvarjenja in za podaljševanje dobe uporabnosti za sadje in meso med skladiščenjem in prevozom. Obstaja veliko žveplovih spojin v logistični hladni verigi živil. Uporaba žveplovega dioksida (SO2) je trenutno v številnih državah splošno sprejeta kot izbira za podaljševanje roka trajanja namiznega grozdja, medtem ko je vodikov sulfid (H2S) znak kvara mesa, predvsem piščančjega. Žveplove spojine lahko vplivajo na večji kvar živil, ko so koncentracije nižje ali višje od standardne oziroma dovoljene ravni teh spojin. Po drugi strani pa lahko večje koncentracije povzročijo poškodbe v hrani, sulfitni ostanki pa lahko predstavljajo tveganje za zdravje posameznika. Iz omenjenih razlogov je nujno in zelo pomembno vključiti napredne mikro in nano tehnologije zaznavanja in modeliranja pri spremljanju žveplovih spojin plinov v realnem času in pri natančnem in pravilnem napovedovanju dobe uporabnosti v sledljivosti hladne verige živil. Cilji sodelovanja so: 1) raziskave novih tehnologij za izboljšanje zaznavanja in natančnosti podatkov, 2) modeliranje napovedovanja življenjske dobe in upravljanja, 3) vrednotenje predlaganih metod z razvojem prototipnega sistema in 4) predstavitev - diseminacija skupnih rezultatov (seminarji / predstavitve) strokovnjakom in drugim zainteresiranim skupnostim med obiski v času izmenjave. Študije o najboljših praksah in obstoječih rešitvah, senzorskih tehnologijah in metodah modeliranja bodo izvedene v sistemu sledljivosti in hladne verige. Pomanjkljivosti tradicionalnih in razpoložljivih pristopov bodo določene za izvedbo izboljšanih ali novih senzorskih tehnologij in metod modeliranja podatkov. Sodelovanje temelji na komplementarnosti obeh skupin in je razdeljeno na tri glavna področja: 1. Razvoj pametnih senzorskih tehnologij V hladni verigi se integrirani senzorji, kot so temperatura, relativna vlažnost in plin za konzerviranje, uporabljajo za izvedbo spremljanja ohlajenega okolja v realnem času za učinkovito preprečevanje slabšanja živilskih izdelkov v daljšem časovnem obdobju, zagotavljanje varnosti hrane in preprečevanje njihovega zmanjšanja vrednosti med sledljivostjo v hladni verigi. Razviti bodo brezžični pametni senzorji za izvajanje meritev žveplovega dioksida (SO2) in vodikovega sulfida (H2S), ki temeljijo na senzorskih mikro in nano tehnologijah za izboljšanje natančnosti. Pametne naprave za komunikacijo z brezžičnimi senzorji bodo tudi izdelane in jih bo mogoče uporabljati kot pametno embalažo za spremljanje kakovosti in varnosti pri sledljivosti hrane v hladni verigi v preskrbi s hrano. 2. Študija modela za napovedovanje dobe uporabnosti in upravljanje Doba uporabnosti, predvsem njen preostanek je zelo pomemben za kakovost hrane v sledljivosti hladne verige. Obstaja veliko tehnologij konzerviranja v hladni verigi, kot je plin žveplovega dioksida (SO2) za ohranjanje živil, predvsem sadja in tudi vakuumsko pakiranje za meso, ki podaljšuje dobo uporabnosti živil. V projektu bo izvedena mikrobiološka analiza živilskih proizvodov, za študijo dinamične in kinetične sledljivosti hladne verige, izgradnjo in optimizacijo modela napovedovanja življenjske dobe, ki temelji na senzorskih podatkih v realnem času. Uporabljeni bodo pametni mikro in nano senzorji za spremljanje, tako da so razporejeni v embalaži hrane za zagotavljanje varnosti in kakovosti hrane. 3. Snovanje in razvoj platforme sledljivosti Projekt bo vključeval spremljanje v realnem času in bo zasnovan na tehnologiji pametnih senzorjev in bo povezoval omrežja za izvedbo modeliranja v sledenju kakovosti in varnosti hrane v hladni verigi. Vsaj dve vrsti živil v hladni verigi, kot sta sadje in meso, bosta izbrani kot študije za oceno učinkovitosti razvitih pametnih senzorjev, naprav in platforme sledljivosti, da bi jih v nadaljevanju izboljšali. Predvideni prispevki partnerjev: </p>\r\n<p>Slovenija: </p>\r\n<p> Raziskave in izvedba storitev, ki so povezane s tehnologijo brezžičnih senzorjev v izvedbi sledljivosti hladne verige. </p>\r\n<p> Modeliranje dobe uporabnosti z metodami podatkovnega rudarjenja. Temperatura, vlažnost in druge senzorske meritve bodo samodejno analizirane, vnaprej obdelane in uporabljene za pridobivanje skritih vzorcev in potrebnih informacij. </p>\r\n<p> Senzorična analiza živil bo uporabljena za določanje specifikacij in parametrov kakovosti hrane za vrednotenje rezultatov. </p>\r\n<p>Kitajska: </p>\r\n<p> Raziskave in razvoj brezžičnih pametnih senzorjev žveplovega dioksida (SO2) in vodikovega sulfida (H2S), ki temeljita na mikro in nano tehnologijah. </p>\r\n<p> Testiranje in izboljšanje stabilnosti in natančnosti brezžičnih (pametnih) senzorjev v laboratoriju in dejanski sledljivosti sadja in mesa v hladni verigi. </p>\r\n<p> Mikrobiološka študija in analiza živil, nanotehnologij v pametni embalaži za optimizacijo dobe uporabnosti pri sledljivosti živil. </p>\r\n<p> Oblikovanje in integracija omrežja za izvedbo modela dobe uporabnosti za izboljšanje preglednosti in točnosti na področju kakovosti in varnosti hrane. </p>\r\n", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Javna agencija za raziskovalno dejavnost RS", "project_id": null, "project_link": null, "start_date": "2017-01-01 00:00:00", "end_date": "2018-12-31 00:00:00", "persons": [{"id": "630731", "role": "Sodelavec na projektu", "ime": "Aleks", "priimek": "Huč"}, {"id": "630880", "role": "Sodelavec na projektu", "ime": "Denis", "priimek": "Trček"}, {"id": "630276", "role": "Vodja projekta", "ime": "Mira", "priimek": "Trebar"}], "ref_project_type": 2, "logo": null, "menu_picture": null, "project_picture": null}, "en": {"title": "Advanced sensing technologies and modelling for sulfur compounds in food cold chain traceability", "description": "<p>Traceability and cold chain solutions still remain a serious challenge for researchers and companies in terms of food quality and consumers safety all over the world. The ability to identify the past or current location of an item, as well as to know an item&#39;s history and handling conditions are important for locating defective or unsafe food and food products to remove them quickly and easily from shelves. This reduces the negative economic impact, and can validate the presence or absence of attributes important to consumers at the point of sale, especially for perishable food products. Many wireless identification and sensing devices are directly accessible over the internet and support collection of data during the traceability and cold chain processes. Usually, the large amount of data is sent to special data warehouses to be later analysed and used in management systems. The modified atmosphere techniques and preservation technologies coupling with cold chain have been approved themselves as key tools to prevent spoilage and prolong shelf life for the fruit and meat during storage and transportation. There are many sulfur compounds in the cold chain logistics. The sulfur dioxide gas (SO2) is currently broadly adopted as the treatment of choice in many countries for prolonging shelf life of fruit such as the table grapes, and the hydrogen sulphide (H2S) is the spoilage gas for the meat such as the chicken. However, the sulfur compounds could make the food to be more perishable once the concentrations of which are lower or higher than the standard necessary/allowed level. On the other hand, the higher concentration may induce injuries in food, and sulfite residues pose a health risk for some individuals. Therefore, it is necessary and very important to integrate the advanced micro and nano sensing technologies and modelling to monitor the real time sulfur compounds gas and predict the shelf life of food precisely and accurately in food cold chain traceability. The aims of the collaboration are oriented towards: 1) research on novel technologies to improve the sensing and the precision data, 2) modelling for shelf life prediction and management, 3) the evaluation the proposed methods by developing the prototype system and 4) dissemination of collaborative results (seminars/presentations) to experts and other communities during exchange visits. The studies of best practices, exiting solutions, sensing technology and modelling methods in food cold chain traceability system will be performed. The weaknesses of traditional and available approaches will be identified to implement improved or novel sensing technologies and data modelling methods. The collaboration is based on complementarity of two groups and is divided in three main areas: 1. Development of the smart sensing technologies In cold chain, the integrated sensors, such as the temperature, relative humidity and preservation gas, could be applied to monitor the refrigerated environment in real time to prevent food products deterioration over time effectively, protecting food safety and avoiding their value decrease during the cold chain traceability. The wireless smart sensors of sulfur dioxide gas (SO2) and hydrogen sulphide (H2S) based on the micro and nano sensor technologies would be developed to improve the sensors accuracy. The smart devices for the communication with the wireless sensors also would be designed to apply them in smart packaging for the quality monitoring and safety in food cold chain traceability. 2. Study of the shelf life prediction model and management in food cold chain The shelf life is very important to indicate the food quality in cold chain traceability. There are many preservation technologies coupled in the cold chain, such as the preservation gas sulfur dioxide (SO2) for fruits, and also the vacuum package for meat, to prolong the shelf life of the food. The project would analyse the microbiology of the food products to study the dynamic kinetic in cold chain traceability, build and optimize the shelf life prediction model based on the real time sensor data monitored by the smart micro and nano sensors which are deployed in food package to ensure the safety and quality of the food. 3. Design and development of the traceability platform The project would perform a real time monitoring based on smart sensing technology and integrate the grid for shelf-life prediction modelling implementation to trace the food quality and safety of food in cold chain. At least two kinds of the food cold chain, fruits and meat, could be chosen as the case studies to evaluate the performance of developed smart sensors, devices and traceability platform and improve them in further. </p>\r\n<p>The Slovenian partner contributions are: </p>\r\n<p> the research and implementation of services related to wireless sensing technologies implemented in the cold chain traceability, </p>\r\n<p> shelf life prediction modelling based on data mining. Temperature, humidity and other sensor measurements will be automatically analysed, pre-processed and used for the extraction of hidden patterns and information and </p>\r\n<p> sensory analysis of food to determine specifications and parameters of the food quality for the evaluation of results. </p>\r\n<p>The main contributions of Chinese partner are: </p>\r\n<p> the research and development of the wireless smart sensors of sulfur dioxide gas (SO2) and hydrogen sulphide (H2S) based on the micro and nano sensor technologies, </p>\r\n<p> testing and improving the stability and accurate of wireless (smart) sensors in laboratory and actual fruits or meat cold chain traceability, </p>\r\n<p> study of the microbiological analysis of food products, nanotechnologies in smart packaging-optimization of shelf life in food cold chain traceability and </p>\r\n<p> designing and integrating the grid for shelf-life prediction model implementation to improve the transparency and accuracy of the food quality and safety in cold chain traceability. </p>\r\n", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Javna agencija za raziskovalno dejavnost RS", "project_id": null, "project_link": null, "start_date": "2017-01-01 00:00:00", "end_date": "2018-12-31 00:00:00", "persons": [{"id": "630731", "role": "Sodelavec na projektu", "ime": "Aleks", "priimek": "Huč"}, {"id": "630880", "role": "Sodelavec na projektu", "ime": "Denis", "priimek": "Trček"}, {"id": "630276", "role": "Vodja projekta", "ime": "Mira", "priimek": "Trebar"}], "ref_project_type": 2, "logo": null, "menu_picture": null, "project_picture": null}}]