[{"id": 560, "si": {"title": "Iskanje nekonsistentnosti v kompleksnih slikovnih podatkih z globokim učenjem", "description": "<p>V današnjem tehnološko razvitemu svetu količina prosto dostopnih podatkov nenehoma narašča, njihova obdelava pa predstavlja čedalje večji izziv in zahteva avtomatizirane postopke. Računalniški vid in strojno učenje, še posebej globoko učenje, ponujajo odgovore na te zahteve, vendar večina predlaganih pristopov potrebuje označene učne podatke, kar posredno zahteva znatno količino dela za njihovo ročno označevanje, ki je naporno in včasih podvrženo napakam ali celo nemogoče. V predlaganem projektu bomo obravnavali izpostavljeno problematiko na področju odkrivanja anomalij na slikah z uporabo metod računalniškega vida. Naš namen je preseči tradicionalno nadzorovano učenje, kjer je potrebno označiti vse anomalije v učnih podatkih. Cilj predlaganega projekta je razviti nove metode globokega učenja za modeliranje kompleksne konsistentnosti in zaznavanje nekonsistentnosti v vizualnih podatkih z uporabo učnih slik označenih z različnimi nivoji natančnosti. Razvite metode nameravamo testirali na treh povezanih, vendar različnih, nalogah; to so vizualni pregled površin, oddaljeno zaznavanje in vizualni nadzor.</p>\r\n\r\n<p><b>Veda</b></p>\r\n<p>Tehnika</p>\r\n\r\n<p><b>Letni obseg</b></p>\r\n<p>1,72 FTE</p>\r\n\r\n<p><b><u>Sodelujoče raziskovalne organizacije &lt;https://www.sicris.si/public/jqm/prj.aspx?lang=slv&amp;opdescr=search&amp;opt=2&amp;subopt=403&amp;code1=cmn&amp;code2=auto&amp;psize=10&amp;hits=1&amp;page=1&amp;count=&amp;id=17299&amp;slng=&amp;search_term=J2-9433&amp;order_by=&gt;</u></b></p>\r\n\r\n\r\n<p><b><u>Sestava projektne skupine &lt;https://www.sicris.si/public/jqm/prj.aspx?lang=slv&amp;opdescr=search&amp;opt=2&amp;subopt=402&amp;code1=cmn&amp;code2=auto&amp;psize=10&amp;hits=1&amp;page=1&amp;count=&amp;search_term=J2-9433&amp;id=17299&amp;slng=&amp;order_by=&gt;</u></b> </p>\r\n\r\n\r\n<p><b>Faze projekta</b></p>\r\n\r\n<p>Delovni paketi: </p>\r\n<p>Program dela bo razdeljen v sedem delovnih paketov (DP). Raziskave bodo potekale v okviru prvih petih paketov, ki bodo naslovili naslednje cilje projekta:</p>\r\n<p>&#183;Razvoj (šibko) nadzorovanih pristopov za detekcijo anomalij (DP1)Razvoj novega delno in samo-nadzorovanega učenja konsistence podatkov za detekcijo anomalij (DP2)</p>\r\n<p>&#183;Razvoj globokih generativnih kompozicionalnih modelov za detekcijo anomalij (DP3).</p>\r\n<p>&#183;Vodenje učnega procesa z upoštevanjem kognitivne relevance naučenih modelov (DP4).</p>\r\n<p>&#183;Prilagajanje razvitega učenja konsistence podatkov za detekcijo anomalij na tri problemske domene: (i) vizualni pregled, (ii) oddaljeno zaznavanje, (iii) video nadzor (DP5).</p>\r\n<p>&#183;Preostala paketa dela se nanašata na razširjanje rezultatov (DP6) in vodenje projekta (DP7).</p>\r\n<p> </p>\r\n<p>Faze projekta:</p>\r\n<p>&#183;Leto 1: Aktivnosti v okviru delovnih paketov WP1, WP2, WP4, WP5, WP6, WP7</p>\r\n<p>&#183;Leto 2: Aktivnosti v okviru delovnih paketov WP2, WP3, WP4, WP5, WP6, WP7</p>\r\n<p>&#183;Leto 3: Aktivnosti v okviru delovnih paketov WP3, WP4, WP5, WP6, WP7</p>\r\n\r\n<p>Mejniki:</p>\r\n<p>&#183;Po Letu 1: Šibko nadzorovano odkrivanje anomalij</p>\r\n<p>&#183;Po Letu 2: Delno nadzorovano odkrivanje anomalij</p>\r\n<p>&#183;Po Letu 3: Nenadzorovano odkrivanje anomalij</p>\r\n\r\n<p><b>Bibliografske reference projekta</b></p>\r\n\r\n<p><b>Financerji</b></p>\r\n<p>Javna agencija za raziskovalno dejavnost Republike Slovenije</p>\r\n", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Javna agencija za raziskovalno dejavnost RS", "project_id": null, "project_link": null, "start_date": "2018-07-01 00:00:00", "end_date": "2021-06-30 00:00:00", "persons": [{"id": "630871", "role": "Sodelavec na projektu", "ime": "Matej", "priimek": "Kristan"}, {"id": "630252", "role": "Sodelavec na projektu", "ime": "Aleš", "priimek": "Leonardis"}, {"id": "630630", "role": "Vodja projekta", "ime": "Danijel", "priimek": "Skočaj"}, {"id": "630965", "role": "Sodelavec na projektu", "ime": "Domen", "priimek": "Tabernik"}], "ref_project_type": 5, "logo": null, "menu_picture": null, "project_picture": null}, "en": {"title": "Detection of inconsistencies in complex visual data using deep learning", "description": "<p>Obtaining a large amount of visual data has become a trivial task in todays technological world.  However, making use of this enormous amount of data poses a huge challenge. Computer vision and machine learning, in particular deep learning, offer answers to these requirements, however most of the approaches proposed rely on labelled training data; they therefore still require a significant human effort for labelling the required amounts of data, which is very costly, tedious and sometimes error-prone or even impossible. In this project we will address this issue for a particular computer vision task of anomaly detection in images. Our aim is to go beyond the traditional supervised learning, where all anomalies on all training images have to be adequately labelled. The objective of the proposed project is to develop novel deep learning methods for modelling complex consistency and detecting inconsistencies in visual data using training images annotated with different levels of accuracy. We will validate the developed methods in three related but different problem domains; visual inspection, remote sensing, and visual surveillance.</p>\r\n\r\n<p><b>Research activity</b></p>\r\n<p>Engineering sciences and technologies</p>\r\n\r\n<p><b>Range per year</b></p>\r\n<p>1,72 FTE</p>\r\n\r\n<p><b><u>Research organisations &lt;https://www.sicris.si/public/jqm/prj.aspx?lang=eng&amp;opdescr=search&amp;opt=2&amp;subopt=403&amp;code1=cmn&amp;code2=auto&amp;psize=10&amp;hits=1&amp;page=1&amp;count=&amp;search_term=J2-9433&amp;id=17299&amp;slng=&amp;order_by=&gt;</u></b></p>\r\n\r\n\r\n<p><b><u>Researchers &lt;https://www.sicris.si/public/jqm/prj.aspx?lang=eng&amp;opdescr=search&amp;opt=2&amp;subopt=402&amp;code1=cmn&amp;code2=auto&amp;psize=10&amp;hits=1&amp;page=1&amp;count=&amp;search_term=J2-9433&amp;id=17299&amp;slng=&amp;order_by=&gt;</u></b></p>\r\n\r\n<p><b>Project phases and their realization</b></p>\r\n<p>Workpackages: </p>\r\n<p>The work programme will be divided into seven work packages. Research will be conducted in the first five work packages that will address the following objectives of the project:</p>\r\n<p>&#183;Development of (weakly) supervised approaches for anomaly detection (WP1).</p>\r\n<p>&#183;Development of novel semi- and self-supervised learning of data consistency for anomaly detection (WP2).</p>\r\n<p>&#183;Development of deep generative compositional models for anomaly detection (WP3).</p>\r\n<p>&#183;Guiding the learning process by considering the cognitive relevance of the learned models (WP4).</p>\r\n<p>&#183;Adaptation of developed data consistency learning for anomaly detection to three problem domains: (i) visual inspection, (ii) remote sensing, and (iii) visual surveillance (WP5).</p>\r\n<p>&#183;The remaining two work packages relate to the dissemination of the results (WP6) and project management (WP7).</p>\r\n\r\n<p>Project phases:</p>\r\n<p>&#183;Year 1: Activities on work packages WP1, WP2, WP4, WP5, WP6, WP7</p>\r\n<p>&#183;Year 2: Activities on work packages WP2, WP3, WP4, WP5, WP6, WP7</p>\r\n<p>&#183;Year 3: Activities on work packages WP3, WP4, WP5, WP6, WP7</p>\r\n\r\n<p>Milestones:</p>\r\n<p>&#183;After Year 1: Weakly supervised anomaly detection</p>\r\n<p>&#183;After Year 2: Semi-supervised anomaly detection </p>\r\n<p>&#183;After Year 3: Unsupervised anomaly detection</p>\r\n\r\n<p><b>Project bibliographic references</b></p>\r\n\r\n<p><b>Financed by</b></p>\r\n<p>Slovenian Research Agency</p>\r\n\r\n", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Javna agencija za raziskovalno dejavnost RS", "project_id": null, "project_link": null, "start_date": "2018-07-01 00:00:00", "end_date": "2021-06-30 00:00:00", "persons": [{"id": "630871", "role": "Sodelavec na projektu", "ime": "Matej", "priimek": "Kristan"}, {"id": "630252", "role": "Sodelavec na projektu", "ime": "Aleš", "priimek": "Leonardis"}, {"id": "630630", "role": "Vodja projekta", "ime": "Danijel", "priimek": "Skočaj"}, {"id": "630965", "role": "Sodelavec na projektu", "ime": "Domen", "priimek": "Tabernik"}], "ref_project_type": 5, "logo": null, "menu_picture": null, "project_picture": null}}]