[{"id": 21, "si": {"title": "Vzporedni in porazdeljeni sistemi", "description": "<p>Vzporedno in porazdeljeno delovanje omogoča povečanje računalniške zmogljivosti ter združevanje in izkoriščanje obstoječih računalniških sistemov. Nadaljnji razvoj informacijskih tehnologij sloni v veliki meri na povezovanju računalnikov v mreže in skupke, ki bodo delovali na avtonomen način, prilagodljivo, zanesljivo in varno. Raziskave usmerjamo  v zasnovo in razvoj novih in učinkovitih postopkov za komuniciranje, porazdeljeno računanje in obdelave ter zajemanje in hranjenje podatkov. Raziskujemo sintezo porazdeljenih protokolov in njihovo formalno potrditev, kakor tudi nove vzporedne postopke, komunikacijske topologije in zanesljive ter varne komunikacije. V skupini sodelujejo poleg raziskovalcev s področja računalništva tudi raziskovalci s področij medicine, telekomunikacij in industrije. Preskušamo načine za učinkovito uporabo vzporednih in porazdeljenih sistemov pri računsko zahtevnih računalniških simulacijah, v elektronskem poslovanju in pri učenju na daljavo.</p>\r\n", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Javna agencija za raziskovalno dejavnost RS", "project_id": "", "project_link": "", "start_date": "2014-01-01 00:00:00", "end_date": "2019-12-31 00:00:00", "persons": [{"id": "630813", "role": "Sodelavec na projektu", "ime": "Uroš", "priimek": "Čibej"}, {"id": "630610", "role": "Sodelavec na projektu", "ime": "Tomaž", "priimek": "Dobravec"}, {"id": "630094", "role": "Sodelavec na projektu", "ime": "Dušan", "priimek": "Kodek"}, {"id": "630775", "role": "Sodelavec na projektu", "ime": "Jurij", "priimek": "Mihelič"}, {"id": "630575", "role": "Vodja projekta na FRI", "ime": "Borut", "priimek": "Robič"}, {"id": "630601", "role": "Sodelavec na projektu", "ime": "Boštjan", "priimek": "Slivnik"}], "ref_project_type": 4, "logo": null, "menu_picture": null, "project_picture": null}, "en": {"title": "Parallel and distributed systems", "description": "Further increase in computer performance and pooling of existing computing resources is possible with parallel and distributed work. Current directions in the development of information technologies lean significantly on the interconnection of computers in networks and clusters that already, and will even more in the future, incorporate the autonomous computing. Among other this means that connected computers cooperate in a dynamic, reliable and safe manner. The research is focused on the design and implementation of new and efficient methods for communication and distributed computing with data acquisition and storing. Distributed protocols are devised and tested with formal methods. Parallel algorithms, communication topologies and reliable safe communications are investigated. Beside computer scientists, researchers from medicine, telecommunications and industry are cooperating in our group. We plan to implement various applications of parallel and distributed systems in computationally demanding computer simulations, e-business and distance learning.", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Javna agencija za raziskovalno dejavnost RS", "project_id": "", "project_link": "", "start_date": "2014-01-01 00:00:00", "end_date": "2019-12-31 00:00:00", "persons": [{"id": "630813", "role": "Sodelavec na projektu", "ime": "Uroš", "priimek": "Čibej"}, {"id": "630610", "role": "Sodelavec na projektu", "ime": "Tomaž", "priimek": "Dobravec"}, {"id": "630094", "role": "Sodelavec na projektu", "ime": "Dušan", "priimek": "Kodek"}, {"id": "630775", "role": "Sodelavec na projektu", "ime": "Jurij", "priimek": "Mihelič"}, {"id": "630575", "role": "Vodja projekta na FRI", "ime": "Borut", "priimek": "Robič"}, {"id": "630601", "role": "Sodelavec na projektu", "ime": "Boštjan", "priimek": "Slivnik"}], "ref_project_type": 4, "logo": null, "menu_picture": null, "project_picture": null}}]