[{"id": 14, "si": {"title": "Sinergetika kompleksnih sistemov in procesov", "description": "<p>Razvoj novih tehnologij, sistemov in materialov s časovno spremenljivimi lastnostmi poleg obvladovanja in razumevanje posameznih izoliranih enot in fizikalnih pojavov zahteva razumevanje in obvladovanje povezanih in distribuiranih sistemov ter procesov katerih vedenje opredeljujejo predvsem vzajemne nelinearne interakcije, ki pogosto lahko vodijo do nestabilnosti in celo kaotičnosti. Zato so opis, karakterizacija in razumevanje kompleksnosti sistemov in procesov, ki izhajajo iz nelinearnih interakcij in nestacionarnosti, predmet številnih intenzivnih znanstvenih raziskav, v katere se vključujemo tudi v okviru raziskav programske skupine Sinergetika kompleksnih sistemov in procesov.</p>\r\n<p>Sinergetska obravnava temelji predvsem na empiričnem opisu. Zato se poleg opisa in karakterizacije dinamske nestabilnosti in kompleksnosti tehniških in tehnoloških procesov in sistemov ukvarjamo, in z rezultati prispevamo k razvoju znanosti, tudi na področju nelinearne analize stacionarnih in nestacionarnih časovnih vrst, metod za avtomatsko spremljanje, empiričnega in adaptivnega modeliranja ter uporabi modelov za identifikacijo, napovedovanje, optimizacijo in krmiljenje stanj kompleksnih procesov na osnovi več senzorskih podatkov.</p>\r\n<p>Z uporabo metod sinergetike, tako poleg razumevanja fizikalnih lastnosti ter razumevanja in obvladovanju kompleksnosti tehnoloških procesov, ki so posledica nelinearnih interakcij različnih procesnih spremenljivk, prispevamo k tesnejši vzajemni povezavi fizike, informatike ter tehničnih znanosti tako z vidika teoretičnih, kakor tudi uporabno naravnanih raziskav kompleksnih sistemov in procesov. Slednje je nujno potrebno za celovito obravnavo ter napredek in razvoj tehniških znanosti, kakor tudi za razvoj novih tehnologij, produktov, sistemov in procesov.</p>\r\n<p>Z raziskavami na omenjenih tematikah in z uporabo metod sinenergetike aktivno sodelujemo in skrbimo za razvoj znanosti na področju opisa ter karakterizacije dinamike in stabilnosti kompleksnih tehnoloških procesov, na področju raziskav in uporabe metod nelinearne analize časovnih vrst, raziskav in razvoja adaptivnih inteligentnih sistemov za avtomatsko modeliranje, spremljanje, nadzor, krmiljenje in optimiziranje kompleksnih tehničnih in tehnoloških sistemov in procesov. Pomembnost rezultatov za razvoj znanosti potrjujejo tudi objave rezultatov raziskav v visoko kakovostnih znanstvenih revijah kakor tudi njihova visoka odmevnost.</p>\r\n", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Javna agencija za raziskovalno dejavnost RS", "project_id": "", "project_link": "", "start_date": "2015-01-01 00:00:00", "end_date": "2019-12-31 00:00:00", "persons": [{"id": "630046", "role": "Sodelavec na projektu", "ime": "Andrej", "priimek": "Dobnikar"}, {"id": "630687", "role": "Sodelavec na projektu", "ime": "Uroš", "priimek": "Lotrič"}, {"id": "630502", "role": "Vodja projekta na FRI", "ime": "Branko", "priimek": "Šter"}], "ref_project_type": 4, "logo": null, "menu_picture": null, "project_picture": null}, "en": {"title": "Synergy of the technological systems and processes", "description": "The development of new technologies, systems and materials with time dependent properties requires, in addition to understanding and control of individual isolated units and physical phenomena, understanding and control of connected and distributed systems and processes whose behavior is characterized by mutual non-linear interactions, which often lead to instability and even chaos. Therefore description, characterization and understanding of the complexity of systems and processes, resulting from nonlinear interactions and non-stationarity, are subject to a number of intensive scientific research projects, in which also the research program of Synergetics complex systems and processes takes part. Synergetic treatment is mainly based on empirical description. Therefore, in addition to the description and characterization of dynamic instability and complexity of technical and technological processes and systems, we are involved (and with results contribute to the development of science) also in the field of non-linear analysis of stationary and non-stationary time series, methods for automatic monitoring, empirical and adaptive modeling and using models for the identification, forecasting, optimization and control of states of complex processes based on multi-sensor data. By using the methods of synergetics, in addition to understanding the physical properties and understanding and control of complexity of technological processes that are a result of nonlinear interaction of different process variables, we also contribute to a closer mutual connection and merging of physics, informatics and technical sciences in terms of both theoretical as well as a applied research of complex systems and processes. The latter is necessary for holistic treatment, progress and development of technical sciences, as well as for developing new technologies, products, systems and processes. Through research based on these topics and with methods of synergetics we actively participate and attend to the development of science in the fields of description and characterization of the dynamics and stability of complex manufacturing processes, research and application of methods of nonlinear time series analysis, research and development of adaptive intelligent systems for automated modeling monitoring, supervision, control and optimization of complex technical and technological systems and processes. Significance of the results for the development of science is confirmed by the publication of research results in a high-quality scientific journals as well as their high visibility.", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Javna agencija za raziskovalno dejavnost RS", "project_id": "", "project_link": "", "start_date": "2015-01-01 00:00:00", "end_date": "2019-12-31 00:00:00", "persons": [{"id": "630046", "role": "Sodelavec na projektu", "ime": "Andrej", "priimek": "Dobnikar"}, {"id": "630687", "role": "Sodelavec na projektu", "ime": "Uroš", "priimek": "Lotrič"}, {"id": "630502", "role": "Vodja projekta na FRI", "ime": "Branko", "priimek": "Šter"}], "ref_project_type": 4, "logo": null, "menu_picture": null, "project_picture": null}}]