[{"id": 202, "si": {"title": "Reprezentacije kvantnih grup s pomočjo računske linearne algebre", "description": "<p>Teorija reprezentacij je veja matematike, ki proučuje abstraktne algebraične strukture preko njihovih elementov kot linearnih transformacij vektorskih prostorov. S pomočjo reprezentacij naredimo abstrakten algebraičen objekt konkreten, saj opišemo njene elemente z matrikami, algebraične operacije pa z matričnim seštevanjem in množenjem. Zato so reprezentacije močno orodje, saj prevedejo težke algebraične probleme na bolj razumljive probleme iz linearne algebre. Razvoj teorije v zadnjem desetletju omogoča modeliranje reprezentacij teoretičnih invariant v kombinatoričnem, računskem in geometrijskem smislu. S tem ima moderna teorija reprezentacij številne aplikacije, tako na širšem področju matematike, kot v drugih znanstvenih vedah. To je razlog, zakaj je teorija reprezentacij postala stičišče številnih inovativnih idej v matematiki, kot denimo v geometriji, linearni algebri, kombinatoriki in matematični fiziki. Navdih za trenutne raziskave prihaja iz povezave teorije reprezentacij simetričnih grup s teorijo reprezentacij Kac-Moodyjeve algebre. Te povezave vključujejo nove algoritme, ki omogočajo študij pomembnih invariant, ki so zelo pomembne v sorodnih področjih matematične fizike, z glavno povezavo s pojavi črnih lukenj.</p>\r\n\r\n<p>V naši raziskavi se bomo osredotočili na konstrukcijo novih algoritmov za izračun kristalnih dekompozicionalnih števil za kvantne afine Liejeve algebre. Ker te matrike niso definirane nad obsegi, temveč na kolobarju polinomov, je potrebno razviti drugačne pristope od klasičnih. Izhodišče za naše raziskave bo osnovna predstavitev kvantiziranih afinih Liejevih algeber tipa A, ki so znane kot Fockov prostor. Ker so ti objekti računsko zelo zahtevni, bomo poskušali najti bolj učinkovite algoritme od že znanih za njihovo računanje. Naš pristop k prej naštetim družinam algeber bo vključeval teoretične, kombinatorične, homološke, geometrijske in računske metode. Te predstavljajo kombinacijo klasičnih in inovativnih metod, ki izvirajo iz teorije Kac-Moodyjevih algeber in kvantnih grup. </p>\r\n", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Javna agencija za raziskovalno dejavnost RS", "project_id": null, "project_link": null, "start_date": "2016-01-01 00:00:00", "end_date": "2017-12-31 00:00:00", "persons": [{"id": "630697", "role": "Sodelavec na projektu", "ime": "Jure", "priimek": "Demšar"}, {"id": "630889", "role": "Sodelavec na projektu", "ime": "Damir", "priimek": "Franetič"}, {"id": "630901", "role": "Vodja projekta", "ime": "Polona", "priimek": "Oblak"}, {"id": "630716", "role": "Sodelavec na projektu", "ime": "Matevž", "priimek": "Poberžnik"}], "ref_project_type": 2, "logo": null, "menu_picture": null, "project_picture": null}, "en": {"title": "Representations of Quantum Groups via Computational Linear Algebra", "description": "<p>Representation theory is a branch of mathematics that studies abstract algebraic structures by representing their elements as linear transformations of vector spaces. A representation makes an abstract algebraic object concrete by describing its elements by matrices and the algebraic operations in terms of matrix addition and matrix multiplication. Representation theory is a powerful tool because it reduces problems in abstract algebra to problems in linear algebra, which is well understood. Successively pushed forward throughout the past decades, the concept of modeling representation theoretical invariants in a combinatorial, computational and geometric manner is a main strand of modern representation theory with many applications in numerous areas of mathematics and in other basic sciences as well. This is why representation theory has become the crossroad of many subjects and ideas in mathematics, including geometry, linear algebra, combinatorics and mathematical physics. The inspiration for the current research comes from the connections of the representation theory of symmetric groups to the representation theory of Kac-Moody algebras. These connections include new algorithms developed to study important invariants, such as the crystal decomposition numbers for the quantized affine Lie algebras. These invariants are very important in the related fields of mathematical physics, with their main applications being related to the phenomena of black holes.</p>\r\n\r\n<p>In our research we will focus on the construction of new algorithms for computation of the crystal decomposition matrices for certain classes of quantized affine Lie algebras. Since these matrices are not defined over a field, but rather over rings of polynomials, it is necessary to develop different approaches from the classical ones when dealing with this kind of mathematical objects. The starting point for our research will be the basic representation of the quantized affine Lie algebra of type A, which is known as the Fock space. Because these objects are very large in terms of computational power needed to deal with them, we will attempt to find more efficient algorithms for their computation than the ones used at the moment, such as the LLT algorithm. Our approach to the above families of algebras involves representation theoretical, combinatorial, homological, geometrical and computational methods. These methods represent a combination of classical methods, and new methods originating in Kac-Moody algebras and quantum groups. </p>\r\n", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Javna agencija za raziskovalno dejavnost RS", "project_id": null, "project_link": null, "start_date": "2016-01-01 00:00:00", "end_date": "2017-12-31 00:00:00", "persons": [{"id": "630697", "role": "Sodelavec na projektu", "ime": "Jure", "priimek": "Demšar"}, {"id": "630889", "role": "Sodelavec na projektu", "ime": "Damir", "priimek": "Franetič"}, {"id": "630901", "role": "Vodja projekta", "ime": "Polona", "priimek": "Oblak"}, {"id": "630716", "role": "Sodelavec na projektu", "ime": "Matevž", "priimek": "Poberžnik"}], "ref_project_type": 2, "logo": null, "menu_picture": null, "project_picture": null}}]