[
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Mobile learning (m-learning) is developing rapidly in the world as the use of mobile devices is becoming popular and accessible financially and technologicaly. At the end of 2012, there were more than 6,8 billion mobile users in the world, which comprises 96% of the world population (source: The International Telecommunication Union, 2013). The contemporary way of living allows to be persistenlty connected to Internet, which enables students to seek for untraditional learning environments: dislocated from the classrooms, flexible in time, ubiquitously available and tailored to advances in technology. However, regardless of the development strategies for the period up to the year 2016, in practice, development of m-learning applications is based mostly on the enthusiasm of individual educational institutions or teachers. In this bilateral cooperation we propose to establish the first standard theoretical/educational framework for development of game-based learning and to develop and evaluate a set of such sample game-based learning applications. </p>\r\n",
            "end_date": "2015-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630864",
                    "ime": "Zoran",
                    "priimek": "Bosnić",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630970",
                    "ime": "Miha",
                    "priimek": "Drole",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630309",
                    "ime": "Igor",
                    "priimek": "Kononenko",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630675",
                    "ime": "Domen",
                    "priimek": "Košir",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630727",
                    "ime": "Kaja",
                    "priimek": "Zupanc",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "http://mobilearn.unimediteran.net/",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2014-04-01 00:00:00",
            "title": "Development of new e-learning models for game-based learning using mobile technologies"
        },
        "id": 62,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Mobilno učenje (m-učenje) se v svetu hitro razvija, saj postaja uporaba mobilnih naprav vedno bolj priljubljena ter finančno in tehnološko dostopna. Ob koncu leta 2012 je bilo na svetu že več kot 6,8 milijard mobilnih uporabnikov, kar predstavlja 96% svetovne populacije (vir: Mednarodna Telekomunikacijska Zveza, 2013). Sodobni način življenja nam omogoča stalno povezavo z internetom, kar omogoča študentom, da iščejo netradicionalna učna okolja, ki so dislocirana od učilnic, časovno prilagodljiva, vseprisotna in prilagojena napredkom ter tehnologiji. Vendar pa v praksi, ne glede na razvojne strategije za obdobje vse do leta 2016, razvoj aplikacij za m-učenje temelji predvsem na zavzetosti posameznih izobraževalnih ustanov in učiteljev.</p>\r\n<p>V tem bilateralnem sodelovanju predlagamo definiranje novega (prvega takšnega) teoretičnega izobraževalnega ogrodja za standardiziran razvoj sistemov za učenje skozi igro (game-based learning system) ter razvoj in testiranje uspešnosti množice mobilnih učnih aplikacij, ki temeljijo na učenju skozi igro.</p>\r\n",
            "end_date": "2015-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630864",
                    "ime": "Zoran",
                    "priimek": "Bosnić",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630970",
                    "ime": "Miha",
                    "priimek": "Drole",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630309",
                    "ime": "Igor",
                    "priimek": "Kononenko",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630675",
                    "ime": "Domen",
                    "priimek": "Košir",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630727",
                    "ime": "Kaja",
                    "priimek": "Zupanc",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "http://mobilearn.unimediteran.net/",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2014-04-01 00:00:00",
            "title": "Razvoj novih modelov v e-izobraževanju za učenje skozi igro z uporabo mobilnih tehnologij"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>The goal of the project is development of intelligent system that can improve detection of human cognitive and behavior disorders. Example is dementia - the loss of intellectual functions, accompanied with personality disturbances (its most common form is the Alzheimer disease) and deterioration of individuals quality of personal and professional life. Through the last decades, an abundance of medical data was gathered about dementia. These data include multimedia objects (images, sound, etc.), temporal data and time-series, and text documents; their analyses require state-of-the-art methods from the fields of data analysis. The expected project contributions include a prototype of the prediction system for analysis of disorders that will be generalized for several related health problems (such as Brain ischemia, Brain haemorrhagia, Brain tumors, Neurodegenerative disorders etc.) and evaluating the prototype on the available dementia data acquired from the Neurological (Novi Sad) and Oncological institute (Ljubljana).</p>\r\n",
            "end_date": "2017-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630864",
                    "ime": "Zoran",
                    "priimek": "Bosnić",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630970",
                    "ime": "Miha",
                    "priimek": "Drole",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630675",
                    "ime": "Domen",
                    "priimek": "Košir",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630511",
                    "ime": "Matjaž",
                    "priimek": "Kukar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630019",
                    "ime": "Matej",
                    "priimek": "Pičulin",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2016-02-04 00:00:00",
            "title": "Intelligent computer techniques for improving medical detection, analysis and explanation of human cognition and behavior disorders"
        },
        "id": 199,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Tema projekta je razvoj inteligentnega sistema za zaznavanje človeških kognitivnih motenj in motenj obnašanja. Primer le-teh je demenca - izguba intelektualnih funkcij, ki jo spremljajo motnje osebnosti (njena najbolj znana oblika je Alzheimerjeva bolezen), vsi ti pojavi pa vplivajo na znižanje ravni človekovega strokovnega in zasebnega življenja. Podatki o demenci obsegajo slike, zvoke, časovna zaporedja meritev in besedilne dokumente, njihova analiza pa zahteva uporabo sodobnih metod za analizo podatkov. Pričakovani rezultati projekta obsegajo prototip napovednega sistema, ki ga je možno uporabiti za analizo družine bolezni (kot so ishemična bolezen možganov, otekanje možganov, možganski tumorji in nevrodegenerativne bolezni), testirati prototip na podatkih Nevrološkega (Novi Sad) in Onkološkega inštituta (Ljubljana).</p>\r\n",
            "end_date": "2017-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630864",
                    "ime": "Zoran",
                    "priimek": "Bosnić",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630970",
                    "ime": "Miha",
                    "priimek": "Drole",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630675",
                    "ime": "Domen",
                    "priimek": "Košir",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630511",
                    "ime": "Matjaž",
                    "priimek": "Kukar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630019",
                    "ime": "Matej",
                    "priimek": "Pičulin",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2016-02-04 00:00:00",
            "title": "Inteligentne računalniške metode za izboljšanje zaznavanja, analize in razlage kognitivnih motenj obnašanja pri človeku"
        }
    }
]