[{"id": 511, "si": {"title": "Slovar sopomenk sodobne slovenščine: od skupnosti za skupnost", "description": "<p>Na Centru za jezikovne vire in tehnologije Univerze v Ljubljani je v soizvedbi Fakultete za računalništvo in informatiko nastal Slovar sopomenk sodobne slovenščine [http://viri.cjvt.si/sopomenke/slv/]. Gre za najobsežnejšo prosto dostopno avtomatsko generirano spletno zbirko sopomenk za slovenščino, ki uvaja nov tip jezikovnega vira: odzivni slovar. Slednji je v izhodišču pripravljen z naprednimi avtomatskimi metodami, nadaljnji razvoj (urejanje in čiščenje podatkov) pa poteka odprto javnosti in v sodelovanju z zainteresirano uporabniško skupnostjo.</p>\r\n<p>Slovar sopomenk sodobne slovenščine v javnosti še ni poznan, prav tako niso znane prednosti in omejitve odzivnih slovarjev in možnosti za uporabniško vključevanje v razvoj vira. Namen projekta je predstaviti in promovirati našteto v širši javnosti, s posebno mislijo na uporabniške skupine, za katere so informacije o sopomenskosti najbolj dragocene. V širšem smislu želimo s projektom izboljšati zavedanje o vrednosti jezikovnih virov za skupnost in priložnosti, ki jih slednji ponujajo za nadaljnji razvoj jezikovne infrastrukture za slovenščino.</p>\r\n<p>V projektu bodo izvedene promocijske aktivnosti različnih vrst, npr. diseminacijski dogodki in multimedijske izobraževalne vsebine, na osnovi izsledkov naprednega spremljanja uporabniških odzivov in slovarske rabe pa bomo slovar nadgradili z elemente, ki bodo uporabnike dodatno motivirali za rabo vira in raziskovanje sopomenskosti v slovenskem jeziku.</p>\r\n", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Ministrstvo za kulturo", "project_id": null, "project_link": null, "start_date": "2018-02-01 00:00:00", "end_date": "2019-10-30 00:00:00", "persons": [{"id": "630734", "role": "Vodja projekta", "ime": "ŠPELA", "priimek": "ARHAR HOLDT"}, {"id": "630637", "role": "Sodelavec na projektu", "ime": "Jaka", "priimek": "Čibej"}, {"id": "630570", "role": "Sodelavec na projektu", "ime": "Teja", "priimek": "Goli"}], "ref_project_type": 7, "logo": null, "menu_picture": null, "project_picture": null}, "en": {"title": "Thesaurus of Modern Slovene: By the Community for the Community", "description": "<p>In collaboration with the Faculty of Computer and Information Science, the Centre for Language Resources and Technologies has compiled the Thesaurus of Modern Slovene [http://viri.cjvt.si/sopomenke/eng/], the largest open-access automatically generated online collection of Slovene synonyms, which introduces a new type of language resource: the responsive dictionary. The initial database of a responsive dictionary is constructed using advanced computational methods, while further development (data editing and cleaning) is open to the public and carried out in collaboration with a community of dedicated users.</p>\r\n<p>The Thesaurus of Modern Slovene is still an unknown language resource, and language users are unfamiliar with the advantages and restrictions of responsive dictionaries, as well as the opportunities for participating in resource development. The purpose of the project is to present and promote these aspects in the general public, with particular emphasis on those user groups that find synonym information invaluable in their work. Furthermore, the project aims to spread awareness of the value of language resources for the community, and the opportunities they offer for the further development of the language infrastructure for Slovene.</p>\r\n<p>Within the project, a number of promotional activities will be organized (e.g. dissemination events and workshops that will results in multimedia educational content). In addition, based on the results collected through advanced monitoring of user feedback and dictionary use, the Thesaurus will be upgraded with elements that will further motivate users to use the language resource and research synonymy in Slovene.</p>\r\n", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Ministrstvo za kulturo", "project_id": null, "project_link": null, "start_date": "2018-02-01 00:00:00", "end_date": "2019-10-30 00:00:00", "persons": [{"id": "630734", "role": "Vodja projekta", "ime": "ŠPELA", "priimek": "ARHAR HOLDT"}, {"id": "630637", "role": "Sodelavec na projektu", "ime": "Jaka", "priimek": "Čibej"}, {"id": "630570", "role": "Sodelavec na projektu", "ime": "Teja", "priimek": "Goli"}], "ref_project_type": 7, "logo": null, "menu_picture": null, "project_picture": null}}]