[{"id": 31, "si": {"title": "Učenje velikega števila vizualnih kategorij objektov za poizvedovanje v slikovnih in video podatkovnih zbirkah", "description": "<p>V okviru projekta predlagamo razvoj in uporabo hierarhičnih modelov kategorij objektov, ki temeljijo na intuitivni kompozicionalni predstavitvi, za poizvedovanje po slikovnih in video zbirkah.</p>\r\n\r\n<p>Poglavitno delo v predlaganem projektu bo usmerjeno k modeliranju in učenju večjega števila vizualnih kategorij objektov s hierarhično predstavitvijo, ki omogoča računsko učinkovito razpoznavo, sprotno učenje objektov ter semantično poizvedovanje po vizualni informaciji. Tovrsten način modeliranja bo omogočil dolgoročno učenje novih objektov ter samodejno indeksiranje velikega števila kategorij v slikah. Hkrati bo podprl nove vidike uporabniške interakcije, kot so možnosti semantično usmerjenih povratno-zančnih poizvedb, kontekstnih poizvedb in poizvedb na različnih nivojih podrobnosti, ki pa še vedno ohranjajo vez s semantičnim pomenom celote.</p>\r\n", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Javna agencija za raziskovalno dejavnost RS", "project_id": "", "project_link": "", "start_date": "2010-05-01 00:00:00", "end_date": "2013-04-30 00:00:00", "persons": [{"id": "630828", "role": "Sodelavec na projektu", "ime": "Marko", "priimek": "Boben"}, {"id": "630895", "role": "Sodelavec na projektu", "ime": "Luka", "priimek": "Čehovin Zajc"}, {"id": "630871", "role": "Sodelavec na projektu", "ime": "Matej", "priimek": "Kristan"}, {"id": "630252", "role": "Vodja projekta", "ime": "Aleš", "priimek": "Leonardis"}, {"id": "630965", "role": "Sodelavec na projektu", "ime": "Domen", "priimek": "Tabernik"}], "ref_project_type": 5, "logo": null, "menu_picture": null, "project_picture": null}, "en": {"title": "Learning a large number of visual object categories for content-based retrieval in image and video databases", "description": "<p>In this project we will develop large-scale hierarchical object class models that are based on the intuitive principle of compositionality for the purpose of visual retrieval.</p>\r\n\r\n<p>The main focus of this project, however, will be on modeling and learning a larger number of visual object  categories within a hierarchical compositional framework which will allow for a computationally efficient recognition, online object learning and semantic visual retrieval. This approach will enable continous learning of novel object categories through user interaction and autonomous indexing of object categories in image databases. It will also open up new views of computer-user interaction in terms of continuous user-in-the-loop based semantic queries and queries at different levels of detail which retain their semantic meaning.</p>\r\n", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Javna agencija za raziskovalno dejavnost RS", "project_id": "", "project_link": "", "start_date": "2010-05-01 00:00:00", "end_date": "2013-04-30 00:00:00", "persons": [{"id": "630828", "role": "Sodelavec na projektu", "ime": "Marko", "priimek": "Boben"}, {"id": "630895", "role": "Sodelavec na projektu", "ime": "Luka", "priimek": "Čehovin Zajc"}, {"id": "630871", "role": "Sodelavec na projektu", "ime": "Matej", "priimek": "Kristan"}, {"id": "630252", "role": "Vodja projekta", "ime": "Aleš", "priimek": "Leonardis"}, {"id": "630965", "role": "Sodelavec na projektu", "ime": "Domen", "priimek": "Tabernik"}], "ref_project_type": 5, "logo": null, "menu_picture": null, "project_picture": null}}]