[
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Qualitative models are models which, for a contrast from classification and regression models which predict classes or numerical quantities, describe qualitative relations between the observed variables. An example of such a relation is y=Q(+x), &quot;y increases with x&quot;. Qualitative models usualy also include conditions under which they are true, e.g. y=Q(-x, +z) if x&lt;12, and y=Q(-z) otherwise.</p>\r\n\r\n<p>Although such models do not predict exact numerical values, they also have several advantages as compared to regression models. Qualitative descriptions are close to the human way of thinking (&quot;the more it rains, the more wet I will get&quot;, and not &quot;the quantity of water in my clothes equals 0.45 l/cm &#215; rt, where r is the rain intensity in cm/h and t is the time spent under it&quot;), therefore such models are easier to explain and can reveal more information than regression models. They are typically also more robust since qualitative relations are simpler to model. They are thus often used as a step before regression modeling, where the relations in the qualitative model are used as constraints for the regression model (Šuc, 2004).</p>\r\n\r\n<p>Despite the nice properties of qualitative models, there are no efficient algorithms for their construction. One of the rare methods from the field, QUIN (Šuc, 2001) induces trees similar to classification trees except that their leaves contain qualitative constraints. While using QUIN on real-world data (Žabkar 2005, 2006) we noticed a number of its deficiencies. The algorithm becomes very slow with the growing number of dimensions. It cannot treat the variable representing the time separate from other variables, which decreases its suitability for modeling dynamic systems. Based on an impurity measure, it is limited to the construction of tree models which are inappropriate for many practical problems. Finally, its formal definition of a constraint does not correspond to the mathematical definition of a derivative.</p>\r\n\r\n<p>To solve the above problems, we developed a new approach to qualitative modeling which is based on the approximation of partial derivatives of the sampled multidimensional function. The procedure computes the derivative at each point where the function is sampled using the points at its vicinity which is defined either by triangulation or by the axis in which direction we compute the derivative. The computed derivatives can be treated as numbers or, to proceed with qualitative modeling, we can observe only their signs. The data preprocessed in this way can be subsequently modeled by any general machine learning algorithm or presented using a suitable visualization method.</p>\r\n\r\n<p>We developed a prototype implementation named Pade (Žabkar 2007a). Its experimental results are excellent even on rather complicated synthetic data, such as the function sin(x)sin(y) over a few periods. Even in its prototype form, the algorithm has also been successfully used in EU projects XPERO in XMEDIA.</p>\r\n\r\n<p>The goal of the project is to theoretically investigate the field and develop the procedures which will be useful for qualitatively modeling of real-world data. The expected research problems are:</p>\r\n<p>    basic computation of partial derivatives as explained above; we need to investigate the influence of various parameters of the method and develop the existing prototype to the final version;</p>\r\n<p>    derivation using the chain rule, where all variables are treated as depending upon the special variable representing the time;</p>\r\n<p>    treatment of discrete variables by incorporating them in the concept of vicinity, derive them, and derive by them; the present state-of-the art method QUIN is unable to treat discrete variables at all, while Pade can do some of the above in some of its variants</p>\r\n<p>    investigating the use of different machine learning algorithms for constructing the final qualitative model;</p>\r\n<p>    quantitative-to-qualitative transformation, where we construct a numerical model from the qualitative one and the data; we intend to focus on construction of symbolic models and have already published some results in this field (Žabkar 2007b);</p>\r\n<p>    self-evaluation of the modeling; we expect to do this by using statistical measures such as linear correlation and/or by observing the density of the space coverage around the points where we compute the derivative.</p>\r\n\r\n<p>The usefulness of the developed methods will be tested on synthetic data and, especially, on the real-world data from industry, medicine and elsewhere. All methods will be implemented inside the system Orange (Demšar, 2004) and be freely available to their potential users.</p>\r\n\r\n<p>The topic of the project partially overlaps with the anticipated topic of the doctoral dissertation of Jure Žabkar, a researcher at the Faculty of Computer and Information Science whose co-advisor is the leader of this proposed project and who already worked on these problems. We also expect to engage other under- and postgraduate students on the project, while our partners on various EU projects will test the developed methods as a part of the respective projects.</p>\r\n\r\n<p>The developed methods will be quite applicable in practice as qualitative models are useful for</p>\r\n<p>    industry, where we can observe the effects of input parameters on the behavior or the quality of the product (Vladušić, 2006),</p>\r\n<p>    economy and sociology (Samuelson, 1947) where we can, similarly, predict qualitative effects of a certain quantity on the other or, by treating time separately, predict trends and their dependence on various variables,</p>\r\n<p>    in natural sciences, for instance in meteorology (Žabkar 2005) or in biology and medicine, where, for instance, qualitative relations between genes can reveal their mutual dependencies and elsewhere.</p>\r\n\r\n<p>Implemented procedures will also be used for teaching at the Faculty of computer and information science.</p>\r\n\r\n<p>Bratko (2003) I. Bratko, D. Šuc: Learning qualitative models. AI Mag., vol. 24, no. 4, pp. 107-119.</p>\r\n\r\n<p>Demšar (2004) J. Demšar, B. Zupan. From experimental machine learning to interactive data mining. Laboratory of artificial intelligence, Faculty of computer and information science, Ljubljana.</p>\r\n\r\n<p>Samuelson (1947) P. A. Samuelson: Foundations of Economic Analysis, Harvard University Press.</p>\r\n\r\n<p>Šuc (2004) D. Šuc, D. Vladušić, I. Bratko: Qualitatively faithful quantitative prediction, Artificial Intelligence, 2004, vol. 158, no. 2, pp. [189]-214.</p>\r\n\r\n<p>Vladušić (2006) D. Vladušić, D. Šuc, I. Bratko, W. Rulka: Q2 learning and its application to car modelling. Appl. artif. intell., Sep. 2006, vol. 20, no. 8, pp. [675]-701</p>\r\n\r\n<p>Žabkar (2005) J. Žabkar et al.: Hydrological modelling of Savinja river using machine learning methods, Proceedings of European Conference on Ecological Modelling 05.</p>\r\n\r\n<p>Žabkar (2006) J. Žabkar et al.: Q2 prediction of ozone concentrations, Ecological Modelling, 2006, vol. 191, no. 1, pp. [68]-82.</p>\r\n\r\n<p>Žabkar (2007a) J. Žabkar, I. Bratko, J.Demšar: Learning Qualitative Models through Partial Derivatives by Pade, Proceedings of Qualitative Reasoning 07.</p>\r\n\r\n<p>Žabkar (2007 b) J. Žabkar, A. Sadikov, I. Bratko, J. Demšar: Qualitatively Constrained Equation Discovery. Proceedings of Qualitative Reasoning 07.</p>\r\n",
            "end_date": "2012-04-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630690",
                    "ime": "Aleksander",
                    "priimek": "Sadikov",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630897",
                    "ime": "Miha",
                    "priimek": "Štajdohar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630824",
                    "ime": "Jure",
                    "priimek": "Žabkar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": null,
                    "ime": "Gregor",
                    "priimek": "Rot",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2009-05-01 00:00:00",
            "title": "Qualitative modeling from data"
        },
        "id": 26,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Kvalitativni modeli so modeli, ki  za razliko od klasifikacijskih in regresijskih, ki napovedujejo razrede in zvezne količine  opisujejo kvalitativne povezave med opazovanimi spremenljivkami. Kvalitativna zveza je npr. y=Q(+x), kar preberemo &quot;y narašča z x&quot;. Kvalitativni modeli navadno vsebujejo tudi pogoje, pri katerih relacije veljajo, denimo, y=Q(-x, +z), če x&lt;12 ter y=Q(-z) sicer.</p>\r\n\r\n<p>Čeprav takšni modeli za razliko od regresijskih ne napovedujejo točne, numerične vrednosti spremenljivk, imajo pred slednjimi tudi več prednosti. Kvalitativna predstavitev je blizu človeškemu načinu razmišljanja (&quot;bolj ko dežuje, bolj bom moker&quot; in ne &quot;količina vode v obleki znaša 0.35 l/cm &#215; rt, kjer je r intenzivnost padavin v cm/h in t čas preživet na dežju&quot;), zato so takšni modeli pogosto lažje razložljivi in ekspertu povedo več od regresijskih. Navadno so tudi robustnejši od regresijskih, saj je zveza, ki jo modelirajo, preprostejša, zato se lahko uporabljajo tudi kot korak pred regresijskim modeliranjem, tako da kvalitativni model opiše omejitve, ki se jih mora držati regresijski model (Šuc, 2004).</p>\r\n\r\n<p>Kljub odličnim lastnostim kvalitativnih modelov še ni učinkovitih algoritmov za njihovo avtomatsko sestavljanje iz podatkov. Ena redkih metod s tega področja, QUIN (Šuc, 2001), gradi drevesa, podobna klasifikacijskim drevesom, le da imajo v svoji listih namesto razredov kvalitativne omejitve. Pri njegovi uporabi na različnih praktičnih problemih (Žabkar 2005, 2006) pa smo zaznali precej pomanjkljivosti. Algoritem je zelo počasen pri večjem številu spremenljivk. Neupoštevanje posebne vloge spremenljivke, ki predstavlja čas, zmanjšuje njegovo prikladnost za modeliranje dinamičnih sistemov. Ker temelji na meri nečistočeje, je omejen na konstrukcijo drevesnih modelov, ki pogosto niso primeren modelni jezik v resničnih problemih. In, končno, formalna definicija QUINovih omejitev ne sledi matematični definiciji odvoda.</p>\r\n\r\n<p>Opisane težave je mogoče rešiti s povsem novim pristopom h kvalitativnemu modeliranju, ki bo temeljil na aproksimaciji parcialnih odvodov na vzorčeni večdimenzionalni funkciji. Postopek izračuna parcialni diferencialni odvod v vsaki posamezni točki s pomočjo točk v okolici, pri čemer je okolica definirana bodisi s pomočjo triangulacije ali glede na bližino &#244;si, v smeri katere računamo odvod. Izračunane odvode lahko obravnavamo numerično ali pa opazujemo le njihov predznak in tako dobimo kvalitativni parcialni odvod v vsaki točki. Tako pripravljene podatke lahko modeliramo s poljubno metodo strojnega učenja ali pa jih prikažemo s primerno vizualizacijsko metodo.</p>\r\n\r\n<p>Kot prototip za preskus gornje ideje smo razvili algoritem imenovan Pade (Žabkar 2007a). Poskusi kažejo, da deluje hitro in zanesljivo tudi na težkih sintetičnih domenah, kot je funkcija sin(x)sin(y) prek več period. Že v obstoječi obliki ga uporabljamo tudi v evropskih projektih XPERO in XMEDIA.</p>\r\n\r\n<p>V okviru projekta nameravamo idejo teoretično raziskati in nato razviti postopke, s katerimi jo bo mogoče uporabljati na praktičnih problemih. Predvidena raziskovalna področja obsegajo:</p>\r\n<p>    osnovno računanje parcialnih odvodov, kakor je opisano zgoraj; potrebno je raziskati vplivp osameznih argumentov metode in nato dopolniti obstoječi prototip do končne verzije;</p>\r\n<p>    posredno parcialno odvajanje, kjer je na voljo posebna spremenljivka, čas, vse ostale pa so njene funkcije, zato je parcialni odvod smiselno računati posredno prek časa;</p>\r\n<p>    upoštevanje diskretnih spremenljivk in odvajanje po njih; zvezna funkcija, ki jo želimo odvajati, je pogosto odvisna diskretnih spremenljivk, ki jih QUIN ni znal obravnavati, Pade pa jih zna v nekaterih različicah upoštevati v definiciji sosednosti, ne zna pa po njih odvajati;</p>\r\n<p>    ugotavljanje primernosti različnih algoritmov strojnega učenja za sestavljanje kvalitativnih modelov iz podatkov, kakršne pripravijo zgoraj naštete metode;</p>\r\n<p>    kvalitativno-kvantitativne pretvorbe, s katerimi iz kvalitativnega modela in podatkov dobimo numerični model; pri tem se bomo osredotočili na postopke, katerih rezultat je simbolični model; nekaj začetnih rezultatov na tem področju smo že objavili (Žabkar 2007b);</p>\r\n<p>    samo-ocenjevanje zanesljivosti dobljenih rezultatov; predpostavljamo, da bo to mogoče izvesti s statističnimi merami (linearna korelacija) in opazovanjem gostote pokritosti prostora v okolici točke, kjer računamo odvod.</p>\r\n\r\n<p>Uporabnost razvitih metod bomo preskušali tako na sintetičnih podatkih kot predvsem na podatkih iz industrije, medicine in od drugod. Vse metode bodo implementirane v okviru sistema Orange (Demšar, 2004) in prosto dostopne potencialnim uporabnikom.</p>\r\n\r\n<p>Tema projekta delno sovpada s predvideno temo doktorske disertacije Jureta Žabkarja, raziskovalca na Fakulteti za računalništvo, katerega somentor je vodja predlaganega projekta in ki je na tem področju že delal. Na projektu bodo sodelovali tudi drugi do in podiplomski študenti, pri testiranju metod pa tudi partnerji, s katerimi sodelujemo v okviru različnih evropskih projektov.</p>\r\n\r\n<p>Razvite metode bodo imele velik praktični pomen, saj so kvalitativni modeli med drugim uporabni v</p>\r\n\r\n<p>    industriji, kjer lahko z njimi opazujemo vpliv posameznih vhodnih parametrov postopka na vedenje ali kvaliteto produkta (Vladušić, 2006)</p>\r\n<p>    ekonomiji in sociologiji (Samuelson, 1947), kjer lahko, podobno, napovedujemo vplive dejavnikov na določeno merjeno količino ali ob upoštevanju časa, napovedujemo prihodnje trende v odvisnosti od različnih spremenljivk</p>\r\n<p>    v naravoslovnih vedah, denimo meteorologiji (Žabkar 2005) ali biologiji, medicini, kjer nam kvalitativno opazovanje relacij med geni lahko razkrije njihove medsebojne odvisnosti</p>\r\n<p>in drugje. Implementirane postopke bomo uporabljali tudi pri pedagoškem procesu na Fakulteti za računalništvo, tako v okviru predavanj iz umetne inteligence kot pri izdelavi seminarskih in diplomskih nalog s področja modeliranja na osnovi podatkov.</p>\r\n\r\n<p>Bratko (2003) I. Bratko, D. Šuc: Learning qualitative models. AI Mag., vol. 24, no. 4, str. 107-119.</p>\r\n\r\n<p>Demšar (2004) J. Demšar, B. Zupan. From experimental machine learning to interactive data mining. Laboratorij za umetno inteligenco, Fakulteta za računalništvo in informatiko, Ljubljana. </p>\r\n\r\n<p>Samuelson (1947) P. A. Samuelson: Foundations of Economic Analysis, Harvard University Press.</p>\r\n\r\n<p>Šuc (2004) D. Šuc, D. Vladušić, I. Bratko: Qualitatively faithful quantitative prediction, Artificial Intelligence, 2004, vol. 158, no. 2, str. [189]-214.</p>\r\n\r\n<p>Vladušić (2006) D. Vladušić, D. Šuc, I. Bratko, W. Rulka: Q2 learning and its application to car modelling. Appl. artif. intell., Sep. 2006, vol. 20, no. 8, str. [675]-701</p>\r\n\r\n<p>Žabkar (2005) J. Žabkar in sod.: Hydrological modelling of Savinja river using machine learning methods, Proceedings of European Conference on Ecological Modelling 05.</p>\r\n\r\n<p>Žabkar (2006) J. Žabkar in sod.: Q2 prediction of ozone concentrations, Ecological Modelling, 2006, vol. 191, no. 1, str. [68]-82.</p>\r\n\r\n<p>Žabkar (2007a) J. Žabkar, I. Bratko, J.Demšar: Learning Qualitative Models through Partial Derivatives by Pade, Proceedings of Qualitative Reasoning 07.</p>\r\n\r\n<p>Žabkar (2007 b) J. Žabkar, A. Sadikov, I. Bratko, J. Demšar: Qualitatively Constrained Equation Discovery. Proceedings of Qualitative Reasoning 07.vizualizacijsko metodo.</p>\r\n",
            "end_date": "2012-04-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630690",
                    "ime": "Aleksander",
                    "priimek": "Sadikov",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630897",
                    "ime": "Miha",
                    "priimek": "Štajdohar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630824",
                    "ime": "Jure",
                    "priimek": "Žabkar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": null,
                    "ime": "Gregor",
                    "priimek": "Rot",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2009-05-01 00:00:00",
            "title": "Kvalitativno modeliranje na osnovi podatkov"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Research in biomedicine is being revolutionized by new experimental technologies, information infrastructures and emerging data encoding standards for storage of results and knowledge in various databases, ontologies, textual descriptions and tagged libraries. New methods for explorative analysis that preserve the contextual and structural richness of these information sources and support the daily work of biologists by exposing the most important relations in a visually rich, comprehensive, and easy-to-use interface.</p>\r\n\r\n<p>In the project we will develop and apply a set of integrative computational and visualization tools for inference of hypotheses from heterogeneous data and knowledge sources. These will be applied to the reconstruction of adiponectin signalling pathway, an emerging drug target for obesity and type 2 diabetes, and in the study of side effects of statins and their role in cholesterol pathways. With current practical demonstrations in this field being rare and focusing only on a single source of information, the development and application of data/knowledge integration techniques should be regarded as highly original.</p>\r\n",
            "end_date": "2012-04-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630891",
                    "ime": "Tomaž",
                    "priimek": "Curk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630869",
                    "ime": "Lan",
                    "priimek": "Umek",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630917",
                    "ime": "Lan",
                    "priimek": "Žagar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": null,
                    "ime": "Minca",
                    "priimek": "Mramor",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2009-05-01 00:00:00",
            "title": "Data and knowledge integration methods for network systems biology"
        },
        "id": 27,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Z razvojem visokozmogljivostnih tehnologij je sodobna biomedicina neposredno odvisna od uporabe informacijskih tehnologij, standardov za zapis podatkov in znanj, ontologij, ter spremljajočih in primerno označenih tekstovnih zapisov. Za integracijo te množice informacij so danes biologom potrebna nova orodja za podporo pri planiranju in analizi eksperimentov, ki vsebinsko in strukturno ohranjajo informacijo iz vhodnih virov ter jo v obliki novih hipotez podajo uporabniku na pregleden način.</p>\r\n\r\n<p>V okviru projekta bomo razvili računska in vizualizacijska orodja za integracijo in odkrivanje znanj iz heterogenih podatkovnih baz in baz znanj s področja bioinformatike. Razvita orodja bomo nato praktično uporabili v rekonstrukciji signalne poti adiponektina, obetavne tarče za zdravila za sladkorno bolezen in debelost, ter na področju raziskav stranskih učinkov statinov in njihove vloge v holesterolnih poteh. Orodja za uspešno integracijo informacij v bioinformatiki so šele v nastajanju, njihova uporaba na omenjenih domenah pa bi bila pionirska in vsekakor zelo izvirna.</p>\r\n",
            "end_date": "2012-04-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630891",
                    "ime": "Tomaž",
                    "priimek": "Curk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630869",
                    "ime": "Lan",
                    "priimek": "Umek",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630917",
                    "ime": "Lan",
                    "priimek": "Žagar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": null,
                    "ime": "Minca",
                    "priimek": "Mramor",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2009-05-01 00:00:00",
            "title": "Metode za povezovanje podatkov in znanja v sistemski biologiji mrež"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Plant pathogens and pests are the cause of substantial crop yield loss throughout the world. Damage caused by pests is estimated to be app. 100 billions USD per year despite the intensive use of pesticides. Understanding the principles of plant‐pathogen and plant‐ herbivore interactions is necessary for establishment of effective systems for plant protection. Substantial knowledge has been gathered during past decades on the mechanisms of attack/defence in one-to-one interaction studies in lab conditions. In the field, however, plants are not exposed to one type of stress only. Normally plants have to face a combination of different stresses, like drought and several types of pathogens and pests in parallel. Newly emerging tools in molecular biology and functional genomics now enable higher analytical throughput and thus more complex and realistic experimental setups.</p>\r\n\r\n<p>Within the proposed project we would like to investigate a system of tritrophic interaction of potato with viral pathogen and insect pest. Potato virus YNTN (PVYNTN), causing tuber ring necrosis disease of potato (Solanumtuberosum L.), is spread all over Europe, North America and even in some parts of Asia. Since it is causing symptoms on plantlets as well as on tubers, it diminishes the crop yield and significantly lowers its quality. On the other hand, Colorado potato beetle is a major pest of potato in Europe and North America. Potato plants will be first exposed to infection with virus PVY and subsequently to larvae of Colorado potato beetle and, in parallel, to individual pathogen/pest only. Besides wild type potato plants, selected transgenic lines with perturbed major signalling pathways or with modified activitiy of critical defence components will be included. Gene expression will be measured using next generation sequencing approach, DNA microarrays and quantitative PCR. The knowledge obtained on the transcriptome level will be complemented with proteomics experiments. Data will be integrated with public knowledge using bioinformatics tools to prepare improved models/hypothesis on the studied system. Knowledge of plant‐pathogen/pest interactions will be, through the results of this study brought into new perspective, as multi-trophic interaction systems are ecologically more relevant. Potential paradigm shift in further research within this area and development of potential biotechnological applications is thus expected.</p>\r\n",
            "end_date": "2014-06-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630891",
                    "ime": "Tomaž",
                    "priimek": "Curk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Vodja projekta na FRI"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2011-07-01 00:00:00",
            "title": "Growth and defense trade-offs in multitrophic interaction between potato and its two major pests"
        },
        "id": 34,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Rastlinski škodljivci in povzročitelji bolezni so vzrok za velike izgube pridelka po celem svetu. Kljub intenzivni uporabi pesticidov je škoda, ki jo povzročajo škodljivci vsako leto ocenjena na 100 mio USD. Razumevanje odnosa med rastlino, povzročitelji bolezni in škodljivci je nujno za zagotavljanje učinkovitega sistema za zaščito rastlin. V zadnjih desetletjih je bilo pridobljenega veliko znanja o procesih napada in obrambe v enostavnih interakcijah 1 rastlina - 1 škodljivec. Vendar pa v naravi rastline nikoli niso izpostavljene le enemu stresnemu dejavniku, temveč se morajo soočati s kombinacijo različnih dejavnikov, kot so suša, različni povzročitelji bolezni in škodljivci, hkrati. Nove visoko zmogljive metode molekularne biologije in funkcijske genomike omogočajo hkratno analizo velikega števila vzorcev, posledično pa dovoljujejo tudi analizo v bolj realističnih in kompleksnih eksperimentalnih pogojih.</p>\r\n\r\n<p>V okviru predlaganega projekta bomo raziskovali tritrofno interakcijo, ki bo vključevala krompir, virus in škodljivca. Krompirjev virus YNTN (PVYNTN), ki povzroča obročkasto nekrozo gomoljev krompirja (Solanumtuberosum L.) je razširjen po vsej Evropi, Severni Ameriki in celo v nekaterih delih Azije. Ker povzroča bolezenska znamenja tako na nadzemnih delih rastlin, kot tudi na gomoljih, znatno zmanjšuje količino in kakovost pridelka. Po drugi strani je koloradski hrošč najpomembnejši škodljivec krompirja v Evropi in Severni Ameriki. Rastline krompirja bodo najprej izpostavljene okužbi z virusom PVY in nato z ličinkami koloradskega hrošča, kot kontrolo pa bomo opazovali rastline v posamezni interakciji z virusom in škodljivcem. Poleg rastlin krompirja divjega tipa, bomo uporabili transgene linije krompirja, ki imajo bodisi spremenjene signalizacijske poti bodisi spremenjeno izražanje ključnih komponent obrambe.</p>\r\n\r\n<p>Profil izražanja genov bomo spremljali z uporabo sekvenciranja nove generacije in DNA mikromrež, ter PCR v realnem času. Znanje na nivoju transkriptoma bomo nadgradili s proteomskimi podatki. Za analizo podatkov bomo uporabili statistične modele, vse pridobljene podatke pa bomo skupaj z že prej dostopnimi podatki z bioinformatskimi orodji integrirali v izboljšane modele in hipotezo o tritrofičnih interakcijah. Izsledki naših raziskav bodo znatno premaknili način pojmovanja in dojemanja interakcij med rastlino in njenimi škodljivci in bodo tako vplivali na nadaljnje raziskave na tem področju kot tudi na razvoj biotehnoloških aplikacij.</p>\r\n",
            "end_date": "2014-06-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630891",
                    "ime": "Tomaž",
                    "priimek": "Curk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Vodja projekta na FRI"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2011-07-01 00:00:00",
            "title": "Kompromisi obrambe in razvoja v večtrofični interakciji med krompirjem in dvema glavnima škodljivcema"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>In nature plants must face numerous environmental factors, including attacks of viruses, bacteria, fungi and other pathogens. Understanding of the plant-pathogen interaction enables selection of efficient strategies for plant protection therefore several studies have been carried out in this direction, most of them in model plant Arabidopsis thaliana. Potato virus YNTN causing tuber ring necrosis disease of potato is spread all over Europe, North America and in some parts of Asia. Since it is causing symptoms on plantlets as well as on tubers, it diminishes the crop yield and significantly lowers its quality. Although it has been shown that different potato cultivars are differentially susceptible to the virus, the mechanisms underlying this difference has not been explicitly explained. Our previous research was aimed to find differences in gene expression between differentially sensitive cultivars response to PVY attack. Several genes that might be involved in resistance were identified. These are part of carbohydrates and secondary metabolism, signalization and degradation of proteins and cell wall components.</p>\r\n\r\n<p>We will apply functional genomics approach to get novel information on the roles of selected genes in defense response of potato plants following PVYNTN infection. Second goal of the project will be to address the topic of potato−PVY interaction from the perspective of small RNAs (sRNA). The presence of individual sRNAs will be determined by high−throughput cloning, next generation sequencing (NGS) and with other appropriate techniques. Specialized data analysis tools for the identification, annotation and quantification of novel sRNA sequences will be developed and additionally several bioinformatics tools already developed will be used. We will integrate the knowledge already available together with all data obtained from new experiments. For better interpretation and evaluation of integrated results, different visualization approaches (e.g. MapMan, SolCyc) will be used. A complex and systemic approach will enable us to gain a deeper insight in the potato−virus interaction and resistance responses between an important crop plant and its significant pathogen. Moreover, results of the project will give us the basis for identification of possible strategies for plant protection needed to breed virus resistant potato plants. Understanding of interaction will be potentially transferrable to other agriculturally important plants and will support novel strategies for protection of plants against pathogens.</p>\r\n",
            "end_date": "2014-06-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630891",
                    "ime": "Tomaž",
                    "priimek": "Curk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Vodja projekta na FRI"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2011-07-01 00:00:00",
            "title": "Functional genomics of potato-PVY interactions"
        },
        "id": 35,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>V naravi so rastline izpostavljene številnim okoljskim dejavnikom, ki vključujejo napade virusov, bakterij, gliv in ostalih patogenov. Razumevanje interakcije rastlina−patogen omogoča izbiro učinkovite strategije za zaščito rastlin, zato so bile v to smer izvedene številne študije, v večini na modelni rastlini Arabidopsis thaliana. Krompirjev virus YNTN, ki povzroča obročkasto nekrozo gomoljev krompirja, je razširjen po Evropi, Severni Ameriki in nekaterih delih Azije. Ker povzroča simptome na zelenih delih rastline in tudi gomoljih, zmanjšuje količino pridelka in njegovo kvaliteto. Pokazano je bilo, da so različne sorte krompirja različno občutljive na virus, vendar mehanizem teh razlik še vedno ni dokončno pojasnjen. Z našimi preteklimi raziskavami smo želeli odkriti spremembe v izražanju genov med kultivarji krompirja, različno občutljivimi na napad PVY. Identificirani so bili številni geni udeleženi v metabolizmu ogljikovih hidratov, sekundarnem metabolizmu, signalizaciji in razgrajevanju proteinov ter komponent celične stene ter tako pomembni za odpornost.</p>\r\n\r\n<p>Pomemben cilj predlaganega projekta je potrditev ali zavrnitev vloge posameznih genov v obrambnem odzivu krompirja po okužbi s PVYNTN z uporabo pristopa funkcijske genomike. Drugi cilj projekta bo obdelava interakcije krompir-PVY iz perspektive malih RNA (sRNA). Razvili bomo specializirana analitična orodja za detekcijo, pripis funkcij in kvantifikacijo novo odkritih majhnih RNA. Dodatne analize bomo izvedli z uporabo vrste že razvitih in prosto dostopnih bioinformatičnih orodij. Najpomembnejši cilj je integracija vseh dobljenih podatkov in njihovo ovrednotenje na višji ravni. Za interpretacijo podatkov bodo uporabljeni različni pristopi vizualizacije, kot so MapMan, SolCyc ali KeggPathway. Kompleksen in sistematski pristop nam bo omogočil poglobljeno vedenje o interakciji in odpornih odzivih pri ekonomsko pomembni poljščini in pomembnem patogenu. Nadalje bodo rezultati projekta služili kot osnova za identifikacijo možnih strategij za obvarovanje rastlin, potrebnih za vzgojo na virus odpornih sort krompirja. Razumevanje interakcije bo lahko preneseno tudi na druge agronomsko pomembne rastline in bo podpiralo razvoj novih strategij za zaščito rastlin pred patogeni.</p>\r\n",
            "end_date": "2014-06-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630891",
                    "ime": "Tomaž",
                    "priimek": "Curk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Vodja projekta na FRI"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2011-07-01 00:00:00",
            "title": "Funkcijska genomika interakcije med krompirjem in PVY"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>In 2006, hop growers in the Savinja valley reported the appearance of hop plants showing stunted vigor. Such symptoms were visible in various cultivars, showing the disease agents ability to affect different hop genotypes. Infected plants reached only up to 50% of normal height. Symptoms were even more severe the next year and affected plants eventually declined. It was confirmed that the disease was spreading around the first observed point of infection, suggesting agrotechnical practice as the most likely cause of transmission of the disease to healthy plants, although disease spread by means of insect vectors could not be ruled out. Infected planting material exchange between hop farmers has been confirmed as a source of new outbreaks over longer distances.</p>\r\n\r\n<p>The speed of spread and severity of this disease require quick action. In the proposed project, we aim to accomplish several tasks, which will subsequently allow prompt identification of the pathogen, by developing a method for its routine detection, comparing the transcriptome response of diseased and healthy plants and establishing guidelines for proper disease management.</p>\r\n\r\n<p>In order to identify the pathogen, we propose to use a combination metagenomic approach of sequence comparison and next generation sequencing technology (NGS), which will allow us to identify as yet unknown pathogens present in stunted hop plants. There have been several successful studies utilizing metagenomics coupled with NGS for the diagnostics of human, animal and plant diseases, which leads us to believe that this approach will allow prompt novel pathogen detection or show a synergistic infection of several pathogens. On the basis of the retrieved sequence, we will develop a diagnostic method for routine detection of the pathogen. We will then study the epidemiological characteristics of the disease, aimed at clarifying whether weed plant species present in hop gardens are possible reservoirs of the pathogen or contribute its spread, and whether the pathogen can spread in a hop garden by means of mechanical injuries to plants.</p>\r\n\r\n<p>In addition to identifying the pathogen(s), we propose to study differential gene expression in transcriptomes of three experimental groups. To understand the molecular mechanisms underlying host-pathogen interactions, it is necessary to identify the gene transcripts differentially expressed in infected and healthy plants. This study will be carried out using an RNA-seq analysis of the three described experimental groups and will include de novo assembly of the hop transcriptome. We anticipate that the proposed combination of metagenomic analysis of NGS data and RNA-seq studies will result in successful identification of the novel hop pathogen or explain the synergistic infection of several pathogens, while providing a detailed insight into the transcriptome of infected hop plants.</p>\r\n",
            "end_date": "2014-06-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630891",
                    "ime": "Tomaž",
                    "priimek": "Curk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Vodja projekta na FRI"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2011-07-01 00:00:00",
            "title": "Combination of next generation sequencing and metagenomic analysis in the diagnostics of severe hop stunting"
        },
        "id": 37,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Leta 2006 so pridelovalci hmelja v Savinjski dolini opazili pojav rastlin, ki so izražale izrazita znamenja zakrnelosti pri več sortah. Okužene rastline so dosegle le 50% normalne višine, kar se je stopnjevalo še v naslednjem letu in pripeljalo do popolnega propada. Opazovanja v okuženih nasadih so razkrila vzorec širjenja bolezni v smeri obdelave, kar nakazuje, da agrotehnični ukrepi v nasadu povzročajo širjenje na zdrave rastline, čeprav ne moremo izključiti možnosti prenosa bolezni z insekti ali ostalimi vektorji. Izmenjava okuženega sadilnega materiala med pridelovalci hmelja je povzročila nove izbruhe bolezni na ostalih območjih.</p>\r\n\r\n<p>Agresivnost in resnost opisane bolezni in hitrost njenega širjenja zahteva hitro ukrepanje. V predlogu tega projekta želimo izvesti več nalog, ki bodo omogočile hitro identifikacijo patogena, razvoj metode za njegovo rutinsko detekcijo, primerjati transkriptomski odgovor okuženih in neokuženih rastlin in izdelati smernice za pravilno ravnanje z boleznijo in za njeno omejitev.</p>\r\n\r\n<p>Za odkritje patogena predlagamo uporabo metagenomskega pristopa primerjave nukleotidnih zaporedij v povezavi z naslednjimi generacijami določevanja zaporedij (NGS). Tako bomo lahko identificirali neznane patogene prisotne v rastlinah hmelja, ki kažejo znake zakrnelosti. Do sedaj je bilo objavljenih več uspešnih primerov uporabe kombinacije NGS in metagenomike v diagnostiki bolezni ljudi, živali in rastlin, zato menimo, da bo ta postopek omogočal hitro identifikacijo patogena oz. pokazal sinergistično okužbo z večimi patogeni. Glede na identificirano zaporedje patogena bomo razvili metodo, ki bo omogočala njegovo rutinsko detekcijo. V nadaljevanju bomo preučili tudi epidemiološke značilnosti bolezni.</p>\r\n\r\n<p>Obenem z identifikacijo patogena imamo namen raziskati razlike v izražanju posameznih genov v transkriptomih treh skupin testnih rastlin. Za razumevanje mehanizmov odziva gostitelja na virusno okužbo na molekularnem nivoju je potrebno identificirati genske transkripte, ki se ob okužbi s povzročiteljem bolezni pojavljajo v višjem ali nižjem številu kot sicer. Za izvedbo te študije bomo izvedli RNA-seqanalizo opisanih vzorcev rastlin, ki bo vključevala tudi de novo zlaganje hmeljnega transkriptoma. Predpostavljamo, da bo v našem primeru predlagana kombinacija metagenomske analize NGS podatkov in RNA-seq študija privedla do uspešne identifikacije novega hmeljnega patogena ali pokazala sinergistično delovanje večih patogenov in nam hkrati omogočala natančen vpogled v bolezenski transkriptom hmeljne rastline.</p>\r\n",
            "end_date": "2014-06-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630891",
                    "ime": "Tomaž",
                    "priimek": "Curk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Vodja projekta na FRI"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2011-07-01 00:00:00",
            "title": "Uporaba kombinacije tehnike naslednje generacije določevanja nukleotidnih zaporedij in metagenomske analize v diagnostiki pojava hmeljeve zakrnelosti"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "The functioning of today’s society is based on collecting and analysing large amounts of data. Since the collection and storage of data have recently both become very cheap, it is not our usual practice to observe multiple small sets of carefully selected variables, but rather to routinely collect large quantities of measurements. This is true for all fields of work, from science - for example sequencing the whole genome and observing the activity of all of the genes at the same time - to the business world where, for example, we capture snapshots of share prices or market prices at short intervals. In principle, by observing large quantities of invariables, we would be able to discover more complex and unexpected patterns in data than before. In practice, however, such a large amount of data looks like a giant haystack and we lack efficient methods to look for needles in it, or even worse, to distinguish the needles from the hay. In more formal terms, the current methods for knowledge discovery from data find a large number of models and patterns which fit the data equally well. Even though most of them are random, it is impossible to distinguish them from real samples through mathematical methods. We believe that the problem is the current approach to knowledge discovery, which uses (only) data for constructing new theories – this is a bad practice, which has been called »data fishing«. So far, we have avoided the problems this type of approach causes by trying to find the simplest theories possible (e.g. by using linear models, various regulations, Occam's principle etc.). However, this is no longer possible for high-dimensional problems, because there are too many equally complex theories that fit the data equally well. In this project, we plan to investigate what we believe to be the only practical solution to the problem. Just as traditional science does not build theories from observation alone, the search for models, patterns and visualisations in automatic discovery of knowledge from data has to be based on already existing knowledge from that research area. This background knowledge can be in any type of form that describes the connections between variables, such as: ontology or network entities that correspond to variables, the correlation of variables from previous experiments, rules that are explicitly drawn up by an expert in the field or texts that are associated with the field and which enable us to statistically determine the connectedness between the variables. Background knowledge can be used throughout all of the phases of discovering knowledge. We intend to develop data transformation methods in this project, which will, for example, reduce the dimensionality of data by using background data to form new variables from the observed ones. This approach differs from the existing techniques for reducing dimensionality, which reduce data dimensionality through the data itself. We will develop visualisation methods that will construct useful and informative visualisations on the basis of existent knowledge. The construction of predictive models, especially with methods of machine learning, is based on the investigation of the vast space of possible models. This type of searching can be navigated by background knowledge of connections between variables. Finally, the existing knowledge can be used to select models and patterns from a vast set of models and samples, which fit the given data equally well. We will model our work on the contemporary methods of genetic data analysis - a field which has recently contributed the most towards overcoming the curse of dimensionality - and on statistical techniques for reducing dimensionality, as well as procedures for limiting searches in machine learning, which currently do not use background knowledge, at least not in the way we expect it to in this project. The developed methods will be implemented in open source packages for discovering knowledge from data and thus immediately available for practical use. Real time usage will also facilitate the testing and refinement of algorithms that will be developed in our project.",
            "end_date": "2016-07-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630891",
                    "ime": "Tomaž",
                    "priimek": "Curk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Vodja projekta na FRI"
                },
                {
                    "id": "630935",
                    "ime": "Matija",
                    "priimek": "Polajnar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630947",
                    "ime": "Anže",
                    "priimek": "Starič",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630897",
                    "ime": "Miha",
                    "priimek": "Štajdohar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630647",
                    "ime": "Martin",
                    "priimek": "Vuk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630917",
                    "ime": "Lan",
                    "priimek": "Žagar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630914",
                    "ime": "Jure",
                    "priimek": "Žbontar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2013-08-01 00:00:00",
            "title": "Conquering the Curse of Dimensionality by Using Background Knowledge"
        },
        "id": 42,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Delovanje današnje družbe temelji na zbiranju in analizi velikih količin podatkov. Ker sta se tako zbiranje kot hranjenje podatkov v zadnjem času zelo pocenili, navadno ne opazujemo več majhnih množic skrbno izbranih spremenljivk, temveč rutinsko zbiramo velike količine meritev. Tako ravnamo na vseh področjih, od znanosti z, na primer, sekvenciranjem celotnega genoma in opazovanja aktivnosti vseh genov hkrati, do poslovnega sveta, kjer, denimo, zajemamo posnetke cen delnic ali vrednosti tečajev v kratkih časovnih intervalih.</p>\r\n\r\n<p>Načelno naj bi bili z opazovanjem velike količine spremenljivk zmožni odkriti bolj zapletene in nepričakovane vzorce v podatkih kot prej. V praksi pa je tolikšna količina podatkov videti kot ogromna kopica sena, manjkajo pa nam učinkovite metode za iskanje igel oziroma, še huje, za razlikovanje igel od slame. Gledano formalneje, trenutno uporabljene metode za odkrivanje zakonitosti iz podatkov poiščejo veliko število modelov in vzorcev, ki se enako dobro prilegajo podatkom. Čeprav je večina od njih naključnih, jih je z matematičnimi metodami nemogoče razlikovati od resničnih vzorcev.</p>\r\n\r\n<p>Po našem mnenju je problem posledica trenutnega pristopa k odkrivanju zakonitosti, ki uporablja (le) podatke za sestavljanje novih teorij  slaba praksa, ki so jo nekoč poimenovali &quot;podatkovno ribarjenje&quot;. Doslej smo se težavam, ki jih povzroča ta pristop, izognili z iskanjem čim preprostejših teorij (npr. z uporabo linearnih modelov, različnih regularizacij, Occamovega načela ipd). V visoko dimenzionalnih problemih pa to ne deluje več, saj obstaja preveč enako zapletenih teorij, ki se enako dobro prilegajo podatkom.</p>\r\n\r\n<p>V okviru projekta nameravamo raziskovati, po našem mnenju, edino uporabno rešitev problema. Tako kot klasična znanost ne gradi teorij zgolj iz opazovanj, mora tudi iskanje modelov, vzorcev in vizualizacij v avtomatskem odkrivanju znanj iz podatkov temeljiti na obstoječem znanju iz raziskovanega področja. To predznanje je lahko v poljubni obliki, ki opisuje povezave med spremenljivkami, na primer ontologija ali mreža entitet, ki ustrezajo spremenljivkam, korelacije med spremenljivkami, ki so znane iz preteklih poskusov, pravila, ki jih eksplicitno sestavi področni strokovnjak, ali besedila, ki so povezana s področjem in s katerimi je mogoče statistično določiti povezanost spremenljivk.</p>\r\n\r\n<p>Predznanje lahko uporabimo v vseh fazah odkrivanja znanja. V projektu nameravamo razviti metode za transformacijo podatkov, ki bodo, recimo, zmanjšale dimenzionalnost podatkov tako, da bodo z uporabo predznanja sestavile nove spremenljivke iz opazovanih; ta pristop je drugačen od obstoječih tehnik zmanjševanja dimenzionalnosti, ki dimenzionalnost podatkov zmanjšuje s pomočjo podatkov samih. Razvili bomo vizualizacijske metode, ki bodo sestavljale uporabne in informativne vizualizacije na podlagi obstoječega znanja. Gradnja napovednih modelov, predvsem z metodami strojnega učenja, temelji na preiskovanju ogromnega prostora možnih modelov; tudi to iskanje lahko usmerjamo s predznanjem o povezavah med spremenljivkami. Končno, obstoječe znanje lahko uporabljamo za izbor modelov in vzorcev iz ogromne množice modelov in vzorcev, ki se enako prilegajo danim podatkom.</p>\r\n\r\n<p>Pri delu se bomo zgledovali po sodobnih metodah analize genetskih podatkov, področja, ki je v zadnjem času naredilo največ za premagovanje prekletstva dimenzionalnosti, ter s statističnimi tehnikami manjšanja dimenzionalnosti in postopki za omejevanje iskanja v strojnem učenju, ki trenutno ne uporabljajo predznanja, vsaj ne na način, kot ga predvidevamo v projektu.</p>\r\n\r\n<p>Razvite metode bodo implementirane v odprtokodnih paketih za odkrivanje znanja iz podatkov in tako takoj na voljo za praktično uporabo. Sprotna uporaba bo tudi olajšala testiranje in izpopolnjevanje algoritmov, ki jih bomo razvijali v okviru projekta.</p>\r\n",
            "end_date": "2016-07-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630891",
                    "ime": "Tomaž",
                    "priimek": "Curk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Vodja projekta na FRI"
                },
                {
                    "id": "630935",
                    "ime": "Matija",
                    "priimek": "Polajnar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630947",
                    "ime": "Anže",
                    "priimek": "Starič",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630897",
                    "ime": "Miha",
                    "priimek": "Štajdohar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630647",
                    "ime": "Martin",
                    "priimek": "Vuk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630917",
                    "ime": "Lan",
                    "priimek": "Žagar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630914",
                    "ime": "Jure",
                    "priimek": "Žbontar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2013-08-01 00:00:00",
            "title": "Premagovanje prekletstva dimenzionalnosti z uporabo predznanja"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>The major bottleneck in high-throughput genomics is data analysis. Modern biomedical laboratories can readily collect vast amounts of data from a variety of experimental platforms. The biomedical interpretation of the data usually begins with searches for promising subsets of genes, proteins or connections between them. The investigators then want to find existing ontologies and annotations, perform enrichment analyses, find similar experiments in local and in public databases, perform literature searches for related findings, carry out text mining on the results, cluster the outcomes using literature annotations, extract lists of associated genes, generate hypotheses and test them in the original data set.</p>\r\n\r\n<p>In this project we propose a pioneering next-generation bioinformatics data analysis framework that includes web-based applications, a visual programming environment and a scripting environment for integrative data analysis. We will develop it around our expertise in transcriptional data mining but with a vision of general applicability. The framework will allow biologists to perform sophisticated analysis tasks through visual analytics and interactive data exploration without knowledge in programming. It will also allow developers to use existing components to craft new procedures, and to integrate data and knowledge using only a few lines of code. The framework will be based on open source data mining suites and developed upon an innovative software architecture designed for speed, flexibility and simplicity. We will use FLASH programs for interactive web-applications, visual programming, data analytics and interactive visualization, server-based repositories of preprocessed data, and modern scripting languages.</p>\r\n",
            "end_date": "2012-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630891",
                    "ime": "Tomaž",
                    "priimek": "Curk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630917",
                    "ime": "Lan",
                    "priimek": "Žagar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": null,
                    "ime": "Gregor",
                    "priimek": "Rot",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2011-01-01 00:00:00",
            "title": "A next-generation analytics toolbox for integrated high-throughput genomic data analysis"
        },
        "id": 51,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Ozko grlo novih genomskih tehnologij je analiza podatkov. Moderni biomedicinski laboratoriji so sposobni pridobiti velike količine podatkov s pomočjo raznovrstnih eksperimentalnih platform. Biomedicinska interpretacija podatkov se običajno prične z iskanjem zanimivih podmnožic genov, proteinov ali povezav med njimi. Raziskovalci želijo te primerjati z obstoječimi anotacijami in ontologijami, izvesti analizo obogatenosti genskih oznak, poiskati podobne eksperimente javno dostopnih bazah, poiskati sorodne ugotovitve iz literature, razvrstiti izide glede na obstoječe anotacije v publikacijah, poiskati med seboj poveze genov, tvoriti hipoteze in te preveriti na prvotnih in novi eksperimentalnih podatkih.</p>\r\n\r\n<p>V projektu bomo razvili ogrodje nove generacije programske opreme za analizo podatkov, ki vključuje spletne bioinformatične aplikacije ter skriptno okolje in okolje z vizualnim programiranjem za celovito, integrativno analizo genomskih podatkov. Pri tem bomo uporabili našo ekspertizo in znanja s področja odkrivanja znanj iz podatkov, a z vizijo splošne uporabnosti v biomedicini. Ogrodje bo biologom omogočalo izvajanje naprednih analiz preko vizualne analitike in interaktivnega raziskovanja podatkov, brez posebnega potrebnega predznanja o programiranju. Prav tako bo razvijalcem omogočalo preko uporabe obstoječih komponent lažje sestavljati nove postopke in povezovati podatke in znanja s samo nekaj vrsticami programske kode. Ogrodje bo temeljilo na odprtokodnem programju in bo razvito na inovativni programski arhitekturi načrtovani z ozirom na hitrost, prilagodljivost in enostavnost. Projekt bo razvil in uporabil FLASH komponente za interaktivne spletne aplikacije, pristop vizualnega programiranja, podatkovno analitiko, interaktivne vizualizacije, strežniško skladišča predobdelanih podatkov in sodobne skriptne jezike.</p>\r\n",
            "end_date": "2012-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630891",
                    "ime": "Tomaž",
                    "priimek": "Curk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630917",
                    "ime": "Lan",
                    "priimek": "Žagar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": null,
                    "ime": "Gregor",
                    "priimek": "Rot",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2011-01-01 00:00:00",
            "title": "Analitična orodja nove generacije za integrirano analizo podatkov v sodobni genomiki"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>The long term goal of the proposed collaboration between Bioinformatics Lab at University of Ljubljana and Baylor College of Medicine in Houston is the discovery of entirely new drugs to treat bacterial infections. In the project we will craft new data fusion techniques that can simultaneously address gene prioritization and inference of gene networks. We will apply them to the problem of bacterial response in Dictyostelium, and package it within a visual programming data analytics toolbox to support its (re)use for the broad community of Dictyostelium researchers and beyond.</p>\r\n",
            "end_date": "2014-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630891",
                    "ime": "Tomaž",
                    "priimek": "Curk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630995",
                    "ime": "Marinka",
                    "priimek": "Žitnik",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2013-01-01 00:00:00",
            "title": "Computational approaches for identification of bacterial resistance pathways in Dictyostelium "
        },
        "id": 52,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Dolgoročni cilj predlaganega sodelovanja med Laboratorijem za bioinformatiko Univerze v Ljubljani in Baylor College of Medicine v Houstonu je odkritje novi učinkovin za zdravljenje bakterijskih infekcij. V okviru projekta razvijamo tehnike za zlivanje podatkov, s katerimi lahko sočasno analiziramo podatke iz različnih podatkovnih virov in na ta način tvorimo sezname kandidatnih genov in razkrivamo genske interakcije. Tehnike bomo uporabili na problemu razumevanje mehanizmov bakterijske odpornosti modelnega organizma Dictyostelium. Razvita orodja bomo objavili v odprti kodi ter jih preko grafičnega spletnega vmesnika ponudili v uporabo ostalim raziskovalnim skupinam.</p>\r\n",
            "end_date": "2014-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630891",
                    "ime": "Tomaž",
                    "priimek": "Curk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630995",
                    "ime": "Marinka",
                    "priimek": "Žitnik",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2013-01-01 00:00:00",
            "title": "Računski pristopi za odkrivanje mehanizmov baterijske rezistence v Dictyosteliumu"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "In everyday life, we prefer to make decisions by considering all the available information, and often find that the inclusion of even seemingly circumstantial evidence provides an advantage. In the natural sciences, incorporating all the data can be difficult, time consuming and imprecise, if even possible. We have recently developed a method for large¬scale data fusion. Our fundamental question is: can we improve the results of predictive data mining by fusing numerous, sometimes loosely related, heterogeneous datasets? In this bilateral project, we will use computational approach of data fusion to simultaneously consider all the available genome¬scale data sets for a social amoeba Dictyostelium. Integration will include gene expression data sets, data on protein binding, mutant phenotype data, data on gene annotations and pathway assignments, pathway ontologies, data on KEGG pathways, data on and chemicals and their structural properties, and data from the literature.",
            "end_date": "2016-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630891",
                    "ime": "Tomaž",
                    "priimek": "Curk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630718",
                    "ime": "Martin",
                    "priimek": "Stražar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630995",
                    "ime": "Marinka",
                    "priimek": "Žitnik",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2015-01-01 00:00:00",
            "title": "Data Fusion in Systems Biology of a Social Amoeba Dictyostelium"
        },
        "id": 65,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>V vsakodnevnem življenju ljudje sprejemamo odločitve tako, da skušamo pri tem upoštevati vse informacije, ki so nam na voljo. Mnogokrat nam pri tem pomagajo tudi podatki, ki so s predmetom odločanja povezani le posredno. V znanosti o življenju, kjer je zaradi tehnoloških prebojev v zadnji dekadi na voljo ogromno podatkov, nam povezovanje podatkov in njihova skupna uporaba predstavlja velik problem. Pred kratkim smo v Ljubljani razvili povsem nov postopek za združeno obravnavo heterogenih podatkovnih baz. Postavlja se vprašanje, ali lahko zlivanje podatkov na področju sistemske biologije bistveno izboljša kakovost napovednih modelov, ki jih iz podatkov lahko oblikujemo v namene odkrivanja novih znanj in razumevanja biologije? V tem interdisciplinarnem bilateralnem projektu bomo uporabili metodo za zlivanje podatkov, ki je bila nedavno razvita v sodelujočem Laboratoriju za bioinformatiko. Metoda temelji na sočasni tri&#172;faktorizaciji matrik in lahko zgradi skupen model iz potencialno zelo velike množice raznovrstnih podatkov. V projektu bomo tako gradili napovedne modele iz podatkov o genskih izrazih, vezavnih mestih proteinov, podatkih o fenotipu mutant, podatkih o genskih poteh, ontologijah genskih poti, metabolnih poteh, podatkih o kemijskih učinkovinah in njihovih strukturnih lastnostih in podatkih skritih v besedilih objavljenih v člankih.</p>\r\n",
            "end_date": "2016-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630891",
                    "ime": "Tomaž",
                    "priimek": "Curk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630718",
                    "ime": "Martin",
                    "priimek": "Stražar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630995",
                    "ime": "Marinka",
                    "priimek": "Žitnik",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2015-01-01 00:00:00",
            "title": "Zlivanje podatkov v sistemski biologiji socialne amebe Dictyostelium"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Fourier Transform Infrared Spectroscopy (FTIR) is a technique for collecting absorption or emission spectra of the observed specimen. It is particularly useful for microscopy, as it allows for detection of spectra measured in areas as small as 5 microns across, thus revealing the chemical composition within samples with high spatial resolution. The use of this technique ranges from tissue sample analysis (e.g. observing the effects of stroke on rat&#39;s brain), forensics, pharmaceutical analysis and quality control in general, material science and many others. There already exist several programs that are widely used in FTIR (bio)spectroscopy and imaging, but all are rather limited. Cytospec (www.cytospec.com) is a package that is good for spectral imaging, but it requires tricks for processing other types of datasets that would benefit from similar/same processing algorithms. These are time series measurements, non-spatially correlated datasets (for example many individual cells, where the spectrum variations are interesting, but the position of the cell is not followed). On the opposite, the Unscrambler is widely used as a statistical analysis software with many nice and robust features, but it is not useful for spectroscopic imaging. Spectrometer manufacturer software usually handles their own file formats; the features and performance of these programs is not always the best as they are mostly aimed to do the measurement itself. Another feature of this software is its high cost. Within our collaboration, we are developing an application that will combine the features of the commonly used software within an open source software that will be free to use for everyone. The project will thus benefit many research groups and companies. The primary users are any synchrotrons with IR beamlines and their immediate user community: Diamond (UK), Soleil (France), ALBA (Spain), BESSY II (Germany), ELETTRA (Italy), ANKA (Germany), Daphne (Italy), ESRF (France), MLS (Germany), DESY (Germany), each about 20-50 user groups per year, which makes hundreds of groups interested. Then in the second shell, since the technique itself is not synchrotron limited the whole FTIR user community will be interested, which is on the order of 1000s in Europe. Finally, providing the file importer function for other instrument manufacturer/technique and the processing functions will extend its use to techniques include near IR imaging (from food industry to satellites), Raman spectromicroscopy, etc. The project is based on the existing open-source data mining platform Orange, developed at the University of Ljubljana. Its data-flow architecture is intuitive and easy to use, and it also allows for combining the specialized components, developed within this project, with the existing components for data processing, visualization and data mining. The two groups are complementary and cover the necessary expertise. The Slovenian partner has two decades of expertise in development of similar software for data mining, and the French partner is the user of such software with plenty of expertise about the methods that need to be incorporated in it. Project plan outline - Implementation of import/export functions for single spectra and maps for OPUS, OMNIC, Txt and ENVI (May 2016) - Plotting functions for spectra and maps (July 2016) - Peak picking and pixel selection/extraction from map (July 2016) - Implementation of spectral correction base algorithms such as baseline, scattering, offset, and base spectral manipulation functions such as normalization, derivation and smoothing (October 2016) - Implementation of advanced spectral manipulation tools, such as multiple types of baseline options, peak fitting, deconvolution, Mie scattering, water subtraction, etc. (January 2017) - Modification and implementation of multivariate spectral analysis tools as, HCA, PCA and PCA-LDA, PLS regression and multivariate curve resolution (April 2017) - Optimization for large data (September 2017) - Parallelization of algorithms (December 2017) - Adaptation of developed features for other spectroscopic mapping techniques (January 2018) - Development of wrapper functions for spectroscopic tomography reconstruction algorithms (May 2018) - Bug fixing and setting up long term support (September 2018)</p>\r\n",
            "end_date": "2018-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630947",
                    "ime": "Anže",
                    "priimek": "Starič",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630718",
                    "ime": "Martin",
                    "priimek": "Stražar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630669",
                    "ime": "Vesna",
                    "priimek": "Tanko",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2017-01-01 00:00:00",
            "title": "Development of an open-source platform for multivariate analysis of FTIR data "
        },
        "id": 372,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Infrardeča spektroskopija s Fourierovo transformacijo (Fourier Transform Infrared Spectroscopy, FTIR) je tehnika zbiranja absorbcijskih ali emisijskih spektrov opazovanih vzorcev. Posebej uporabna je za mikroskopijo, saj omogoča opazovanje spektrov izmerjenih na zelo majhnih regijah (tudi do 5 mikronov), s čimer lahko opazujemo kemično sestavo vzorcev z veliko prostorsko ločljivostjo. Uporaba te tehnike je raznolika, od analize tkiv (npr. opazovanje posledic kapi v možganih podgan), forenziki, farmaciji, kontroli kvalitete, znanosti o materialih in na številnih drugih področjih. Obstoječa programska oprema za analizo podatkov pridobljenih s FTIR je omejena. Cytospec (www.cytospec.com) je primeren za spektralno analizo slik, njegova uporaba na drugačnih podatkih, primernih za obdelavo s temi metodami, pa je možna le z uporabo zahtevnejših trikov. Primeri takšnih podatkov so meritve časovnih vrst in podatki z neprostorskimi korelacijami (npr. večje število posamičnih celic, pri katerih nas zanimajo spremembe spektra, pozicija celic pa ni znana). Za razliko od Cytospeca je Unscrambler pogosto uporabljan kot orodje za statistično analizo s številnimi prikladnimi in robustnimi funkcijami, ni pa primeren za spektroskopske slike. Programska oprema, ki jo prilagajo proizvajalci spektrometrov, običajno zahteva specifične oblike datotek; funkcije in učinkovitost delovanja teh programov pogosto nista zadostna, saj so večinoma namenjeni le zajemu in osnovni obdelavi meritev. Dodatna omejitev te programske opreme je njihova visoka cena. V sklopu sodelovanja razvijamo programsko opremo, ki bo združevala lastnosti pogosto uporabljene opreme, poleg tega pa bo na voljo za brezplačno uporabo. Rezultate projekta bodo lahko izkoriščale številne raziskovalne skupine in podjetja. Osnovni uporabniki so sinhrotronski pospeševalniki z IR žarki in njihove neposredne stranke: Diamond (VB), Soleil (Francija), ALBA (Španija), BESSY II (Nemčija), ELETTRA (Italija), ANKA (Nemčija), Daphne (Italija), ESRF (Francija), MLS (Nemčija). Vsako od teh ustanov letno obišče 20-50 skupin, torej je potencialnih uporabnikov stotine. Drugi krog uporabnikov so drugi raziskovalci, ki uporabljajo FTIR, vendar kot vir svetlobe ne uporabljajo pospeševalnikov, saj programska oprema ne bo specializirana za posamezen svetlobni izvor; takšnih potencialnih uporabnikov je v Evropi tisoče. Končno, z omogočanjem branja podatkov v drugih oblikah bo razvita programska oprema uporabna tudi v spektroskopiji z bližnjo infrardečo (near infrared) svetlobo, Ramanov spektromikroskopiji ipd. Projekt temelji na obstoječi odprtokodni platformi Orange, ki jo razvija Laboratorij za bioinformatiko Fakultete za računalništvo in informatiko Univerze v Ljubljani. Njegov uporabniški vmesnik, s katerim uporabnik sestavlja pretok podatkov, je intuitiven in se ga je lahko naučiti, obenem pa bo omogočal sestavljanje specializiranih komponent, razvitih v okviru projekta, z obstoječimi splošnimi komponentam za procesiranje podatkov, vizualizacijo in podatkovno rudarjenje. Skupini sta komplementarni in pokrivata različna področja. Slovenski partner ima dve desetletji izkušenj z razvojem podobne programske opreme za podatkovno rudarjenje, francoski partner pa je uporabnik te programske opreme z veliko izkušnjami z metodami, ki jih mora takšna oprema vsebovati. Okvirni načrt izvedbe - Funkcije za branje in zapis podatkov posamičnih spektrov in slik za OPUS, OMNIC, Txt in ENVI (maj 2016) - Izris spektrov in slik (julij 2016) - Izbor vrhov v spektrih ter točk in regij na slikah (julij 2016) - Algoritmi za korekcijo izmerjenih spektrov in osnovno manipulacijo s spektri (normalizarcija, odvajanje, glajenje) (oktober 2016) - Napredni algoritmi za manipulacijo (umerjenje vrhov, dekonvolucija, Mie, odstranjevanje vode) (januar 2017) - Adaptacija in programiranje orodij za multivariatno analizo (HCA, PCA, PCA-LDA, PLS) (april 2017) - Optimizacija za velike količine podatkov (september 2017) - Pospeševanje algoritmov z vzporednim računanjem (december 2017) - Prirejanje razvite aplikacije za druge metode spektroskopije (januar 2018) - Razvoj funkcij za spektroskopsko tomografijo (maj 2018) - Odpravljanje napak in vzpostavitev dolgoročne podpore (september 2018)</p>\r\n",
            "end_date": "2018-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630947",
                    "ime": "Anže",
                    "priimek": "Starič",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630718",
                    "ime": "Martin",
                    "priimek": "Stražar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630669",
                    "ime": "Vesna",
                    "priimek": "Tanko",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2017-01-01 00:00:00",
            "title": "Razvoj odprtokodneprogramske opreme za multivariantno analizo podatkov FTIR"
        }
    },
    {
        "en": {
            "client": "Ministrstvo za javno upravo",
            "description": null,
            "end_date": "2018-09-26 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630620",
                    "ime": "Niko",
                    "priimek": "Colnerič",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630676",
                    "ime": "Ajda",
                    "priimek": "Pretnar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630947",
                    "ime": "Anže",
                    "priimek": "Starič",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Vodja projekta"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": null,
            "start_date": "2017-09-26 00:00:00",
            "title": "Izdelava gradiva in izvedba usposabljanj"
        },
        "id": 489,
        "si": {
            "client": "Ministrstvo za javno upravo",
            "description": null,
            "end_date": "2018-09-26 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630620",
                    "ime": "Niko",
                    "priimek": "Colnerič",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630676",
                    "ime": "Ajda",
                    "priimek": "Pretnar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630947",
                    "ime": "Anže",
                    "priimek": "Starič",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Vodja projekta"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": null,
            "start_date": "2017-09-26 00:00:00",
            "title": "Izdelava gradiva in izvedba usposabljanj"
        }
    }
]