[
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Coronary heart disease (CHD) is one of the world&#39;s most frequent causes of mortality and an important problem in medical practice. It is disease where one, two or all three coronary arteries are narrowed or obstructed mainly by atherosclerotic plaque(s). The consequence is diminished blood supply causing diminished oxygen supply of the dependent region of the myocardium, manifesting as angina pectoris. The most extreme consequences are myocardial infarction and cardiac death.</p>\r\n<p>The object of project is collaboration in deployed plaque characterization algorithms and the patient-specific prediction model which can be enhanced with knowledge accumulated by heterogeneous data and resources. Blood element concentrations (e.g. LDL/HDL), patient medical condition (e.g. diabetic, hypertension), and patient habitual behavior (e.g. smoking/no smoking, exercising/no exercising) will be correlated with features extracted from patients medical images (e.g. MRI) and used for plaque characterization. The corresponding data will be situated in different repositories and even different systems. Both research groups will implement the treatment support system that will improve quality of medical services by providing cardiologists with suggestions on the best possible treatment scenario. The high-end expert system has a potential of application in medical practice (cardiology).</p>\r\n",
            "end_date": "2011-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630864",
                    "ime": "Zoran",
                    "priimek": "Bosnić",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630309",
                    "ime": "Igor",
                    "priimek": "Kononenko",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630511",
                    "ime": "Matjaž",
                    "priimek": "Kukar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630934",
                    "ime": "Darko",
                    "priimek": "Pevec",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630533",
                    "ime": "Marko",
                    "priimek": "Robnik Šikonja",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630898",
                    "ime": "Erik",
                    "priimek": "Štrumbelj",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2010-01-01 00:00:00",
            "title": "Integration of data mining and high-performance computer modeling for coronary artery disease"
        },
        "id": 53,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Srčno-žilne bolezni so v svetovnem merilu najpogostejši dejavnik smrtnosti in pomemben problem v zdravstveni praksi. So skupina bolezni, pri katerih nastopi zožanje ali nabiranje aterosklerotičnega plaka ene, dveh ali vseh treh koronarnih arterij. Zaradi zmanjšanega pretoka krvi pride do zmanjšane oskrbe srčne mišice s kisikom, posledica česa nastopi angina pectoris. Kot najhujši možni nadaljnji posledici lahko nastopita tudi srčni infarkt in srčna smrt. V okviru projekta se bo znanje o srčno-žilnih boleznih, pridobljeno iz različnih podatkovnih virov, oplemenitilo z tehnikami karakterizacije aterosklerotičnega plaka za posamezne paciente. Različni podatki iz krvne slike (npr. LDL/HDL), zdravstveno stanje (npr. prisoten diabetes, visok pritisk) in vedenje (kadilec/nekadilec, stopnja gibanja, ipd.) bodo v okviru projekta povezani s podatki, pridobljenimi iz medicinskih slik (npr. magnetna resonanca) in uporabljeni za karakterizacijo plaka. Raziskovalni skupini bosta implementirali sistem za podporo detekcije in zdravljenja srčno-žilnih bolezni, ki bo pomagal izboljšati zdravstvene storitve s svetovanjem strokovnjakov o najboljšem možnem načinu zdravljenja. Visokozmogljiv ekspertni sistem ima potencial uporabe v zdravniški praksi (kardiologija).</p>\r\n",
            "end_date": "2011-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630864",
                    "ime": "Zoran",
                    "priimek": "Bosnić",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630309",
                    "ime": "Igor",
                    "priimek": "Kononenko",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630511",
                    "ime": "Matjaž",
                    "priimek": "Kukar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630934",
                    "ime": "Darko",
                    "priimek": "Pevec",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630533",
                    "ime": "Marko",
                    "priimek": "Robnik Šikonja",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630898",
                    "ime": "Erik",
                    "priimek": "Štrumbelj",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2010-01-01 00:00:00",
            "title": "Integracija odkrivanja zakonitosti v podatkih in visoko-zmogljivega računalniškega modeliranja srčno-žilnih bolezni"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>An important task of the electricity distribution companies is to forecast the electrical load (demand) for a given sub-network of consumers, as this is a relevant for identification of critical points and making decisions to buy or sell energy. From a data mining perspective, this problem is characterized by a large number of variables (data from the electrical sensors), produced in a continuous flow in a dynamic non-stationary environment. Standard prediction techniques in such circumstances fail and more complicated dynamic models are required  models that evolve over time and are able to adapt to changes in the distribution generating examples. Besides only forecasting the electricity load, the prediction should also contain an explanation of the phenomenon and the quality of the predictor must be clearly assessed with prediction reliability estimates in order to support users final decision.</p>\r\n\r\n<p>In the framework of the project, the both research groups will aim to develop decision explanation methodology for concept drift detection in data stream learning, develop and test reliability estimates suitable for data streams, develop online summarization techniques for electrical time series, and study the utility of reliability estimates and decision explanations in data streams. The deliverables will ensure better predictions and robust decisions in electrical network management.</p>\r\n",
            "end_date": "2011-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630864",
                    "ime": "Zoran",
                    "priimek": "Bosnić",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630309",
                    "ime": "Igor",
                    "priimek": "Kononenko",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630511",
                    "ime": "Matjaž",
                    "priimek": "Kukar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630934",
                    "ime": "Darko",
                    "priimek": "Pevec",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630533",
                    "ime": "Marko",
                    "priimek": "Robnik Šikonja",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630898",
                    "ime": "Erik",
                    "priimek": "Štrumbelj",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2010-01-01 00:00:00",
            "title": "Electricity load forecasting supported by prediction explanation and prediction reliability estimates"
        },
        "id": 55,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Pomembna naloga elektrodistribucijskih podjetij je napovedovanje porabe električne energije za posamezne množice uporabnikov, kar je pomembno za ugotavljanje kritičnih točk v omrežju in odločanje o uvozu in izvozu električne energije. S stališča umetne inteligence (analize podatkov) je ta kompleksen problem odvisen od velikega števila spremenljivk (podatki električnih senzorjev), podatki pa se generirajo zelo hitro in v neprekinjenih tokovih  gre torej za izrazito dinamično okolje. Standardne tehnike napovedovanja zato v takšnih okoliščinah odpovejo, saj so potrebni bolj dinamični modeli, ki se lahko spreminjajo s časom in se lahko prilagajajo terminom različne rabe električne energije (dan, noč, vikendi, prazniki, ipd.). Poleg napovedovanja porabe električne energije, je pomembno, da so same napovedi opremljene tudi z razlago napovedi in oceno zanesljivosti napovedi. Na podlagi zadnjih dveh se uporabniki lahko lažje dokončno odločijo o energetskih in finančnih ukrepih.</p>\r\n<p>V okviru projekta bosta obe skupini razvili metodologijo za razlago napovedi o spremembi profilov v električni porabi, razvili in testirali ocene zanesljivosti, primerne za uporabo v podatkovnih tokovih in razvili tehnike učenja iz časovnih vrst podatkov o električni porabi za natančno modeliranje in napovedovanje. Rezultati raziskovanja bodo omogočili boljše in robustnejše napovedovanje v električnih omrežjih.</p>\r\n",
            "end_date": "2011-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630864",
                    "ime": "Zoran",
                    "priimek": "Bosnić",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630309",
                    "ime": "Igor",
                    "priimek": "Kononenko",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630511",
                    "ime": "Matjaž",
                    "priimek": "Kukar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630934",
                    "ime": "Darko",
                    "priimek": "Pevec",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630533",
                    "ime": "Marko",
                    "priimek": "Robnik Šikonja",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630898",
                    "ime": "Erik",
                    "priimek": "Štrumbelj",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2010-01-01 00:00:00",
            "title": "Napovedovanje porabe električne energije, podprto z razlago in oceno zanesljivosti napovedi"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>An important group of methods solving these problems is based on constructing ensembles of base learners.  Bagging, boosting, random forests, and their variants are the most popular examples of this methodology and due to their classification strength and efficiency they belong to the state-of-the-art methods in classification and regression. When constructing an efficient prediction model these methods evaluate the predictive power of descriptive attributes and construct recursive partitioning of the problem space. The aim of our cooperation is to develop and test a new class of distance-based and uniform distribution based attribute evaluation measures which are better suited to the problem of imbalanced class distribution. Additionally we will investigate their multiclass extensions. For testing the proposed methods we will design complex artificial data sets for testing wide range of types of configurations of regions with different classification. The developed attribute evaluation measures will be used in state-of-the-art learning system based on random forests.</p>\r\n<p>The above scientific goals need fast and efficient data mining algorithms and good exploratory data analysis tools. In data mining community the open-source R statistical environment is getting more and more attention for its wide applicability, availability, ease of use and good visualization capabilities. It is our aim in this project to develop new machine learning algorithms in this environment and therefore make it ready available for further scientific and commercial exploitation.</p>\r\n<p>We are expecting that this joint research proposal will produce valuable research and practical results that will be of interest to the data mining and machine learning community and practitioners solving complex problems involving imbalanced data sets, e.g., in medicine, engineering, finance, public sector, etc.</p>\r\n",
            "end_date": "2011-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630864",
                    "ime": "Zoran",
                    "priimek": "Bosnić",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630309",
                    "ime": "Igor",
                    "priimek": "Kononenko",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630511",
                    "ime": "Matjaž",
                    "priimek": "Kukar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630934",
                    "ime": "Darko",
                    "priimek": "Pevec",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630533",
                    "ime": "Marko",
                    "priimek": "Robnik Šikonja",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630898",
                    "ime": "Erik",
                    "priimek": "Štrumbelj",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2010-01-01 00:00:00",
            "title": "Machine learning of imbalanced data"
        },
        "id": 56,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Namen sodelovanja je razvoj in testiranje nove skupine metod za ocenjevanje atributov, ki temelji na merah razdalje in uniformnosti predhodne porazdelitve. Ta novi pristop se je v preliminarnih študijah izkazal kot izredno perspektiven za probleme z neuravnoteženimi podatki. Razvili bomo več osnovnih cenilk atributov in njihove večrazredne posplošitve. Za namene testiranja bomo konstruirali kompleksne umetne domene, kar nam bo omogočilo preveriti širok spekter delovanja razvitih metod. Najuspešnejše med razvitimi metodami bomo implementirali v okviru že razvitega uspešnega učnega sistema temelječega na naključnih gozdovih. Pristope bomo testirali tudi na praktičnih problemih v medicini in financah.</p>\r\n<p>Za praktično uporabnost navedenih znanstvenih ciljev je potrebno razviti hitre in učinkovite algoritme in dobra orodja za podatkovno analizo. Med znanstveniki in uporabniki tehnik podatkovnega rudarjenja se je uveljavilo odprtokodno statistično okolje R, predvsem zaradi široke uporabnosti, preprostosti uporabe in dobrih možnosti vizualizacije. V okviru projekta nameravamo razviti metode v tem okolju in tako omogočiti njihovo takojšnjo znanstveno in komercialno rabo. Pričakujemo, da bodo skupni napori prinesli pomembna spoznanja, ki bodo praktično in znanstveno pomembna za področje napredne analize podatkov in reševanja neuravnoteženih klasifikacijskih problemov, še posebej v medicini, financah, javnem sektorju, strojništvu in tehnologiji.</p>\r\n",
            "end_date": "2011-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630864",
                    "ime": "Zoran",
                    "priimek": "Bosnić",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630309",
                    "ime": "Igor",
                    "priimek": "Kononenko",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630511",
                    "ime": "Matjaž",
                    "priimek": "Kukar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630934",
                    "ime": "Darko",
                    "priimek": "Pevec",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630533",
                    "ime": "Marko",
                    "priimek": "Robnik Šikonja",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630898",
                    "ime": "Erik",
                    "priimek": "Štrumbelj",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2010-01-01 00:00:00",
            "title": "Strojno učenje neuravnoteženih podatkov"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "Cancer research is currently one of the leading fields of clinical research. One major issue in this field is cancer classification for accurate diagnosis and treatment and the other is utilizing an increasing amount of microarray raw data available. Up to now, majority of cancer classification studies were based on the patients overall clinical picture including histological findings at the tissue level. Thus, with very limited diagnostic precision. This is because many existing tumor classes are heterogeneous, molecularly distinct and follow different clinical courses. Therefore, a differential diagnosis among a group of histologically similar cancers poses a challenging problem in clinical medicine. At the same time, an extensive use of DNA microarray technology for characterization of cellular processes is leading to an increasing amount of microarray data from cancer studies. Even though similar questions are being addressed in different studies of same cancer type a comparative analysis of their results is encumbered by the use of heterogeneous microarray platforms and analysis methods. Hence, today, there exists a tremendous amount of array data available; however, much of it remains as raw and only a small percent of its potential is being utilized. Cancer classification based on gene expression analysis derived from microarray data is a way to utilize this raw data in order to get the most accurate cancer diagnosis. Such cancer classification promises to have higher specificity in cancer differentiation as well as an improved clinical picture which addresses molecular changes in diseased leading to personalized therapy with lower toxic side effects. Current approaches to gene-based cancer classifications use the data about different exon mutations from public databases where the exact classification is possible if for a new patient the exact match is found in a database. Due to combinatorial nature of all possible mutations a controled sampling of combinations of mutations is neccessary that takes into account known parts of distributions which can be derived from databases. Due to lack of different combinations of mutations in databases, the classification of new patients without exact match can be done only probabilisticaly. In addition, the reliability of single classification of such probabilistic approach is highly important, as well as its explanation which can provide the end-user (physician) with additional insight in the decision process. The task of the project is to prepare an experimental data set describing patients with known cancer type and known exon mutations, to supplement this databases with negative examples (healthy patients) and additionally enhance it using the controlled sampling. Such enchaced database will be analysed with machine learning algorithms. In particular, the feature evaluation techniques will be used to study the importance of particular parts of exons and the interaction of multiple mutations. Further, the database will be analysed with ILP (inductive logic programming) algorithms which are capable of inducing logical relations between objects and therefore discover interesting relationships among different mutations. During the project. the ILP algorithms will be adapted by LKM (Laboratory for Cognitive Modeling) for the target problem. Besides ILP, the state-of-the-art machine learning algorithms will be used, such as SVM, random forests, neural networks and their ensebles, in order to obtain as much accurate classification as possible. The developed models will be equipped with explanation of single predictions as well as the reliabiliy of provided classifications. The methodology for evaluating the reliability of single predictions, developed by LKM in recent years, will be adapted for this problem. Also, the state-of-.the-art methodology for providing the explanations of single predictions, developed by LKM, will be adapted for this type of classification.",
            "end_date": "2015-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630864",
                    "ime": "Zoran",
                    "priimek": "Bosnić",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630970",
                    "ime": "Miha",
                    "priimek": "Drole",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630309",
                    "ime": "Igor",
                    "priimek": "Kononenko",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630511",
                    "ime": "Matjaž",
                    "priimek": "Kukar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630533",
                    "ime": "Marko",
                    "priimek": "Robnik Šikonja",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2014-01-01 00:00:00",
            "title": "Computer based modeling in bioinformatics for gene based cancer classification focused on reliability and machine learning"
        },
        "id": 61,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Področje raziskav rakavih obolenj je trenutno eno izmed najdejavnejših področij kliničnih raziskav. Sooča se z dvema večjima težavama. Prva težava je klasifikacija rakavih obolenj z namenom določanja točne diagnoze ter ustreznega zdravljenja. Drugo težavo predstavlja vprašanje, kako stalno rastočo količino podatkov iz mikromrež učinkovito uporabiti za reševanje odprtih vprašanj na tem področju. Večina dosedanjih študij s področja klasifikacije rakavih obolenj je osnovanih na podlagi splošnih kliničnih slik pacientov, v katere so zajeti tudi histološki pojavi na nivoju tkiv. Točnost podanih diagnoz je iz tega razloga nizka. Mnogi obstoječi razredi tumorjev so namreč heterogeni, molekularno različni in zahtevajo različno klinično obravnavo. Diferencialna diagnoza znotraj neke skupine histološko podobnih rakavih obolenj tako predstavlja pomemben izziv v klinični medicini.</p>\r\n<p>V zadnjem času se je močno razširila uporaba DNA mikromrež za opredelitev celičnih procesov. S tem postaja dostopnih vse več podatkov iz mikromrež, zajetih pri raziskavah povezanih z rakom. Različne raziskave istih tipov rakavih obolenj sicer poskušajo odgovoriti na podobna vprašanja, vendar je njihova primerjava otežkočena zaradi uporabe heterogenih platform mikromrež ter metod, uporabljenih pri analizi. Trenutno so tako na voljo ogromne količine podatkov iz mikromrež, ki pa zvečine ostajajo neobdelane in je izkoriščen le majhen delež njihovega potenciala. Podatke o ekspresiji genov, pridobljene iz mikromrež, bi bilo mogoče z analizo uporabiti za kar čim bolj točno diagnozo rakavih obolenj. Klasifikacija obolenj na tej osnovi potencialno nudi višjo specifičnost v razlikovanju različnih rakavih obolenj in boljšo klinično sliko, ki zajema tudi molekularne spremembe v bolnikih, kar vodi do posamezniku prilagojene terapije z manjšimi nezaželenimi stranskimi učinki. Trenutni pristopi k klasifikaciji rakavih obolenj na podlagi genov uporabljajo podatke o različnih mutacijah eksonov iz javno dostopnih baz. Pri njihovi uporabi je klasifikacija obolenja nekega novega pacienta možna le, kadar je primerek z identično mutacijo prisoten tudi v uporabljeni bazi. Zaradi kombinatorične narave količine vseh mogočih mutacij je te potrebno vzorčiti z ozirom na njihovo distribucijo v dostopnih bazah podatkov. Ker se nekatere izmed možnih kombinacij mutacij v bazah sploh ne pojavijo, mora postati klasifikacija novih pacientov, za katere v bazi ni identičnega vnosa, verjetnostna. Pri tem sta izjemno pomembni tako zanesljivost posamezne klasifikacije kot tudi razlaga končne odločitve, ki uporabniku (zdravniku) nudi dodaten vpogled v proces odločanja.</p>\r\n<p>Cilj projekta je pripraviti eksperimentalno podatkovno zbirko. Predlagana zbirka bo poleg vnosov o pacientih z znanim tipom rakavega obolenja in mutacijami eksona vsebovala tudi negativne primere (tj. zdrave paciente), ter bo s pomočjo nadzorovanega vzorčenja dopolnjena z dodatnimi vnosi. Tako nadgrajena podatkovna zbirka bo analizirana z uporabo algoritmov strojnega učenja. Metode za ocenjevanje značilk bodo uporabljene za določanje pomembnosti posameznih delov eksonov in odkrivanje interakcij med mutacijami. Zgrajena baza bo nadaljnje analizirana z algoritmi induktivnega logičnega programiranja (ILP), ki so zmožni odkrivanja logičnih relacij med objekti in s tem zanimivih odnosov med različnimi mutacijami. Kot del projekta bodo algoritmi ILP prilagojeni za uporabo na konkretnem primeru s strani Laboratorija za kognitivno modeliranje (LKM). Z namenom zagotavljanja čim višje točnosti klasifikacije bodo poleg metod ILP uporabljeni tudi drugi sodobni pristopi v strojnem učenju, kot so metoda podpornih vektorjev (SVM), naključni gozdovi, nevronske mreže in njihovi ansambli. Razviti modeli bodo nadgrajeni z možnostjo razlage posamezne napovedi ter oceno njene zanesljivosti. V ta namen bosta prilagojeni metodologiji za ocenjevanje zanesljivosti posameznih predikcij in njihovih razlag, ki sta bili v zadnjih letih razviti v LKM.</p>\r\n",
            "end_date": "2015-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630864",
                    "ime": "Zoran",
                    "priimek": "Bosnić",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630970",
                    "ime": "Miha",
                    "priimek": "Drole",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630309",
                    "ime": "Igor",
                    "priimek": "Kononenko",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630511",
                    "ime": "Matjaž",
                    "priimek": "Kukar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630533",
                    "ime": "Marko",
                    "priimek": "Robnik Šikonja",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2014-01-01 00:00:00",
            "title": "Računalniško modeliranje v bioinformatiki za gensko klasifikacijo raka s poudarkom na zanesljivosti in strojnem učenju"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "Recently, special attention of machine learning community has been given to realworld classification problems with imbalanced class distribution or with classes where misclassifications cost varies significantly. For example, in medical diagnosis typically a rather small number of patients have some critical diagnoses (illnesses), however an incorrect diagnosis can have fatal consequences in cases where an ill patient is proclaimed healthy. The classical classification approaches (when classes are approximately balanced or when we have equal misclassification costs for all classes) are not applicable in such cases as they tend to maximize the classification accuracy and therefore the instances from minority class are treated by those approaches as noisy instances. Yet, what we want to achieve is to minimize the number of misclassified cases from the minority class while keeping the relatively high overall classification accuracy (or we want to minimize the overall misclassification cost). For that purpose a different approaches were developed which may either include in the algorithm itself the misclassification cost, or the modifications of the algorithm in order to focus more on cases from the minority class, or to use various techniques to modify the training set appropriately, such as oversampling of the minority class cases or undersampling of the majority class cases. Also, hybrid approaches are also becoming popular. One of the civilization responsibilities is the need for increasing the quality of life for blind and weaksighted people using the modern technology. Daily activities which for healthy subjects seem to be trivial, such as finding the required destination, using various objects, safe navigation through complex paths, recognizing the local environment and an appropriate orientation in it, contextual comprehension of the environment etc. are much demanding and often unsolvable tasks for blind or weaksighted subject. Most of the approaches to solve those problems are based on GPS technology combined with inertial sensors and cameras. The most common problems with those approaches are the following. The GPS technology has a limited accuracy in urban areas, especially in the areas close to building due to multiple signal reflections. This may cause that a blind person assumes he or she is located at the sidewalk while standing in the middle of the road. This problem can be reduced using inertia sensors, however using the approach of identifying a small number of deviations of two different systems, which transforms the original problem onto the problem of classification of data with imbalanced classes. Cognitive understanding of environment, recognition of objects and avoiding the obstacles is relatively successfully solved using approaches that combine cameras, visual markers or RFID sensors, and WiFi receivers, however, this is applicable only in controlled environments and outside those the usability is much limited. A basic limitation is information complexity of unmarked environments which can be avoided by providing a small number of useful data with respect to the current position, orientation and activity that a blind or weaksighted subject wants to perform (such as crossing the road). This problem can also be transformed into a problem of dealing with imbalanced data. Therefore, there is a need to try to use the existing methods as well as to develop new algorithms for supervised as well as unsupervised machine learning for this kind of problems. This becomes even more interesting if the system includes the data from GIS. In this context we emphasize the movement through usual paths with pointing to some important objects on the path (such as a restaurant, library, store etc.). However, this is even more important on unknown paths where at the beginning only starting and end point are known. We expect that the use of machine learning methods, i.e. supervised and unsupervised learning on imbalanced datasets with combination of GPS, inertia sensors, cameras and an audiorendering system, will successfully solve the described problems when using the existing approaches for helping during movement of blind and weaksighted people. Therefore, the goal of the proposed project is through the development of appropriate machine learning algorithms prepare the basis for future development of a modular mobile navigation system which will enable the blind and weaksighted people to autonomously, safely and accurate movement in known and unknown environments. The basic requirements for such a system are realtime operation in dynamic environments without the need to provide the external infrastructure in advance, and with an emphasis on high level reliability. This way the preconditions for better socialization and higher lifequality for blind and weaksighted people will be achieved. Due to interdisciplinarity of the project, which shall use the methods of machine learning, cognitive modeling, and biodynamics of movement, there is a need of collaboration of the Laboratory for biomechanics, automatics and systems from Faculty of electrical engineering, machinery and  shipbuilding, University of Split, Croatia (where for more than 15 years a research team works on problems, related to Biomechanics of human movements, control and rehabilitation), and our Laboratory for Cognitive Modeling, Faculty of Computer and Information Science, University of Ljubljana, Slovenia.",
            "end_date": "2015-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630864",
                    "ime": "Zoran",
                    "priimek": "Bosnić",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630309",
                    "ime": "Igor",
                    "priimek": "Kononenko",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630511",
                    "ime": "Matjaž",
                    "priimek": "Kukar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630934",
                    "ime": "Darko",
                    "priimek": "Pevec",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630019",
                    "ime": "Matej",
                    "priimek": "Pičulin",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630533",
                    "ime": "Marko",
                    "priimek": "Robnik Šikonja",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2014-05-01 00:00:00",
            "title": "Supervised and unsupervised learning from imbalanced datasets for assistance in movement of persons with low vision"
        },
        "id": 63,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>V zadnjih letih so veliko pozornost na področju strojnega učenja pritegnili realni klasifikacijski problemi, pri katerih se spopadamo z neuravnoteženimi podatki ali pa visoko ceno napačne klasifikacije. Primer takšnega aplikacijskega področja je tudi medicina, kjer imamo na razpolago le majhen delež primerov s proučevano diagnozo (boleznijo), napačno uvrščanje bolnega subjekta med zdrave pa ima lahko tudi življenjsko kritične posledice. Klasičnih pristopov, ki se pri klasifikaciji običajno (v primerih, kadar je zastopanje razredov približno enako in kadar sta ceni  pravilne/napačne klasifikacije enaki) uporabljajo za povečanje točnosti napovednega sistema, v tem primeru ni možno uporabiti, ker je njihov cilj povečanje klasifikacijske točnosti, zaradi česar bi te metode manjšinski razred obravnavale le kot šum v ostalih podatkih večinskega razreda. Namesto tega pa želimo poleg doseganja visoke skupne klasifikacijske točnosti zmanjšati tudi število napačno klasificiranih manjšinskih primerov oz. jih ne obravnavati ko šum. Za te potrebe so se razvile specifične cenovno bčutljive metode, ki pripisujejo različnim razredom in primerom različne kazni napačne klasifikacije, se usmerjajo na drugačno obravnavo manj zastopanih primerov ali pa s pristopi podvzorčenja večinskega razreda/nadvzorčenja manjšinskega razreda spreminjajo učne podatke. V literaturi je v zadnjem času možno zaslediti tudi vse več hibridnih pristopov od naštetih.</p>\r\n<p>V svetu smo priča naraščajočim zahtevam po dvigu kakovosti življenja slepim in slabovidnim osebam z uporabo sodobnih tehnologij. Čeprav so vsakodnevne aktivnosti, kot so iskanje želene destinacije, uporaba raznih predmetov, varna navigacija po kompleksnih poteh, razpoznavanje in zavedanje okolice, za zdrave osebe trivialne, so te naloge zahtevne ali celo nerešljive za slepe in slabovidne osebe. Sistemi, ki se spopadajo z ambicijo reševanja teh težav, temeljijo na uporabi GPS sistemov v kombinaciji s senzorji gibanja in kamerami. Pri tem se soočamo s problemi, ki jih navajamo v nadaljevanju. Zaradi odbojev signala delajo sistemi GPS napako pri določanju lokacije, kar je posebej izrazito v urbanih okoljih, v bližini zgradb. To bi lahko pomenilo, da bi slepa oseba, ki bi za navigacijo uporabljala GPS, lahko na podlagi prejetih podatkov mislila, da se nahaja na pločniku, dejansko pa bi stala na voznem pasu. Obstajajo utemeljene predpostavke, da je ta problem možno rešiti z dodatno uporabo senzorjev gibanja, pri tem pa je še vedno potrebno identificirati majhen delež primerov, ki sta problematična pri obeh sistemih hkrati in jih obravnavati (ta problem se torej prevede na klasifikacijo neuravnoteženih primerov). Čeprav je kognitivno dojemanje okolice, prepoznavanje objektov in izogibanje preprekam možno uspešno reševati s kombinacijo kamer, vizualnih markerjev ali RFID senzorjev in WiFi sprejemnikov, je uporaba tudi teh sistemov dokaj omejena izven okolij, ki so kontrolirana in poznana. Osnovna težava vseh informacijskih storitev, ki jih uporabljajo slepi in slabovidni, je informacijska kompleksnost neznanih okolij, v katerih bi bilo možno uporabniku ponuditi le omejen nabor koristnih informacij glede na trenutni položaj, orientacijo in aktivnost, ki jo oseba želi izvesti (npr. hoja po prehodu za pešce). Enako kot prejšnji je tudi ta problem možno prevesti na problem učenja iz neuravnoteženih podatkov, kar motivira k testiranju obstoječih in razvoju novih algoritmov za  nadzorovano in nenadzorovano učenje za tovrstno domeno. Slednje je še posebej aktualno, če se v informacijski sistem vključijo še podatki iz Geografskih informacijskih sistemov (GIS), saj z njihovo uporabo lahko opozorimo na pomembnejše objekte na znani poti (npr. restavracija, knjižnica, trgovina ipd.) ali pa v neznani okolici, v kateri poznamo le začetno in ciljno točko. Na podlagi navedenega lahko pričakujemo, da bo uporaba metod strojnega učenja (t.j. nadzorovanega in nenadzorovanega učenja) na neuravnoteženih podatkih v kombinaciji s sistemom GPS,</p>\r\n<p>senzorji gibanja, kamerami in sistemom za generiranje/razpoznavanje zvoka lahko obrodila pozitivne rezultate pri reševanju problemov obstoječih sistemov za pomoč pri gibanju slepih in slabovidnih oseb.</p>\r\n<p>Cilj projekta je razvoj ustreznih algoritmov strojnega učenja, ki bi bil osnova za nadaljnji razvoj modularnega mobilnega navigacijskega sistema, ki bo slepim in slabovidnim osebam omogočal samostojno, varno in natančno gibanje v znanih in neznanih okoljih. Osnovne zahteve za takšen sistem so delo v realnem času, delovanje v dinamičnih okoljih brez vnaprej pripravljene eksterne informacijske infrastrukture in visoka stopnja zanesljivosti. Na ta način se bosta slepim in slabovidnim osebam omogočila boljše vključevanje v družbo in dvig kakovosti življenja. Zaradi interdisciplinarnosti projekta, ki združuje področji strojnega učenja in kognitivnega modeliranja ter biomehaniko gibanja, v okviru predlaganega projekta združujemo sodelovanje Laboratorija za kognitivno modeliranje na Fakulteti za računalništvo in informatiko Univerze v Ljubljani in Laboratorija za biomehaniko, avtomatiko in sisteme Fakultete za elektrotehniko, strojništvo in ladjedelništvo Univerze v Splitu (kjer več kot 15 let deluje hrvaška raziskovalna skupina na projektih te domene, trenutni nosi naziv &quot;Biomehanika človeških kretenj, upravljanje in rehabilitacija&quot;).</p>\r\n",
            "end_date": "2015-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630864",
                    "ime": "Zoran",
                    "priimek": "Bosnić",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630309",
                    "ime": "Igor",
                    "priimek": "Kononenko",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630511",
                    "ime": "Matjaž",
                    "priimek": "Kukar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630934",
                    "ime": "Darko",
                    "priimek": "Pevec",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630019",
                    "ime": "Matej",
                    "priimek": "Pičulin",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630533",
                    "ime": "Marko",
                    "priimek": "Robnik Šikonja",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2014-05-01 00:00:00",
            "title": "Nadzorovano in nenadzorovano učenje iz neuravnovešenih podatkov za pomoč pri gibanju slabovidnim osebam"
        }
    },
    {
        "en": {
            "client": "Ministrstvo za izobraževanje, znanost in šport",
            "description": "",
            "end_date": "2015-06-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630901",
                    "ime": "Polona",
                    "priimek": "Oblak",
                    "role": "Koordinator"
                },
                {
                    "id": "630533",
                    "ime": "Marko",
                    "priimek": "Robnik Šikonja",
                    "role": "Vodja delovnega paketa"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "KUL",
            "project_link": "https://www.uni-lj.si/o_univerzi_v_ljubljani/kakovost/projekt_kul/",
            "project_picture": null,
            "ref_project_type": 6,
            "start_date": "2013-03-01 00:00:00",
            "title": "KUL - Kakovost - Univerza v Ljubljani"
        },
        "id": 91,
        "si": {
            "client": "Ministrstvo za izobraževanje, znanost in šport",
            "description": "",
            "end_date": "2015-06-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630901",
                    "ime": "Polona",
                    "priimek": "Oblak",
                    "role": "Koordinator"
                },
                {
                    "id": "630533",
                    "ime": "Marko",
                    "priimek": "Robnik Šikonja",
                    "role": "Vodja delovnega paketa"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "KUL",
            "project_link": "https://www.uni-lj.si/o_univerzi_v_ljubljani/kakovost/projekt_kul/",
            "project_picture": null,
            "ref_project_type": 6,
            "start_date": "2013-03-01 00:00:00",
            "title": "KUL - Kakovost - Univerza v Ljubljani"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>The coronary artery disease, also known as ischemic heart disease, frequently results in a heart attack and is the most common cause of death globally. Ischemia (a restriction in blood supply to tissues) is generally caused by problems with blood vessels with resultant damage and dysfunction of tissue.  Currently, the application of state-of-the-art Finite Element Methods (FEM) ischemia modelling techniques in urgent clinical situations, such as alerting patient in case of ischemia, is not possible as it requires knowledge of patient-specific anatomy which requires long measurements. We will develop a two&#172;step solution which alleviates these problems: 1. creation of large virtual FEM based database, 2. detection of ischemic beats and prediction of ischemia location using the developed database and data mining. The final solution will select classifiers, which are successful in detecting ischemic pulses based on potentials measured on the body surface (i.e., ECG), which will allow fast ischemia detection in urgent situations. If the ECG is classified as ischemic by the first stage classifier, it will be processed by the second stage data mining model, which will predict the location of the ischemic area.</p>\r\n",
            "end_date": "2017-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630970",
                    "ime": "Miha",
                    "priimek": "Drole",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630896",
                    "ime": "Jana",
                    "priimek": "Faganeli Pucer",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630511",
                    "ime": "Matjaž",
                    "priimek": "Kukar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630533",
                    "ime": "Marko",
                    "priimek": "Robnik Šikonja",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630898",
                    "ime": "Erik",
                    "priimek": "Štrumbelj",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2016-02-04 00:00:00",
            "title": "Automatic detection and localization of ischemia by the use of data mining algorithms"
        },
        "id": 200,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Ishemična bolezen srca (tudi koronarna srčna bolezen) se pogosto konča s srčno&#172;mišičnim infarktom in je po vsem svetu eden najpogostejših vzrokov smrti. Ishemijo, ki pomeni nezadostno preskrbo tkiv s krvjo, večinoma povzročajo bolezni ožilja, kar povzroča poškodbe in odmiranje prizadetega tkiva. Sodobni, izpopolnjeni pristopi k modeliranju ishemij z metodo končnih elementov (FEM) zaenkrat še niso primerni za urgentne situacije, kot je npr. takojšnje ukrepanje v primeru ishemije, saj zahtevajo poznavanje specifičnosti anatomije posameznika, ki zahteva natančne in časovno dolgotrajne meritve.  Razvili bomo dvostopenjsko rešitev, ki se elegantno izogne tem težavam: 1.izdelava velike virtualne podatkovne baze FEM modelov, 2. zaznavanje ishemičnih utripov in napovedovanje ishemij s pomočjo zgrajene baze in podatkovnega rudarjenja. Končna rešitev bo izbrala takšne klasifikatorje, ki dobro napovedujejo ishemične utripe na podlagi potencialov, izmerjenih na površini telesa (torej ECG), kar bo omogočilo hitro prepoznavanje ishemij tudi v urgentnih situacijah. Če bo v prvi fazi določen ECG razvrščen v kategorijo ishemičnih, bo na njem uporabljen še drugostopenjski klasifikator, ki bo napovedoval lokacijo ishemičnega področja.</p>\r\n",
            "end_date": "2017-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630970",
                    "ime": "Miha",
                    "priimek": "Drole",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630896",
                    "ime": "Jana",
                    "priimek": "Faganeli Pucer",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630511",
                    "ime": "Matjaž",
                    "priimek": "Kukar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630533",
                    "ime": "Marko",
                    "priimek": "Robnik Šikonja",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630898",
                    "ime": "Erik",
                    "priimek": "Štrumbelj",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2016-02-04 00:00:00",
            "title": "Avtomatsko zaznavanje in lokalizacija ishemij z uporabo algoritmov podatkovnega rudarjenja"
        }
    }
]