[
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "In everyday life, we prefer to make decisions by considering all the available information, and often find that the inclusion of even seemingly circumstantial evidence provides an advantage. In the natural sciences, incorporating all the data can be difficult, time consuming and imprecise, if even possible. We have recently developed a method for large¬scale data fusion. Our fundamental question is: can we improve the results of predictive data mining by fusing numerous, sometimes loosely related, heterogeneous datasets? In this bilateral project, we will use computational approach of data fusion to simultaneously consider all the available genome¬scale data sets for a social amoeba Dictyostelium. Integration will include gene expression data sets, data on protein binding, mutant phenotype data, data on gene annotations and pathway assignments, pathway ontologies, data on KEGG pathways, data on and chemicals and their structural properties, and data from the literature.",
            "end_date": "2016-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630891",
                    "ime": "Tomaž",
                    "priimek": "Curk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630718",
                    "ime": "Martin",
                    "priimek": "Stražar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630995",
                    "ime": "Marinka",
                    "priimek": "Žitnik",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2015-01-01 00:00:00",
            "title": "Data Fusion in Systems Biology of a Social Amoeba Dictyostelium"
        },
        "id": 65,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>V vsakodnevnem življenju ljudje sprejemamo odločitve tako, da skušamo pri tem upoštevati vse informacije, ki so nam na voljo. Mnogokrat nam pri tem pomagajo tudi podatki, ki so s predmetom odločanja povezani le posredno. V znanosti o življenju, kjer je zaradi tehnoloških prebojev v zadnji dekadi na voljo ogromno podatkov, nam povezovanje podatkov in njihova skupna uporaba predstavlja velik problem. Pred kratkim smo v Ljubljani razvili povsem nov postopek za združeno obravnavo heterogenih podatkovnih baz. Postavlja se vprašanje, ali lahko zlivanje podatkov na področju sistemske biologije bistveno izboljša kakovost napovednih modelov, ki jih iz podatkov lahko oblikujemo v namene odkrivanja novih znanj in razumevanja biologije? V tem interdisciplinarnem bilateralnem projektu bomo uporabili metodo za zlivanje podatkov, ki je bila nedavno razvita v sodelujočem Laboratoriju za bioinformatiko. Metoda temelji na sočasni tri&#172;faktorizaciji matrik in lahko zgradi skupen model iz potencialno zelo velike množice raznovrstnih podatkov. V projektu bomo tako gradili napovedne modele iz podatkov o genskih izrazih, vezavnih mestih proteinov, podatkih o fenotipu mutant, podatkih o genskih poteh, ontologijah genskih poti, metabolnih poteh, podatkih o kemijskih učinkovinah in njihovih strukturnih lastnostih in podatkih skritih v besedilih objavljenih v člankih.</p>\r\n",
            "end_date": "2016-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630891",
                    "ime": "Tomaž",
                    "priimek": "Curk",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630718",
                    "ime": "Martin",
                    "priimek": "Stražar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630995",
                    "ime": "Marinka",
                    "priimek": "Žitnik",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2015-01-01 00:00:00",
            "title": "Zlivanje podatkov v sistemski biologiji socialne amebe Dictyostelium"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Fourier Transform Infrared Spectroscopy (FTIR) is a technique for collecting absorption or emission spectra of the observed specimen. It is particularly useful for microscopy, as it allows for detection of spectra measured in areas as small as 5 microns across, thus revealing the chemical composition within samples with high spatial resolution. The use of this technique ranges from tissue sample analysis (e.g. observing the effects of stroke on rat&#39;s brain), forensics, pharmaceutical analysis and quality control in general, material science and many others. There already exist several programs that are widely used in FTIR (bio)spectroscopy and imaging, but all are rather limited. Cytospec (www.cytospec.com) is a package that is good for spectral imaging, but it requires tricks for processing other types of datasets that would benefit from similar/same processing algorithms. These are time series measurements, non-spatially correlated datasets (for example many individual cells, where the spectrum variations are interesting, but the position of the cell is not followed). On the opposite, the Unscrambler is widely used as a statistical analysis software with many nice and robust features, but it is not useful for spectroscopic imaging. Spectrometer manufacturer software usually handles their own file formats; the features and performance of these programs is not always the best as they are mostly aimed to do the measurement itself. Another feature of this software is its high cost. Within our collaboration, we are developing an application that will combine the features of the commonly used software within an open source software that will be free to use for everyone. The project will thus benefit many research groups and companies. The primary users are any synchrotrons with IR beamlines and their immediate user community: Diamond (UK), Soleil (France), ALBA (Spain), BESSY II (Germany), ELETTRA (Italy), ANKA (Germany), Daphne (Italy), ESRF (France), MLS (Germany), DESY (Germany), each about 20-50 user groups per year, which makes hundreds of groups interested. Then in the second shell, since the technique itself is not synchrotron limited the whole FTIR user community will be interested, which is on the order of 1000s in Europe. Finally, providing the file importer function for other instrument manufacturer/technique and the processing functions will extend its use to techniques include near IR imaging (from food industry to satellites), Raman spectromicroscopy, etc. The project is based on the existing open-source data mining platform Orange, developed at the University of Ljubljana. Its data-flow architecture is intuitive and easy to use, and it also allows for combining the specialized components, developed within this project, with the existing components for data processing, visualization and data mining. The two groups are complementary and cover the necessary expertise. The Slovenian partner has two decades of expertise in development of similar software for data mining, and the French partner is the user of such software with plenty of expertise about the methods that need to be incorporated in it. Project plan outline - Implementation of import/export functions for single spectra and maps for OPUS, OMNIC, Txt and ENVI (May 2016) - Plotting functions for spectra and maps (July 2016) - Peak picking and pixel selection/extraction from map (July 2016) - Implementation of spectral correction base algorithms such as baseline, scattering, offset, and base spectral manipulation functions such as normalization, derivation and smoothing (October 2016) - Implementation of advanced spectral manipulation tools, such as multiple types of baseline options, peak fitting, deconvolution, Mie scattering, water subtraction, etc. (January 2017) - Modification and implementation of multivariate spectral analysis tools as, HCA, PCA and PCA-LDA, PLS regression and multivariate curve resolution (April 2017) - Optimization for large data (September 2017) - Parallelization of algorithms (December 2017) - Adaptation of developed features for other spectroscopic mapping techniques (January 2018) - Development of wrapper functions for spectroscopic tomography reconstruction algorithms (May 2018) - Bug fixing and setting up long term support (September 2018)</p>\r\n",
            "end_date": "2018-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630947",
                    "ime": "Anže",
                    "priimek": "Starič",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630718",
                    "ime": "Martin",
                    "priimek": "Stražar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630669",
                    "ime": "Vesna",
                    "priimek": "Tanko",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2017-01-01 00:00:00",
            "title": "Development of an open-source platform for multivariate analysis of FTIR data "
        },
        "id": 372,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Infrardeča spektroskopija s Fourierovo transformacijo (Fourier Transform Infrared Spectroscopy, FTIR) je tehnika zbiranja absorbcijskih ali emisijskih spektrov opazovanih vzorcev. Posebej uporabna je za mikroskopijo, saj omogoča opazovanje spektrov izmerjenih na zelo majhnih regijah (tudi do 5 mikronov), s čimer lahko opazujemo kemično sestavo vzorcev z veliko prostorsko ločljivostjo. Uporaba te tehnike je raznolika, od analize tkiv (npr. opazovanje posledic kapi v možganih podgan), forenziki, farmaciji, kontroli kvalitete, znanosti o materialih in na številnih drugih področjih. Obstoječa programska oprema za analizo podatkov pridobljenih s FTIR je omejena. Cytospec (www.cytospec.com) je primeren za spektralno analizo slik, njegova uporaba na drugačnih podatkih, primernih za obdelavo s temi metodami, pa je možna le z uporabo zahtevnejših trikov. Primeri takšnih podatkov so meritve časovnih vrst in podatki z neprostorskimi korelacijami (npr. večje število posamičnih celic, pri katerih nas zanimajo spremembe spektra, pozicija celic pa ni znana). Za razliko od Cytospeca je Unscrambler pogosto uporabljan kot orodje za statistično analizo s številnimi prikladnimi in robustnimi funkcijami, ni pa primeren za spektroskopske slike. Programska oprema, ki jo prilagajo proizvajalci spektrometrov, običajno zahteva specifične oblike datotek; funkcije in učinkovitost delovanja teh programov pogosto nista zadostna, saj so večinoma namenjeni le zajemu in osnovni obdelavi meritev. Dodatna omejitev te programske opreme je njihova visoka cena. V sklopu sodelovanja razvijamo programsko opremo, ki bo združevala lastnosti pogosto uporabljene opreme, poleg tega pa bo na voljo za brezplačno uporabo. Rezultate projekta bodo lahko izkoriščale številne raziskovalne skupine in podjetja. Osnovni uporabniki so sinhrotronski pospeševalniki z IR žarki in njihove neposredne stranke: Diamond (VB), Soleil (Francija), ALBA (Španija), BESSY II (Nemčija), ELETTRA (Italija), ANKA (Nemčija), Daphne (Italija), ESRF (Francija), MLS (Nemčija). Vsako od teh ustanov letno obišče 20-50 skupin, torej je potencialnih uporabnikov stotine. Drugi krog uporabnikov so drugi raziskovalci, ki uporabljajo FTIR, vendar kot vir svetlobe ne uporabljajo pospeševalnikov, saj programska oprema ne bo specializirana za posamezen svetlobni izvor; takšnih potencialnih uporabnikov je v Evropi tisoče. Končno, z omogočanjem branja podatkov v drugih oblikah bo razvita programska oprema uporabna tudi v spektroskopiji z bližnjo infrardečo (near infrared) svetlobo, Ramanov spektromikroskopiji ipd. Projekt temelji na obstoječi odprtokodni platformi Orange, ki jo razvija Laboratorij za bioinformatiko Fakultete za računalništvo in informatiko Univerze v Ljubljani. Njegov uporabniški vmesnik, s katerim uporabnik sestavlja pretok podatkov, je intuitiven in se ga je lahko naučiti, obenem pa bo omogočal sestavljanje specializiranih komponent, razvitih v okviru projekta, z obstoječimi splošnimi komponentam za procesiranje podatkov, vizualizacijo in podatkovno rudarjenje. Skupini sta komplementarni in pokrivata različna področja. Slovenski partner ima dve desetletji izkušenj z razvojem podobne programske opreme za podatkovno rudarjenje, francoski partner pa je uporabnik te programske opreme z veliko izkušnjami z metodami, ki jih mora takšna oprema vsebovati. Okvirni načrt izvedbe - Funkcije za branje in zapis podatkov posamičnih spektrov in slik za OPUS, OMNIC, Txt in ENVI (maj 2016) - Izris spektrov in slik (julij 2016) - Izbor vrhov v spektrih ter točk in regij na slikah (julij 2016) - Algoritmi za korekcijo izmerjenih spektrov in osnovno manipulacijo s spektri (normalizarcija, odvajanje, glajenje) (oktober 2016) - Napredni algoritmi za manipulacijo (umerjenje vrhov, dekonvolucija, Mie, odstranjevanje vode) (januar 2017) - Adaptacija in programiranje orodij za multivariatno analizo (HCA, PCA, PCA-LDA, PLS) (april 2017) - Optimizacija za velike količine podatkov (september 2017) - Pospeševanje algoritmov z vzporednim računanjem (december 2017) - Prirejanje razvite aplikacije za druge metode spektroskopije (januar 2018) - Razvoj funkcij za spektroskopsko tomografijo (maj 2018) - Odpravljanje napak in vzpostavitev dolgoročne podpore (september 2018)</p>\r\n",
            "end_date": "2018-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630589",
                    "ime": "Janez",
                    "priimek": "Demšar",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630947",
                    "ime": "Anže",
                    "priimek": "Starič",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630718",
                    "ime": "Martin",
                    "priimek": "Stražar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630669",
                    "ime": "Vesna",
                    "priimek": "Tanko",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630908",
                    "ime": "Marko",
                    "priimek": "Toplak",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630650",
                    "ime": "Blaž",
                    "priimek": "Zupan",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2017-01-01 00:00:00",
            "title": "Razvoj odprtokodneprogramske opreme za multivariantno analizo podatkov FTIR"
        }
    }
]