[
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "Recently, special attention of machine learning community has been given to realworld classification problems with imbalanced class distribution or with classes where misclassifications cost varies significantly. For example, in medical diagnosis typically a rather small number of patients have some critical diagnoses (illnesses), however an incorrect diagnosis can have fatal consequences in cases where an ill patient is proclaimed healthy. The classical classification approaches (when classes are approximately balanced or when we have equal misclassification costs for all classes) are not applicable in such cases as they tend to maximize the classification accuracy and therefore the instances from minority class are treated by those approaches as noisy instances. Yet, what we want to achieve is to minimize the number of misclassified cases from the minority class while keeping the relatively high overall classification accuracy (or we want to minimize the overall misclassification cost). For that purpose a different approaches were developed which may either include in the algorithm itself the misclassification cost, or the modifications of the algorithm in order to focus more on cases from the minority class, or to use various techniques to modify the training set appropriately, such as oversampling of the minority class cases or undersampling of the majority class cases. Also, hybrid approaches are also becoming popular. One of the civilization responsibilities is the need for increasing the quality of life for blind and weaksighted people using the modern technology. Daily activities which for healthy subjects seem to be trivial, such as finding the required destination, using various objects, safe navigation through complex paths, recognizing the local environment and an appropriate orientation in it, contextual comprehension of the environment etc. are much demanding and often unsolvable tasks for blind or weaksighted subject. Most of the approaches to solve those problems are based on GPS technology combined with inertial sensors and cameras. The most common problems with those approaches are the following. The GPS technology has a limited accuracy in urban areas, especially in the areas close to building due to multiple signal reflections. This may cause that a blind person assumes he or she is located at the sidewalk while standing in the middle of the road. This problem can be reduced using inertia sensors, however using the approach of identifying a small number of deviations of two different systems, which transforms the original problem onto the problem of classification of data with imbalanced classes. Cognitive understanding of environment, recognition of objects and avoiding the obstacles is relatively successfully solved using approaches that combine cameras, visual markers or RFID sensors, and WiFi receivers, however, this is applicable only in controlled environments and outside those the usability is much limited. A basic limitation is information complexity of unmarked environments which can be avoided by providing a small number of useful data with respect to the current position, orientation and activity that a blind or weaksighted subject wants to perform (such as crossing the road). This problem can also be transformed into a problem of dealing with imbalanced data. Therefore, there is a need to try to use the existing methods as well as to develop new algorithms for supervised as well as unsupervised machine learning for this kind of problems. This becomes even more interesting if the system includes the data from GIS. In this context we emphasize the movement through usual paths with pointing to some important objects on the path (such as a restaurant, library, store etc.). However, this is even more important on unknown paths where at the beginning only starting and end point are known. We expect that the use of machine learning methods, i.e. supervised and unsupervised learning on imbalanced datasets with combination of GPS, inertia sensors, cameras and an audiorendering system, will successfully solve the described problems when using the existing approaches for helping during movement of blind and weaksighted people. Therefore, the goal of the proposed project is through the development of appropriate machine learning algorithms prepare the basis for future development of a modular mobile navigation system which will enable the blind and weaksighted people to autonomously, safely and accurate movement in known and unknown environments. The basic requirements for such a system are realtime operation in dynamic environments without the need to provide the external infrastructure in advance, and with an emphasis on high level reliability. This way the preconditions for better socialization and higher lifequality for blind and weaksighted people will be achieved. Due to interdisciplinarity of the project, which shall use the methods of machine learning, cognitive modeling, and biodynamics of movement, there is a need of collaboration of the Laboratory for biomechanics, automatics and systems from Faculty of electrical engineering, machinery and  shipbuilding, University of Split, Croatia (where for more than 15 years a research team works on problems, related to Biomechanics of human movements, control and rehabilitation), and our Laboratory for Cognitive Modeling, Faculty of Computer and Information Science, University of Ljubljana, Slovenia.",
            "end_date": "2015-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630864",
                    "ime": "Zoran",
                    "priimek": "Bosnić",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630309",
                    "ime": "Igor",
                    "priimek": "Kononenko",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630511",
                    "ime": "Matjaž",
                    "priimek": "Kukar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630934",
                    "ime": "Darko",
                    "priimek": "Pevec",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630019",
                    "ime": "Matej",
                    "priimek": "Pičulin",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630533",
                    "ime": "Marko",
                    "priimek": "Robnik Šikonja",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2014-05-01 00:00:00",
            "title": "Supervised and unsupervised learning from imbalanced datasets for assistance in movement of persons with low vision"
        },
        "id": 63,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>V zadnjih letih so veliko pozornost na področju strojnega učenja pritegnili realni klasifikacijski problemi, pri katerih se spopadamo z neuravnoteženimi podatki ali pa visoko ceno napačne klasifikacije. Primer takšnega aplikacijskega področja je tudi medicina, kjer imamo na razpolago le majhen delež primerov s proučevano diagnozo (boleznijo), napačno uvrščanje bolnega subjekta med zdrave pa ima lahko tudi življenjsko kritične posledice. Klasičnih pristopov, ki se pri klasifikaciji običajno (v primerih, kadar je zastopanje razredov približno enako in kadar sta ceni  pravilne/napačne klasifikacije enaki) uporabljajo za povečanje točnosti napovednega sistema, v tem primeru ni možno uporabiti, ker je njihov cilj povečanje klasifikacijske točnosti, zaradi česar bi te metode manjšinski razred obravnavale le kot šum v ostalih podatkih večinskega razreda. Namesto tega pa želimo poleg doseganja visoke skupne klasifikacijske točnosti zmanjšati tudi število napačno klasificiranih manjšinskih primerov oz. jih ne obravnavati ko šum. Za te potrebe so se razvile specifične cenovno bčutljive metode, ki pripisujejo različnim razredom in primerom različne kazni napačne klasifikacije, se usmerjajo na drugačno obravnavo manj zastopanih primerov ali pa s pristopi podvzorčenja večinskega razreda/nadvzorčenja manjšinskega razreda spreminjajo učne podatke. V literaturi je v zadnjem času možno zaslediti tudi vse več hibridnih pristopov od naštetih.</p>\r\n<p>V svetu smo priča naraščajočim zahtevam po dvigu kakovosti življenja slepim in slabovidnim osebam z uporabo sodobnih tehnologij. Čeprav so vsakodnevne aktivnosti, kot so iskanje želene destinacije, uporaba raznih predmetov, varna navigacija po kompleksnih poteh, razpoznavanje in zavedanje okolice, za zdrave osebe trivialne, so te naloge zahtevne ali celo nerešljive za slepe in slabovidne osebe. Sistemi, ki se spopadajo z ambicijo reševanja teh težav, temeljijo na uporabi GPS sistemov v kombinaciji s senzorji gibanja in kamerami. Pri tem se soočamo s problemi, ki jih navajamo v nadaljevanju. Zaradi odbojev signala delajo sistemi GPS napako pri določanju lokacije, kar je posebej izrazito v urbanih okoljih, v bližini zgradb. To bi lahko pomenilo, da bi slepa oseba, ki bi za navigacijo uporabljala GPS, lahko na podlagi prejetih podatkov mislila, da se nahaja na pločniku, dejansko pa bi stala na voznem pasu. Obstajajo utemeljene predpostavke, da je ta problem možno rešiti z dodatno uporabo senzorjev gibanja, pri tem pa je še vedno potrebno identificirati majhen delež primerov, ki sta problematična pri obeh sistemih hkrati in jih obravnavati (ta problem se torej prevede na klasifikacijo neuravnoteženih primerov). Čeprav je kognitivno dojemanje okolice, prepoznavanje objektov in izogibanje preprekam možno uspešno reševati s kombinacijo kamer, vizualnih markerjev ali RFID senzorjev in WiFi sprejemnikov, je uporaba tudi teh sistemov dokaj omejena izven okolij, ki so kontrolirana in poznana. Osnovna težava vseh informacijskih storitev, ki jih uporabljajo slepi in slabovidni, je informacijska kompleksnost neznanih okolij, v katerih bi bilo možno uporabniku ponuditi le omejen nabor koristnih informacij glede na trenutni položaj, orientacijo in aktivnost, ki jo oseba želi izvesti (npr. hoja po prehodu za pešce). Enako kot prejšnji je tudi ta problem možno prevesti na problem učenja iz neuravnoteženih podatkov, kar motivira k testiranju obstoječih in razvoju novih algoritmov za  nadzorovano in nenadzorovano učenje za tovrstno domeno. Slednje je še posebej aktualno, če se v informacijski sistem vključijo še podatki iz Geografskih informacijskih sistemov (GIS), saj z njihovo uporabo lahko opozorimo na pomembnejše objekte na znani poti (npr. restavracija, knjižnica, trgovina ipd.) ali pa v neznani okolici, v kateri poznamo le začetno in ciljno točko. Na podlagi navedenega lahko pričakujemo, da bo uporaba metod strojnega učenja (t.j. nadzorovanega in nenadzorovanega učenja) na neuravnoteženih podatkih v kombinaciji s sistemom GPS,</p>\r\n<p>senzorji gibanja, kamerami in sistemom za generiranje/razpoznavanje zvoka lahko obrodila pozitivne rezultate pri reševanju problemov obstoječih sistemov za pomoč pri gibanju slepih in slabovidnih oseb.</p>\r\n<p>Cilj projekta je razvoj ustreznih algoritmov strojnega učenja, ki bi bil osnova za nadaljnji razvoj modularnega mobilnega navigacijskega sistema, ki bo slepim in slabovidnim osebam omogočal samostojno, varno in natančno gibanje v znanih in neznanih okoljih. Osnovne zahteve za takšen sistem so delo v realnem času, delovanje v dinamičnih okoljih brez vnaprej pripravljene eksterne informacijske infrastrukture in visoka stopnja zanesljivosti. Na ta način se bosta slepim in slabovidnim osebam omogočila boljše vključevanje v družbo in dvig kakovosti življenja. Zaradi interdisciplinarnosti projekta, ki združuje področji strojnega učenja in kognitivnega modeliranja ter biomehaniko gibanja, v okviru predlaganega projekta združujemo sodelovanje Laboratorija za kognitivno modeliranje na Fakulteti za računalništvo in informatiko Univerze v Ljubljani in Laboratorija za biomehaniko, avtomatiko in sisteme Fakultete za elektrotehniko, strojništvo in ladjedelništvo Univerze v Splitu (kjer več kot 15 let deluje hrvaška raziskovalna skupina na projektih te domene, trenutni nosi naziv &quot;Biomehanika človeških kretenj, upravljanje in rehabilitacija&quot;).</p>\r\n",
            "end_date": "2015-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630864",
                    "ime": "Zoran",
                    "priimek": "Bosnić",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630309",
                    "ime": "Igor",
                    "priimek": "Kononenko",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630511",
                    "ime": "Matjaž",
                    "priimek": "Kukar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630934",
                    "ime": "Darko",
                    "priimek": "Pevec",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630019",
                    "ime": "Matej",
                    "priimek": "Pičulin",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630533",
                    "ime": "Marko",
                    "priimek": "Robnik Šikonja",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2014-05-01 00:00:00",
            "title": "Nadzorovano in nenadzorovano učenje iz neuravnovešenih podatkov za pomoč pri gibanju slabovidnim osebam"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>The goal of the project is development of intelligent system that can improve detection of human cognitive and behavior disorders. Example is dementia - the loss of intellectual functions, accompanied with personality disturbances (its most common form is the Alzheimer disease) and deterioration of individuals quality of personal and professional life. Through the last decades, an abundance of medical data was gathered about dementia. These data include multimedia objects (images, sound, etc.), temporal data and time-series, and text documents; their analyses require state-of-the-art methods from the fields of data analysis. The expected project contributions include a prototype of the prediction system for analysis of disorders that will be generalized for several related health problems (such as Brain ischemia, Brain haemorrhagia, Brain tumors, Neurodegenerative disorders etc.) and evaluating the prototype on the available dementia data acquired from the Neurological (Novi Sad) and Oncological institute (Ljubljana).</p>\r\n",
            "end_date": "2017-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630864",
                    "ime": "Zoran",
                    "priimek": "Bosnić",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630970",
                    "ime": "Miha",
                    "priimek": "Drole",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630675",
                    "ime": "Domen",
                    "priimek": "Košir",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630511",
                    "ime": "Matjaž",
                    "priimek": "Kukar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630019",
                    "ime": "Matej",
                    "priimek": "Pičulin",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2016-02-04 00:00:00",
            "title": "Intelligent computer techniques for improving medical detection, analysis and explanation of human cognition and behavior disorders"
        },
        "id": 199,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Tema projekta je razvoj inteligentnega sistema za zaznavanje človeških kognitivnih motenj in motenj obnašanja. Primer le-teh je demenca - izguba intelektualnih funkcij, ki jo spremljajo motnje osebnosti (njena najbolj znana oblika je Alzheimerjeva bolezen), vsi ti pojavi pa vplivajo na znižanje ravni človekovega strokovnega in zasebnega življenja. Podatki o demenci obsegajo slike, zvoke, časovna zaporedja meritev in besedilne dokumente, njihova analiza pa zahteva uporabo sodobnih metod za analizo podatkov. Pričakovani rezultati projekta obsegajo prototip napovednega sistema, ki ga je možno uporabiti za analizo družine bolezni (kot so ishemična bolezen možganov, otekanje možganov, možganski tumorji in nevrodegenerativne bolezni), testirati prototip na podatkih Nevrološkega (Novi Sad) in Onkološkega inštituta (Ljubljana).</p>\r\n",
            "end_date": "2017-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630864",
                    "ime": "Zoran",
                    "priimek": "Bosnić",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630970",
                    "ime": "Miha",
                    "priimek": "Drole",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630675",
                    "ime": "Domen",
                    "priimek": "Košir",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630511",
                    "ime": "Matjaž",
                    "priimek": "Kukar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630019",
                    "ime": "Matej",
                    "priimek": "Pičulin",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630919",
                    "ime": "Petar",
                    "priimek": "Vračar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2016-02-04 00:00:00",
            "title": "Inteligentne računalniške metode za izboljšanje zaznavanja, analize in razlage kognitivnih motenj obnašanja pri človeku"
        }
    }
]