[
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>It is generally accepted that one-to-one tutoring is by far more effective than in-class teaching, but too costly in most situations. To carry out one-to-one tutoring at reasonable cost, CAI (Computer Assisted Instruction) is an alternative. To overcome CAIs rigid behaviour, ITS (Intelligent Tutoring Systems) are generally considered as the most promising option. However, the costs of ITS development are high because it requires major involvement of a domain expert to realise intelligent student-system interaction. The purpose of this project is to develop methods for automating the process of developing ITS and thus considerably decrease the high costs of building ITS, by enabling more economical, semi-automatic development of  ITS.</p>\r\n\r\n<p>In particular, the main goals of the project is to develop methods to support automated conceptualisation of learning domains, which can be viewed as a key component in the construction of ITS systems. In the project, several experimental case studies in selected learning domains will be carried out from two types of domains: symbolic problem solving, like physics, medical reasoning and chess, and motor and/or control skill domains like running, walking in parients, or tennis.</p>\r\n\r\n<p>The role of domain conceptualisation is as follows. In complex domains, the connection between the basic domain theory (axioms, laws, formulas, rules of the game, etc.) and problem solutions is usually rather complex and hard for a human to execute. Therefore, there is typically a need for an intermediate theory, conceptualised domain theory,  that serves as a bridge between the basic declarative domain theory and procedural knowledge for concrete problem solving. This can be viewed in terms of a derivation chain as follows. Basic domain theory (axioms, etc.) logically entails a  conceptualised domain theory, which in turn entails problem solutions. Logically, the basic domain theory also entails problems solutions, but at much higher problem-solving effort. The basic theory is typically non-operational for a human (requires excessive computation, or it may be too complex to memorise), whereas the conceptualised theory is human-assimilable. These relations can be illustrated as follows:</p>\r\n<p> </p>\r\n<p>original theory ------------------------------------------&gt; problem solution</p>\r\n<p>original theory  ----&gt;  conceptualised theory ---&gt; problem solution</p>\r\n<p> </p>\r\n<p>A conceptualised domain is a problem solving tool for a human, and therefore it should be simple and compact, so that it can be understood, memorised, and executed in problem solving by the student.</p>\r\n\r\n<p>The planned conceptualisation methods will be based on some recent methods and paradigms of AI which will be adapted and further elaborated for the purpose of this project. These techniques and paradigms include: ABML (Argument Based Machine Learning) , QR (Qualitative Reasoning and modelling) , Q2 learning (Qualitatively faithful Quantitative learning), EBG and EBL (Explanation Based Generalisation and Learning), ILP (Inductive Logic Programming), and specific techniques of behavioural cloning (capturing human skill from observed humans behaviours).</p>\r\n\r\n<p>The developed conceptualisation methods will be experimentally applied to intelligent tutoring systems for selected domains as follows:</p>\r\n<p>(1) symbolic problem-solving domains: physics, medical diagnostic reasoning (diagnosis of tremors), and chess;</p>\r\n<p>(2) motor skill domains: running, tennis, walking in patients (multiple sclerosis)</p>\r\n<p>The AI part of the project will be carried out by the Artificial Intelligence Laboratory of Univ. of Ljubljana, and LMG laboratory of the Ljubljana Clinical Centre will collaborate in the neurological medical applications. These medical applications are expected to be directly adopted in the medical practice.</p>\r\n",
            "end_date": "2014-06-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630025",
                    "ime": "Ivan",
                    "priimek": "Bratko",
                    "role": "Vodja projekta na FRI"
                },
                {
                    "id": "630855",
                    "ime": "Matej",
                    "priimek": "Guid",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630854",
                    "ime": "Martin",
                    "priimek": "Možina",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630690",
                    "ime": "Aleksander",
                    "priimek": "Sadikov",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630824",
                    "ime": "Jure",
                    "priimek": "Žabkar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2011-07-01 00:00:00",
            "title": "Machine learning for building intelligent tutoring systems"
        },
        "id": 40,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Splošno je sprejeto, da je posamično poučevanje bistveno bolj učinkovito kot poučevanje v razredu učencev, vendar predrago v večini situacij. Za ekonomično izvedbo posamičnega poučevanja je zato zanimiva alternativa poučevanje z računalniki (CAI, computer aided instruction). Vendar je CAI poučevanje zelo togo, zato se za najbolj obetavno možnost smatrajo inteligentni poučevalni sistemi (ITS, intelligent tutoring systems). Vendar je ovira spet v visoki ceni razvoja ITS sistemov, saj njihov razvoj zahteva obsežno sodelovanje področnega eksperta za realizacijo inteligentne interakcije med učencem in računalnikom. Glavni namen tega projekta je razviti metode, s katerimi bi bilo mogoče vsaj delno avtomatizirati gradnjo ITS sistemov in s tem bistveno znižati stroške gradnje.</p>\r\n\r\n<p>Glavni cilj projekta je razviti metode za avtomatsko konceptualizacijo učnih domen, kar je bistvena komponenta razvoja ITS sistemov. Izpeljali bomo tudi vrsto eksperimentalnih študij iz dveh tipov učnih domen: simbolično reševanje problemov, kot sta fizika in šah, ter domene motoričnih in kontrolnih spretnosti, kot jih najdemo pri pilotiranju, teku ali tenisu.</p>\r\n\r\n<p>Pomen konceptualizacije domen je v naslednjem.  V zahtevnih problemskih domenah je pot od osnovne teorije domene (aksiomi, zakoni, formule, pravila igre itd.) do rešitev problema pogosto zelo dolga in za človeka težko izvedljiva. Zato se značilno pojavi potreba po vmesni teoriji, konceptualizirani domenski teoriji, ki služi kot most med osnovno deklarativno teorijo in postopkovnim znanjem, potrebnim za reševanje konkretnih problemov. To pot lahko gledamo kot verigo izpeljav: iz osnovne teorije domene logično sledi konceptualizirana teorija, iz te pa naprej rešitev problema. Rešitev problema sledi tudi iz same osnovne teorije, vendar je ta pot veliko daljša. Tako je osnovna teorija tipično neoperativna za človeka (zahteva preveč računanja ali pa je preobsežna, da bi si jo učenec sploh lahko zapomnil), medtem ko konceptualizirano teorijo po definiciji človek lahko asimilira. Te relacije lahko ponazorimo takole:</p>\r\n<p> </p>\r\n<p>osnovna teorija ------------------------------------------&gt;  rešitev problema</p>\r\n<p>osnovna teorija ---&gt; konceptualizirana teorija ---&gt; rešitev problema</p>\r\n<p> </p>\r\n<p>Tako je konceptualizirana teorija učinkovito orodje za človeško reševanje problemov, zato pa mora biti enostavna in kompaktna, da jo lahko učenec razume, si jo zapomni in uporabi pri reševanju konkretnih problemov. Poleg metod konceptualizacije se bomo posvetili tudi metodam avtomatskega generianja komentarjev rešitev v luči uporabljene knceptualizacije.</p>\r\n\r\n<p>Kot tehnično osnovo za razvoj in implementacijo metod konceptualizacije nameravamo uporabiti nekatere novejše tehnike in paradigme umetne inteligence, ki jih nameravamo dopolniti oz. nadgraditi za potrebe konceptualizacije. Med temi so: argumentirano strojno učenje (ABML; Argument Based Machine Learning), kvalitativno sklepanje in modeliranje (QR; Qualitative Reasoning and modelling), Q2 učenje (Qualitatively faithful Quantitative learning), generalizacija in učenje z razlago (EBG, EBL; Explanation Based Generalisation and Learning), induktivno logično programiranje (ILP; Inductive Logic Programming), ter specifične tehnike za vedenjsko kloniranje (zajemanje človeških motoričnih/kontrolnih veščin).</p>\r\n\r\n<p>Razvite metode konceptualizacije bomo eksperimentalno uporabili na izbranih domenah poučevanja z ITS kot sledi:</p>\r\n<p>(1) simbolno reševanje problemov: fizika, medicinsko diagnostično sklepanje (diagnostika tremorjev) in šah;</p>\r\n<p>(2) motorične spretnosti: tek, tenis in hoja pri bolnikih (multipla skleroza).</p>\r\n<p> </p>\r\n<p>Raziskave iz umetne inteligence v tem projektu bo izvajal Laboratorij za umetno inteligenco Univerze v Ljubljani, medtem ko bo Laboratorij za motnje gibanja Kliničnega centra v Ljubljani sodeloval pri medicinskih aplikacijah. Pričakujemo, da bosta obe medicinski aplikaciji neposredno postali del klinične prakse.</p>\r\n\r\n\r\n",
            "end_date": "2014-06-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630025",
                    "ime": "Ivan",
                    "priimek": "Bratko",
                    "role": "Vodja projekta na FRI"
                },
                {
                    "id": "630855",
                    "ime": "Matej",
                    "priimek": "Guid",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630854",
                    "ime": "Martin",
                    "priimek": "Možina",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630690",
                    "ime": "Aleksander",
                    "priimek": "Sadikov",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630824",
                    "ime": "Jure",
                    "priimek": "Žabkar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2011-07-01 00:00:00",
            "title": "Strojno učenje v gradnji inteligentnih sistemov za poučevanje"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Lung cancer is the leading cause of death due to cancer worldwide. Survival rates of patients with lung cancer and mesothelioma continue to be very low, with 5-year survival rates of 12% and 5%, respectively. Systemic treatment with chemotherapy has reached its plateau.  Better survival rates can only be achieved through a better understanding of molecular biology of primary tumors and host characteristics, which will enable us to tailor and individualize therapy for these malignancies in future.  The treatment of non- small-cell lung cancer (NSCL) with tyrosine kinase inhibitors (TKIs), targeted against the epidermal growth factor (EGFR), represent the first individualized treatment approach based on the molecular biology of tumor in lung cancer. Patients with activating EGFR mutations (EGFRmu+) in the primary tumor respond especially well to this type of treatment. However, not all the patients with EGFRmu + tumors respond to therapy and almost all of them eventually develop resistance to the treatment. To overcome resistance, additional biomarkers of sensitivity/resistance to TKIs, such as additional EGFR mutations, KRAS mutations and others need to be researched. Platinum-based chemotherapy represents the standard treatment of lung cancer as well as mesothelioma nowadays. It is predicted that in the near future, by means of a better understanding and detection of certain biomarkers, such as ERCC1 and TOPO2, we will be able to select which patients will respond to a particular cytostatic . In addition, host characteristics were found to influence the efficacy of any particular systemic therapy substantially, with various polymorphisms in genes which code for enzymes from the CYP family playing an important role. All of these factors, alongside with new biomarkers such as tumor stem cells, have not yet been researched thoroughly enough in lung cancer and mesothelioma to allow for individualized treatment approaches.</p>\r\n<p> The main goal of our research project is to study the value of various EGFR mutations, KRAS mutations, cMET amplifications and EML4/ALK translocation for response to TKI therapy in lung adenocarcinoma and mesothelioma and by doing that to form a prognostic model which will predict for resistance/sensitivity to TKI treatment. We will also study the predictive value of the expression of ERCC1 and TOPO2 in primary tumors of lung cancer and mesothelioma for response to different cytostatics, such as cisplatin and etoposide. By determining the plasma drug concentrations and by defining polymorphisms of the CYP3A enzyme, our research will look into the pharmacokinetics of per oral and/or intravenous administered etoposide. Additional research focus will be on determining the presence of cancer stem cells in the blood of lung cancer patients. The trial will include 330 patients with lung cancer and mesothelioma, treated with standard systemic therapy at the University Clinic Golnik (UCG) during the next two years. The efficacy of treatment will be determined by using the RECIST method and on the basis of survival rates. Simultaneously the standards for a tissue and blood sample biobank will be formed and institutionalized. Biological markers in the primary tumor tissue and in the blood will be determined by use of the standard methods at histological and molecular biology laboratory at the UCG. Drug concentrations in the plasma will be determined by liquid chromatography. Prognostic models for response to certain systemic therapy, based on the presence of multiple biomarkers will be formed by using standardized statistical tools and artificial intelligence methods. We strongly believe that our findings will have a significant contribution towards improving the overall understanding of the molecular biology of lung cancer and host characteristics on the outcome of systemic therapy, thus enabling us individualize treatment of patients with these types of cancer in everyday clinical practice.</p>\r\n",
            "end_date": "2014-06-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630025",
                    "ime": "Ivan",
                    "priimek": "Bratko",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630855",
                    "ime": "Matej",
                    "priimek": "Guid",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630854",
                    "ime": "Martin",
                    "priimek": "Možina",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630690",
                    "ime": "Aleksander",
                    "priimek": "Sadikov",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630824",
                    "ime": "Jure",
                    "priimek": "Žabkar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2011-07-01 00:00:00",
            "title": "Molecular and other prognosticators of lung cancer and mesothelioma "
        },
        "id": 41,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Rak pljuč je najpogostejši vzrok smrti zaradi raka, preživetja bolnikov z rakom pljuč in mezoteliomom pa so še vedno slaba in znašajo 5-letna preživetja le okoli 12% za rak pljuč in 5% za mezoteliom. Sistemsko zdravljenje s kemoterapijo, katerega potrebuje večina bolnikov, je doseglo svoj plato. Boljša preživetja bolnikov z rakom pljuč in mezoteliomombo je mogoče doseči samo z boljšim poznavanjem biologije teh rakov in lastnosti gostitelja in temu prilagojenim individualiziranim zdravljenjem. Prvi uspeh individualiziranega, biološkim lastnostim tumorja prilagojenega, tarčnega zdravljenja raka pljuč, predstavlja zdravljenje nedrobnoceličnega raka pljuč (NSCL) s tirozin kinaznimi inhibitorji (TKI) usmerjenimi proti epidermalnemu rastnemu dejavniku (EGFR). Na to zdravljenje zlasti dobro odgovorijo bolniki s prisotnimi aktivirajočimi EGFR mutacijami (EGFRmu+) v primarnem tumorju. Vendar pa vsi bolniki zvEGFRmu + tumorji ne odgovorijo na zdravljeni  in večina tistih, ki odgovorijo, tekom mesecev ali let razvije rezistenco na zdravljenje. Zato se raziskujejo dodatni biološki označevalci, na podlagi katerih bi bilo mogoče še bolje v naprej določiti občutljivost/rezistenco na zdravljenje s TKI, kot so dodtane EGFR mutacije, KRAS mutacije in drugi. Kemoterapija na bazi platine predstavlja danes standardno zdravljenje raka pljuč in  mezotelioma. Kaže, da bo mogoče v bodočnosti z boljšo razpoznavo določenih biooznačevalcev v primarnem tumorju, kot sta ERCC1 in TOPO2, vnaprej opredeliti kateri bolniki bodo odgovorili na zdravljenje z določenim citostatikom. Dodatno na učinkovitost kateregakoli sistemskega zdravljenja raka vplivajo tudi lastnosti gostitelja. Vedno bolj postaja jasno, da igrajo pri tem pomembno vlogo različni polimorfizmi v genih, ki kodirajo za presnovne encime iz družine CYP-ov. Vsi ti faktorji kot tudi povsem novi biomarkerji, kot je prisotnost zarodnih matičnih rakavih celic pri raku pljuč in mezoteliomu, še niso dovolj raziskani, da bi jih lahko uporabili v vsakodnevni klinični praksi za individualizacijo zdravljenja posameznega bolnika.</p>\r\n<p>Namen našega projekta je proučiti pomen posameznih EGFR mutacij, KRAS mutacij, cMET amplifikacije in EML4/ALK translokacije za odgovor na zdravljenje z TKI pri adenokarcinomu pljuč in pri mezoteliomu ter izdelati napovedni model za napoved občutljivosti/rezistence na zdravljenje z TKI. Proučili bomo tudi napovedno vrednost izraženosti ERCC1 in TOPO2 v primarnih tumorjih raka pljuč in mezotelioma za odgovor na posamezne citostatike, kot sta platinol in etopozid. Framakokinetiko peroralno in/ali intravenozno apliciranega etopozida bomo dodatno proučili z določitvijo koncentracij zdravila v plazmi ter z določitvijo polimorfizmov CYP3A encimov. Dodatno bomo določili prisotnost celic z ekspesijo genskih označevalcev za rakave matičen celice v krvi bolnikov z rakom pljuč. V raziskavo bo vključenih 330 bolnikov z rakom pljuč zdravljenih s standardnim sistemskim zdravljenjem na Univezitetni kliniki Golnik (UKG). Učinkovitost zdravljenja bomo določili po metodi RECIST in na podlagi preživetij. Paralelno bodo izdelani in udejanjeni standardi za biobanko tkivnih in krvnih vzorcev. Biološki označevalci na tkivu primarnega tumorja in v krvi bodo določeni v histološkem in molekularno biološkem laboratoriju UKG. Koncentracije zdravila v plazmi bodo določene z metodo tekočinske kromatografije. Napovedne modele za odgovor na določeno sistemsko terapijo, temelječe na prisotonosti večih biomarkerjev, bo s pomočjo standardnih statističnih orodij in s pomočjo metod umetne intelegence izdelala sodelujoča raziskovalna inštitucija. Pričakujemo, da bodo izsledki naše raziskave bistveno doprinesli k boljšemu razpoznavanju molekularne biologije raka pljuč in lastnosti gostitelja, ki lahko vplivajo na izhod sistemskega zdravljenja in tako v večji meri omogočili individualizacijo zdravljenja bolnikov s temi raki v vsakodnevni klinični praksi.</p>\r\n",
            "end_date": "2014-06-30 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630025",
                    "ime": "Ivan",
                    "priimek": "Bratko",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630855",
                    "ime": "Matej",
                    "priimek": "Guid",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630854",
                    "ime": "Martin",
                    "priimek": "Možina",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630690",
                    "ime": "Aleksander",
                    "priimek": "Sadikov",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630824",
                    "ime": "Jure",
                    "priimek": "Žabkar",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 5,
            "start_date": "2011-07-01 00:00:00",
            "title": "Molekularni in drugi označevalci raka pljuč in mezotelioma"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>It is generally accepted that one-to-one tutoring is by far more effective than in-class teaching, but too costly in most situations. To carry out one-to-one tutoring at reasonable cost, CAI (Computer Assisted Instruction) is an alternative. To overcome CAIs rigid behaviour, ITS (Intelligent Tutoring Systems) are generally considered as the most promising option. However, the costs of ITS development are high because it requires major involvement of a domain expert to realise intelligent student-system interaction. The purpose of this project is to develop methods for automating the process of developing ITS and thus considerably decrease the high costs of building ITS, by enabling more economical, semi-automatic development of  ITS.</p>\r\n<p>In particular, the main goals of the project is to develop methods to support automated conceptualisation of learning domains, which can be viewed as a key component in the construction of ITS systems. In the project, several experimental case studies in selected learning domains will be carried out from two types of domains: symbolic problem solving, like physics, medical reasoning and chess, and motor and/or control skill domains like running, walking in parients, or tennis.</p>\r\n<p>The role of domain conceptualisation is as follows. In complex domains, the connection between the basic domain theory (axioms, laws, formulas, rules of the game, etc.) and problem solutions is usually rather complex and hard for a human to execute. Therefore, there is typically a need for an intermediate theory, conceptualised domain theory,  that serves as a bridge between the basic declarative domain theory and procedural knowledge for concrete problem solving. This can be viewed in terms of a derivation chain as follows. Basic domain theory (axioms, etc.) logically entails a  conceptualised domain theory, which in turn entails problem solutions. Logically, the basic domain theory also entails problems solutions, but at much higher problem-solving effort. The basic theory is typically non-operational for a human (requires excessive computation, or it may be too complex to memorise), whereas the conceptualised theory is human-assimilable. These relations can be illustrated as follows:</p>\r\n<p> </p>\r\n<p>original theory ------------------------------------------&gt; problem solution</p>\r\n<p>original theory  ----&gt;  conceptualised theory ---&gt; problem solution</p>\r\n<p> </p>\r\n<p>A conceptualised domain is a problem solving tool for a human, and therefore it should be simple and compact, so that it can be understood, memorised, and executed in problem solving by the student.</p>\r\n<p>The planned conceptualisation methods will be based on some recent methods and paradigms of AI which will be adapted and further elaborated for the purpose of this project. These techniques and paradigms include: ABML (Argument Based Machine Learning) , QR (Qualitative Reasoning and modelling) , Q2 learning (Qualitatively faithful Quantitative learning), EBG and EBL (Explanation Based Generalisation and Learning), ILP (Inductive Logic Programming), and specific techniques of behavioural cloning (capturing human skill from observed humans behaviours).</p>\r\n<p>The developed conceptualisation methods will be experimentally applied to intelligent tutoring systems for selected domains as follows:</p>\r\n<p>(1) symbolic problem-solving domains: physics, medical diagnostic reasoning (diagnosis of tremors), and chess;</p>\r\n<p>(2) motor skill domains: running, tennis, walking in patients (multiple sclerosis)</p>\r\n<p>The AI part of the project will be carried out by the Artificial Intelligence Laboratory of Univ. of Ljubljana, and LMG laboratory of the Ljubljana Clinical Centre will collaborate in the neurological medical applications. These medical applications are expected to be directly adopted in the medical practice.</p>\r\n",
            "end_date": "2014-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630025",
                    "ime": "Ivan",
                    "priimek": "Bratko",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630855",
                    "ime": "Matej",
                    "priimek": "Guid",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630854",
                    "ime": "Martin",
                    "priimek": "Možina",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630690",
                    "ime": "Aleksander",
                    "priimek": "Sadikov",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630824",
                    "ime": "Jure",
                    "priimek": "Žabkar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": null,
                    "ime": "Zvezdan",
                    "priimek": "Pirtošek",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": null,
                    "ime": "Saša",
                    "priimek": "Šega Jazbec",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": null,
                    "ime": "Alenka",
                    "priimek": "Horvat",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": null,
                    "ime": "Uroš",
                    "priimek": "Rot",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2013-01-01 00:00:00",
            "title": "Machine learning for building intelligent tutoring systems: conceptualization of problem-solving domains"
        },
        "id": 60,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Splošno je sprejeto, da je posamično poučevanje bistveno bolj učinkovito kot poučevanje v razredu učencev, vendar predrago v večini situacij. Za ekonomično izvedbo posamičnega poučevanja je zato zanimiva alternativa poučevanje z računalniki (CAI, computer aided instruction). Vendar je CAI poučevanje zelo togo, zato se za najbolj obetavno možnost smatrajo inteligentni poučevalni sistemi (ITS, intelligent tutoring systems). Vendar je ovira spet v visoki ceni razvoja ITS sistemov, saj njihov razvoj zahteva obsežno sodelovanje področnega eksperta za realizacijo inteligentne interakcije med učencem in računalnikom. Glavni namen tega projekta je razviti metode, s katerimi bi bilo mogoče vsaj delno avtomatizirati gradnjo ITS sistemov in s tem bistveno znižati stroške gradnje.</p>\r\n<p>Glavni cilj projekta je razviti metode za avtomatsko konceptualizacijo učnih domen, kar je bistvena komponenta razvoja ITS sistemov. Izpeljali bomo tudi vrsto eksperimentalnih študij iz dveh tipov učnih domen: simbolično reševanje problemov, kot sta fizika in šah, ter domene motoričnih in kontrolnih spretnosti, kot jih najdemo pri pilotiranju, teku ali tenisu.</p>\r\n<p>Pomen konceptualizacije domen je v naslednjem.  V zahtevnih problemskih domenah je pot od osnovne teorije domene (aksiomi, zakoni, formule, pravila igre itd.) do rešitev problema pogosto zelo dolga in za človeka težko izvedljiva. Zato se značilno pojavi potreba po vmesni teoriji, konceptualizirani domenski teoriji, ki služi kot most med osnovno deklarativno teorijo in postopkovnim znanjem, potrebnim za reševanje konkretnih problemov. To pot lahko gledamo kot verigo izpeljav: iz osnovne teorije domene logično sledi konceptualizirana teorija, iz te pa naprej rešitev problema. Rešitev problema sledi tudi iz same osnovne teorije, vendar je ta pot veliko daljša. Tako je osnovna teorija tipično neoperativna za človeka (zahteva preveč računanja ali pa je preobsežna, da bi si jo učenec sploh lahko zapomnil), medtem ko konceptualizirano teorijo po definiciji človek lahko asimilira. Te relacije lahko ponazorimo takole:</p>\r\n<p> </p>\r\n<p>osnovna teorija ------------------------------------------&gt;  rešitev problema</p>\r\n<p>osnovna teorija ---&gt; konceptualizirana teorija ---&gt; rešitev problema</p>\r\n<p> </p>\r\n<p>Tako je konceptualizirana teorija učinkovito orodje za človeško reševanje problemov, zato pa mora biti enostavna in kompaktna, da jo lahko učenec razume, si jo zapomni in uporabi pri reševanju konkretnih problemov. Poleg metod konceptualizacije se bomo posvetili tudi metodam avtomatskega generianja komentarjev rešitev v luči uporabljene knceptualizacije.</p>\r\n<p>Kot tehnično osnovo za razvoj in implementacijo metod konceptualizacije nameravamo uporabiti nekatere novejše tehnike in paradigme umetne inteligence, ki jih nameravamo dopolniti oz. nadgraditi za potrebe konceptualizacije. Med temi so: argumentirano strojno učenje (ABML; Argument Based Machine Learning), kvalitativno sklepanje in modeliranje (QR; Qualitative Reasoning and modelling), Q2 učenje (Qualitatively faithful Quantitative learning), generalizacija in učenje z razlago (EBG, EBL; Explanation Based Generalisation and Learning), induktivno logično programiranje (ILP; Inductive Logic Programming), ter specifične tehnike za vedenjsko kloniranje (zajemanje človeških motoričnih/kontrolnih veščin).</p>\r\n<p>Razvite metode konceptualizacije bomo eksperimentalno uporabili na izbranih domenah poučevanja z ITS kot sledi:</p>\r\n<p>(1) simbolno reševanje problemov: fizika, medicinsko diagnostično sklepanje (diagnostika tremorjev) in šah;</p>\r\n<p>(2) motorične spretnosti: tek, tenis in hoja pri bolnikih (multipla skleroza).</p>\r\n<p> </p>\r\n<p>Raziskave iz umetne inteligence v tem projektu bo izvajal Laboratorij za umetno inteligenco Univerze v Ljubljani, medtem ko bo Laboratorij za motnje gibanja Kliničnega centra v Ljubljani sodeloval pri medicinskih aplikacijah. Pričakujemo, da bosta obe medicinski aplikaciji neposredno postali del klinične prakse.</p>\r\n",
            "end_date": "2014-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630025",
                    "ime": "Ivan",
                    "priimek": "Bratko",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630855",
                    "ime": "Matej",
                    "priimek": "Guid",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630854",
                    "ime": "Martin",
                    "priimek": "Možina",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630690",
                    "ime": "Aleksander",
                    "priimek": "Sadikov",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630824",
                    "ime": "Jure",
                    "priimek": "Žabkar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": null,
                    "ime": "Zvezdan",
                    "priimek": "Pirtošek",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": null,
                    "ime": "Saša",
                    "priimek": "Šega Jazbec",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": null,
                    "ime": "Alenka",
                    "priimek": "Horvat",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": null,
                    "ime": "Uroš",
                    "priimek": "Rot",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2013-01-01 00:00:00",
            "title": "Strojno učenje v gradnji inteligentnih sistemov za poučevanje: konceptualizacija domen simboličnega reševanja problemov"
        }
    }
]