[{"id": 57, "si": {"title": "Modeliranje kompleksnih dinamičnih problemov z metodami mehkega računanja", "description": "<p>Obstaja mnogo kompleksnih dinamičnih sistemov, ki jih želimo nadzirati in/ali krmiliti. Ker slednji običajno niso teoretično obvladljivi, se pri modeliranju odločamo za adaptivni pristop. Tehnike mehkega računanja, ki obsegajo umetne nevronske mreže, evolucijske algoritme, mehko logiko in druge naravne algoritme, predstavljajo aktualne metode za reševanje takšnih problemov, med katerimi so najbolj znani razpoznavanje, klasificiranje, optimizacija, identifikacija in simulacija. Zgrajeni modeli nam nato lahko služijo kot podlaga za zaprto-zančno vodenje teh kompleksnih sistemov.</p>\r\n<p>Izbira relevantnih vhodov v model je pomembna naloga, ki jo lahko rešujemo na različne načine, na primer s klasičnimi postopki (korelacijska, spektralna analiza), z analizo povprečne medsebojne informacije med vhodi in izhodi ali s preoblikovanjem podatkov (metode PCA, ICA). Ti algoritmi so nadzorovani s posebnimi cenilnimi funkcijami, ki izhajajo iz napak med dejanskimi izhodi in izhodi modela. V primeru, da porazdelitev napak ne sledi normalni porazdelitvi, je potrebno namesto srednje kvadratne napake vzeti za cenilno funkcijo višjih redov, na primer informacijski meri entropijo in divergenco. Tedaj so postopki učenja/evolucije še posebej zahtevni v smislu procesorskega časa, kar implicira paralelno programiranje/procesiranje.</p>\r\n<p>Za nekaj praktičnih aplikacij, ki sodijo v kategorijo kompleksnih dinamičnih problemov bomo iskali najprimernejše metode sinteze modelov za krmiljenje, ob upoštevanju značilnosti omenjenih naravnih algoritmov, najprimernejših cenilnih funkcij in orodij za paralelno programiranje/procesiranje na različnih nivojih strojne opreme. Na osnovi predhodnih analiz bo sledila realizacija izbranih modelov in njihovo testiranje.</p>\r\n<p>Zadnje aktivnosti iz zgornjega področja raziskav lahko razdelimo v tri konkretne sklope: (i) paralelna implementacija informacijsko-teoretičnega procesiranja na grafičnih procesorjih, (ii) razvoj novih postopkov za razvrščanje podatkov na osnovi ansambelskega pristopa in (iii) snovanje informacijskega procesiranja v živih celicah z umetnimi genskimi represorji.</p>\r\n", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Javna agencija za raziskovalno dejavnost RS", "project_id": "", "project_link": "", "start_date": "2010-01-01 00:00:00", "end_date": "2011-12-31 00:00:00", "persons": [{"id": "630046", "role": "Vodja projekta", "ime": "Andrej", "priimek": "Dobnikar"}, {"id": "630920", "role": "Sodelavec na projektu", "ime": "Nejc", "priimek": "Ilc"}, {"id": "630687", "role": "Sodelavec na projektu", "ime": "Uroš", "priimek": "Lotrič"}, {"id": "630943", "role": "Sodelavec na projektu", "ime": "Davor", "priimek": "Sluga"}, {"id": "630502", "role": "Sodelavec na projektu", "ime": "Branko", "priimek": "Šter"}], "ref_project_type": 2, "logo": null, "menu_picture": null, "project_picture": null}, "en": {"title": "Modeling of complex dynamic systems with soft computing methods", "description": "<p>We are faced with many complex dynamic systems that need to be observed and/or controlled. As they are usually not fully theoretically tractable, we have to make their approximate models. The soft-computing techniques involving neural networks, evolutionary algorithms, fuzzy logic, and other natural computing algorithms are the state-of-art methods for solving complex problems like recognition, classification, optimization, identification, and simulation. These models then present a basis for closed-loop control of the complex systems.</p>\r\n<p>The choice of the relevant inputs to the model is an important task, that can be solved either with classical techniques (correlation, spectral analysis), with analysis of average mutual information between inputs and outputs or with transformation of input data (PCA, ICA). These algorithms are controlled by some cost functions that are usually related to the error of the actual and model outputs. In a case when the error distribution does not follow the normal distribution, one has to use other criteria functions, like information entropy and divergence. Then, the learning/evolving procedures are very demanding in terms of the processing power, which implies the use of a parallel programming/processing approach.</p>\r\n<p>For some applications we shall look for the most appropriate synthesis methods for their modeling, by taking into account natural based algorithms, information related cost functions and tools for parallel programming and/or processing on different levels of hardware. Based on the preliminary analysis the chosen models will be implemented and tested.</p>\r\n<p>Last activities from above areas of research can be divided into three actual works: (i) parallel implementations of information-theoretic processing on graphics processing units, (ii) development of new methods for data clustering based on ensemble approach, and (iii) design of information processing in living cells with artificial gene repressors.</p>\r\n", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Javna agencija za raziskovalno dejavnost RS", "project_id": "", "project_link": "", "start_date": "2010-01-01 00:00:00", "end_date": "2011-12-31 00:00:00", "persons": [{"id": "630046", "role": "Vodja projekta", "ime": "Andrej", "priimek": "Dobnikar"}, {"id": "630920", "role": "Sodelavec na projektu", "ime": "Nejc", "priimek": "Ilc"}, {"id": "630687", "role": "Sodelavec na projektu", "ime": "Uroš", "priimek": "Lotrič"}, {"id": "630943", "role": "Sodelavec na projektu", "ime": "Davor", "priimek": "Sluga"}, {"id": "630502", "role": "Sodelavec na projektu", "ime": "Branko", "priimek": "Šter"}], "ref_project_type": 2, "logo": null, "menu_picture": null, "project_picture": null}}]