[
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "The impact of technological development and digitalization in the field of communications and information processing, greatly influenced the realm of medical science, especially in the computer-aided diagnosis. The use of digital radiology in the past decade greatly accelerates the process of diagnosis and reduces the cost of storing large amounts of data. In addition, the digital radiology opened up new opportunities for research on large amounts of data.  Medical images play a central role in patient diagnosis, therapy, surgical planning, medical reference, and training. With the advent of digital imaging modalities, as well as images digitized from conventional devices, collections of medical images are increasingly being held in digital form. It becomes increasingly expensive to manually annotate medical images. Consequently, automatic medical image annotation becomes important. In addition to medical image processing, an increasing need for processing large quantities of medical video clips and their use in diagnosis has increased in recent years. Due to the large number of the video frames without text information, content-based medical image retrieval (CBMIR) has received increased attention. The demand for automatically annotating and retrieving medical images and videos is growing faster than ever. Technological developments have enabled the use of small cameras that capture video clips in high resolution, allowing for a minimally invasive or even non-invasive procedure in patients. The best example of this use of modern technologies is the use of cameras for endoscopic examinations. These devices can capture long video sequences, which can then be processed and used in the detection of early stages of tumors and internal bleedings. Recently, the use of capsule endoscopy has become a way to record images of the digestive tract. The capsule is the size and shape of a pill and contains a tiny camera. After a patient swallows the capsule, it takes pictures of the inside of the gastrointestinal tract. The capsule can record a few hours of videos and the processing time of such a video is extremely large, making the analysis extremely difficult. This usually leads to failure in the detection od regions of interest. Manually processing the database that contains a large quantity of medical video clips has become very time consuming task with high potential for error in the interpretation of the content. Therefore, it is extremely important to explore the possibility of automatic detection of areas showing pathological changes or indicate the possibility that pathological changes occur. This would allow for faster and more reliable diagnosis. Automatic identification of regions of interest highly depends on the image retrieval and image classification.",
            "end_date": "2015-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630018",
                    "ime": "Jure",
                    "priimek": "Bordon",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630645",
                    "ime": "Patricio",
                    "priimek": "Bulić",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630963",
                    "ime": "Rok",
                    "priimek": "Češnovar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630687",
                    "ime": "Uroš",
                    "priimek": "Lotrič",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630943",
                    "ime": "Davor",
                    "priimek": "Sluga",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630276",
                    "ime": "Mira",
                    "priimek": "Trebar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630719",
                    "ime": "Tom",
                    "priimek": "Vodopivec",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2014-01-01 00:00:00",
            "title": "Automatic annotation of medical video sequences"
        },
        "id": 54,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Vpliv tehnološkega razvoja ter digitalizacija na področju komunikacij in obdelave informacij močno vplivata tudi na področje medicinskih ved, posebej v luči računalniško podprte diagnostike. Uporaba digitalne radiologije v preteklem desetletju močno pospešila proces diagnostike ter reducirala stroške hranjenja velike količine podatkov. Poleg tega je digitalna radiologija odprla nove možnosti za raziskave na velikih količinah podatkov. Svetovni trendi na tem področju obsegajo nenehne izboljšave ter pohitritve algoritmov za obdelavo velike količine medicinskih slik. Poleg obdelave medicinskih slik, v zadnjih letih narašča potreba po obdelavi velike količine medicinskih video posnetkov ter njihova uporaba v diagnostiki.</p>\r\n\r\n<p>Tehnološki razvoj je omogočil uporabo majhnih kamer, ki zajemajo video posnetke v visoki resoluciji, pri čemer zagotavljajo minimalno invazivne ali celo neinvazivne posege pri pacientih. Najboljši primer tovrstne uporabe modernih tehnologij je uporaba kamer pri endoskopskih in gastroskopskih pregledih. Pri teh postopkih lahko zajamemo daljše video sekvence, ki jih je nato potrebno obdelati ter uporabiti pri detekciji začetnih stadijev tumorjev, notranjih krvavitev ipd. Zadnja leta je posebej zanimiva uporaba miniaturnih kamer, ki se v telo vnašajo s tabletami. Le te omogočajo nekajurne video posnetke, katerih obdelava in pregledovanje je časovno izredno zahtevna. Ravno zaradi časovne zahtevnosti pri obdelavi velike količine video sekvenc prihaja do neuspešnih detekcij področij interesa, tj. področij na katerih so jasno vidne patološke spremembe.</p>\r\n\r\n<p>Tendenca raziskav na področju obdelave medicinskih video signalov in slik se nanaša predvsem na njihovo klasifikacijo, tj. izločanje slik in video sekvenc, ki so zanimive s stališča nadaljnje diagnostike. Po drugi strani pa je razvoj digitalne tehnike omogočil hiter in nepričakovan  porast baz medicinskih slik in video zapisov. Pregledovanje baz je postalo časovno zelo zahtevno opravilo z veliko možnostjo napak pri tolmačenju vsebine. Zato je izjemno pomembno raziskati možnosti avtomatske detekcije področij, ki kažejo patološke spremembe ali kažejo možnost, da do patoloških sprememb pride. To bi omogočilo hitrejšo in zanesljivejšo diagnostiko. Avtomatsko označevanje področij interesov je tako zelo odvisna od klasifikacije medicinskih slik in video posnetkov. Razvoj avtomatskega označevanja področij interesov bi tako omogočil hitrejšo in enostavnejšo obdelavo dolgih video zapisov.</p>\r\n",
            "end_date": "2015-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630018",
                    "ime": "Jure",
                    "priimek": "Bordon",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630645",
                    "ime": "Patricio",
                    "priimek": "Bulić",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630963",
                    "ime": "Rok",
                    "priimek": "Češnovar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630687",
                    "ime": "Uroš",
                    "priimek": "Lotrič",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630943",
                    "ime": "Davor",
                    "priimek": "Sluga",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630276",
                    "ime": "Mira",
                    "priimek": "Trebar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630719",
                    "ime": "Tom",
                    "priimek": "Vodopivec",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": "",
            "project_link": "",
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2014-01-01 00:00:00",
            "title": "Samodejno označevanje medicinskih video zapisov"
        }
    },
    {
        "en": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>The number of sensors that collect information about the environment is constantly increasing. The amount of information obtained from the sensors is constantly increasing, also. For example, information obtained is ambient conditions, health status of the patient, video sequences from surveillance systems, aero and satellite images, and the like. Wireless sensors networks play an important role in the collection of large amounts of data. The sensors network is made up of a large number of sensor nodes, which are distributed in an environment, which is monitored. Sensor nodes frequently sense ambient conditions such as humidity, light, pressure, sound pressure level, presence of natural barriers etc. Recently, we have witnessed the expansion of the use of body sensor networks, which monitor the health status of patients and elderly people (temperature, pressure, ECG, blood sugar, bio-impedance) and prevent deterioration of health condition.</p>\r\n<p>These examples demonstrate a wide range of applications of sensor networks. Recent developments in electronics, digital signal processing and computer hardware allow for capture of large amounts of information in the real time. Almost daily new techniques of signal acquisition appear. Therefore, we are constantly looking for effective methods for signal processing, analysis and interpretation of the information obtained.</p>\r\n<p>The purpose of this research is to find new and effective methods of digital signal processing and information analysis and interpretation for signals and data obtained in sensor networks. Also, we will search for the appropriate hardware platform for their implementation. The effectiveness of the proposed algorithms will be mainly reflected in the ability to extract useful information from a large amount of data obtained from the sensor network and to determine the actual state of the object, which is monitored, and eventually to take appropriate decisions. Algorithms should be time, space (memory) and energy efficient. Moreover, given the large amount of information acquired from the sensor networks we will also focus on the effective use of distributed and parallel computation (e.g. GPGPU). Research for this project will be highly multidisciplinary as it covers the area of digital signal processing, computer hardware, electronics, telecommunications, system software, bioengineering, medicine, biology, etc.</p>\r\n",
            "end_date": "2017-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630018",
                    "ime": "Jure",
                    "priimek": "Bordon",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630645",
                    "ime": "Patricio",
                    "priimek": "Bulić",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630963",
                    "ime": "Rok",
                    "priimek": "Češnovar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630943",
                    "ime": "Davor",
                    "priimek": "Sluga",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630719",
                    "ime": "Tom",
                    "priimek": "Vodopivec",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2016-01-01 00:00:00",
            "title": "Signal and information processing systems in sensor networks"
        },
        "id": 203,
        "si": {
            "client": "Javna agencija za raziskovalno dejavnost RS",
            "description": "<p>Število senzorjev, ki zbirajo informacije o okolju, se stalno zvišuje. Prav tako se zvišuje količina pridobljene informacije, npr. ambientalni pogoji, zdravstveno stanje pacientov, video sekvence iz nadzornih sistemov, aero in satelitski posnetki, ipd.</p>\r\n<p>Pomembno mesto v zbiranju velike količine podatkov imajo v zadnjem času senzorska omrežja. Ta so sestavljena iz velikega števila senzorskih vozlišč, ki so porazdeljeni v območju, ki ga spremljamo. Senzorska vozlišča najpogosteje spremljajo ambientalne pogoje, kot so vlaga, osvetlitev, pritisk, nivo glasnosti, prisotnost fizičnih preprek ipd. V zadnjem času pa smo priča ekspanziji uporabe t.i. telesnih senzorskih omrežij (Body Sensor Network) pri spremljanju zdravstvenega stanja oseb (telesna temperatura, pritisk, EKG, nivo sladkorja, bioimpedanca) ter preprečevanju poslabšanja le-tega. </p>\r\n<p>Navedeni primeri demonstrirajo širok spekter uporabe senzorskih omrežij. Razvoj na področju elektronike, digitalne obdelave signalov ter računalniške strojne opreme omogoča zajem velike količine informacije v realnem času. Skoraj dnevno se pojavljajo novi modeli akvizicije signalov. Zato se nenehno iščejo učinkovite metode za obdelavo signalov ter analizo in interpretacijo pridobljene informacije.</p>\r\n<p>Namen te raziskave je iskanje novih in učinkovitih metod za obdelavo in analizo informacije in signalov pridobljenih v senzorskih omrežjih ter tudi v iskanje ustreznih hardverskih platform za njihovo implementacijo. Učinkovitost obdelave se kaže predvsem v zmožnosti, da se iz velike količine pridobljenih podatkov ugotovi dejansko stanje objekta, ki se ga spremlja, ter se na osnovi tega sprejmejo ustrezne odločitve. Algoritmi morajo biti časovno učinkoviti ter taki, da porabijo čimmanj pomnilnika in energije. Poleg tega, glede na veliko količino informacije, ki jo pridobimo iz senzorskih omrežij, je uporaba distribuiranega in paralelnega računanja (npr. GPGPU) nuja. Raziskave v okviru tega projekta bodo izrazito multidisciplinarne, saj pokrivajo področje obdelave signalov, računalniškega hardverja, elektronike, telekomunikacije, sistemske programske opreme, bioinženiringa, medicine, biologije, ipd.</p>\r\n",
            "end_date": "2017-12-31 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630018",
                    "ime": "Jure",
                    "priimek": "Bordon",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630645",
                    "ime": "Patricio",
                    "priimek": "Bulić",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630963",
                    "ime": "Rok",
                    "priimek": "Češnovar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630943",
                    "ime": "Davor",
                    "priimek": "Sluga",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630719",
                    "ime": "Tom",
                    "priimek": "Vodopivec",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": 2,
            "start_date": "2016-01-01 00:00:00",
            "title": "Sistemi za obdelavo signalov in informacij v senzorskih omrežjih"
        }
    },
    {
        "en": {
            "client": "C-Path",
            "description": "<p>This project is the research and implementation of a software package for R that allows the user to run statistical models that are parallelized on a graphical processing unit. As part of this project, we will implement the framework and a model - the generalized logistic based model that is being used as the underlying model for the Critical path for Parkinsons clinical trial simulation tool. </p>\r\n\r\n",
            "end_date": "2019-07-25 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630963",
                    "ime": "Rok",
                    "priimek": "Češnovar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630943",
                    "ime": "Davor",
                    "priimek": "Sluga",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630898",
                    "ime": "Erik",
                    "priimek": "Štrumbelj",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630555",
                    "ime": "Gregor",
                    "priimek": "Pirš",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": null,
            "start_date": "2019-03-25 00:00:00",
            "title": "Hypercomputing for Critical Path Parkinsons Consortium"
        },
        "id": 1597,
        "si": {
            "client": "C-Path",
            "description": "<p>Projekt so raziskave in implementacija programskega paketa za R, ki uporabnikom omogoča uporabo statističnih modelov, ki so paralelizirani na grafičnih procesnih enotah. V okviru tega projekta bomo implementirali ogrodje in en model - model s posplošeno logistično funcijo, ki se uporablja kot jedro orodja za klinične simulacije v konzorciju Critical path za Parkinsonovo bolezen.</p>\r\n\r\n\r\n",
            "end_date": "2019-07-25 00:00:00",
            "logo": null,
            "menu_picture": null,
            "persons": [
                {
                    "id": "630963",
                    "ime": "Rok",
                    "priimek": "Češnovar",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630943",
                    "ime": "Davor",
                    "priimek": "Sluga",
                    "role": "Sodelavec na projektu"
                },
                {
                    "id": "630898",
                    "ime": "Erik",
                    "priimek": "Štrumbelj",
                    "role": "Vodja projekta"
                },
                {
                    "id": "630555",
                    "ime": "Gregor",
                    "priimek": "Pirš",
                    "role": "Sodelavec na projektu"
                }
            ],
            "proj_events": null,
            "proj_news": null,
            "proj_publications": null,
            "proj_research": null,
            "project_id": null,
            "project_link": null,
            "project_picture": null,
            "ref_project_type": null,
            "start_date": "2019-03-25 00:00:00",
            "title": "Raziskovalno delo"
        }
    }
]