[{"id": 388, "si": {"title": "GETM3 - Global Entrepreneurial Talent Management", "description": null, "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Evropska komisija", "project_id": "GETM3", "project_link": null, "start_date": "2017-01-01 00:00:00", "end_date": "2020-12-31 00:00:00", "persons": [{"id": "630770", "role": "Vodja projekta na FRI", "ime": "Tomaž", "priimek": "Hovelja"}], "ref_project_type": 1, "logo": null, "menu_picture": null, "project_picture": null}, "en": {"title": "GETM3 - Global Entrepreneurial Talent Management", "description": "<p>GETM3 focuses on young talent as a key driver of future development, developed through co-operation of 3 stakeholders: employers (inc MNC &amp; SMEs), universities and students/graduates. Despite a widely recognized importance of young talent (e.g. Europe 2020), its potential remains largely untapped. They are educated and entrepreneurial and yet experience instability in employment. At the same time, employers report skills mismatch and difficulties with attracting, managing and retaining young talent. To tackle this paradoxical situation, an innovative, multi-perspective approach is needed, reinforced by our 15 partner consortium; comprising of a transnational, inter-disciplinary, inter-generational, gender balanced and inter-sectorial research team.</p>\r\n<p>The main objective of GETM3 is to improve employability and future global talent management to support economic development by capitalizing on entrepreneurialism as a key characteristic of the young. To achieve this objective, the project is divided into six work packages. Three WPs focus on in-depth research of specific issues from each of the stakeholder perspectives. The Integration and Innovation WP, essential for impact, aims to integrate research outputs and develop GETM3 across dimensions: generations, genders, disciplines, countries, sectors and stakeholders. The overall design of the project builds impact through researcher mobility in two ways: researchers will gain first hand and in-depth insights on specific issues from various perspectives, and will develop their skills through networking and training incorporated into mobility with sandpit events.</p>\r\n\r\n<p>Key facts:</p>\r\n<p>Project value: 1.318.500,00 EUR</p>\r\n<p>EU contribution: 1.048.500,00 EUR</p>\r\n\r\n<p>Project partners:</p>\r\n<p>UNIVERSITY OF NORTHUMBRIA AT NEWCASTLE, whose principal office address is Sutherland Building, College Street, Newcastle upon Tyne, NE1 8ST, the Coordinator </p>\r\n<p>UNIVERSITY OF LJUBLJANA whose principal office address is Kongresni trg 12, 1000 Ljubljana, Slovenia</p>\r\n<p>UNIVERSITY OF WARSAW whose principal office address is KRAKOWSKIE PRZEDMIESCIE 26/28 Street, 00-927 Warsaw, Poland </p>\r\n<p>WARSAW UNIVERSITY OF TECHNOLOGY whose principal office address is Politechnika Warszawska, Plac Politechniki1, 00 661 Warszawa, Poland</p>\r\n<p>DUBLIN INSTITUTE OF TECHNOLOGY whose principal office address is Cathal Brugha St, Dublin 1, Ireland,</p>\r\n<p>DUBLIN CITY UNIVERSITY whose principal office address is Glasnevin, Dublin 9, Ireland</p>\r\n<p>with UNIVERSITY OF NORTHUMBRIA, UNIVERSITY OF LJUBJALANA, UNIVERSITY OF WARSAW, WARSAW UNIVERSITY OF TECHNOLOGY, DUBLIN INSTITUTE OF TECHNOLOGY and DUBLIN CITY UNIVERSITY hereinafter referred to jointly as the Academic Members</p>\r\n<p>KOLEKTOR ETRA ENERGETSKI TRANSFORMATORJI D.O.O a company [whose office address is at Slandrova Ulica 10, 1231 Ljubljana, Slovenia</p>\r\n<p>MEDEX a company [whose office address is Linhartov Cesta 49 a, 1000 Ljubljana, Slovenia</p>\r\n<p>ELIESHA TRAINING LIMITED a limited company registered in England and Wales under company number 04161029 and whose registered office address is Churchill House, Churchill Way, Cardiff, CF10 2HH,</p>\r\n<p>ISME LTD a company whose office address is 17 Kildare Street, Dublin 2, Ireland,</p>\r\n<p>SODEXO POLAND a company whose office address is Spolka z 00 ul. Dawn 137, 02-231 Warszawa</p>\r\n<p>FUNDACJAKREATYWNE MAZOWSZE a company [whose officeaddress is ul. Domaniewska 17/19 lok. 133, 02-672 Warszawa, Poland and</p>\r\n<p>with KOLEKTOR ETRA ENERGETSKI TRANSFORMATORJI D.O.O., MEDEX, ELIESHA TRAINING LIMITED, ISME LTD, SODEXO POLAND and FUNDACJA KREATYWNE MAZOWSZE hereinafter jointly referred to as the Non-academic Members. </p>\r\n\r\n<p>Sodelavci na projektu</p>\r\n<p>doc. dr. Tomaž Hovelja https://fri.uni-lj.si/sl/o-fakulteti/osebje/tomaz-hovelja </p>\r\n<p>doc. dr. Damjan Vavpotič https://fri.uni-lj.si/sl/o-fakulteti/osebje/damjan-vavpotic</p>\r\n", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Evropska komisija", "project_id": "GETM3", "project_link": null, "start_date": "2017-01-01 00:00:00", "end_date": "2020-12-31 00:00:00", "persons": [{"id": "630770", "role": "Vodja projekta na FRI", "ime": "Tomaž", "priimek": "Hovelja"}], "ref_project_type": 1, "logo": null, "menu_picture": null, "project_picture": null}}]