[{"id": 539, "si": {"title": "Obogatena resničnost in droni v arheologiji: učinkovita izraba geo-lociranih multimedijskih vsebin ", "description": "<p>V okviru projekta stremimo k zagotavljanju pametnega usposabljanja na primeru arheološkega odkrivanja z združevanjem anpradne tehnologije na področju pregledovanja terena iz zraka in obogatenih vizualizacij. Na arheoloških območjih lahko najdemo več tipov geolociranih multimedijskih navideznih vsebin, ki so združene z zračnimi videoposnetki, ki uporabniku prikazujejo iluzijo potovanja skozi čas. Uporabnik bo potopljen v scenarij z uporabo vizuelnih znakov, kot tudi prostorskega zvoka, sestavljenega iz zvokov in glasbe prikazanega obdobja. Zvočni znaki bodo ponujali dodaten nivo informacij in izboljšali uporabniško dojemanje obogatenih scenarijev.</p>\r\n\r\n<p>Projekt naslavlja trenutne potrebe po zagotavljanju modelov, procesov in storitev, usmerjenih k pametnejši valorizaciji kulturne dediščine z namenom izboljšanja izkušnje kulturnega uživanja in promoviranja turizma.</p>\r\n\r\n\r\n", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Salento University", "project_id": null, "project_link": null, "start_date": "2018-09-01 00:00:00", "end_date": "2020-08-31 00:00:00", "persons": [{"id": "630899", "role": "Sodelavec na projektu", "ime": "Ciril", "priimek": "Bohak"}, {"id": "630537", "role": "Sodelavec na projektu", "ime": "Alenka", "priimek": "Kavčič"}, {"id": "630565", "role": "Vodja projekta", "ime": "Matija", "priimek": "Marolt"}, {"id": "630984", "role": "Sodelavec na projektu", "ime": "Matevž", "priimek": "Pesek"}, {"id": "630560", "role": "Sodelavec na projektu", "ime": "Žiga", "priimek": "Lesar"}], "ref_project_type": 2, "logo": null, "menu_picture": null, "project_picture": null}, "en": {"title": "Augmented Reality and Drones in Archaeology: Smart Fruition and Geo-localized Multimedia Contents", "description": "<p>In this project, we aim to provide a smart fruition of the archaeological heritage by combining the advantages of aerial exploration with augmented visualization. Several types of multimedia virtual contents are geo-localized in the archaeological area and superimposed on the aerial video of the area giving to the user an illusion of a journey through time. The user will be immersed in the scenario through visual cues, as well as 3D audio, consisting of sounds or music typical of the time period in question. Audio cues will provide an additional layer of information and will improve the users sense of immersion in the augmented scenario.</p>\r\n\r\n<p>The project is oriented towards the current need of providing models, processes and services directed towards a smarter valorisation and fruition of the cultural heritage in order to enhance the experience of cultural enjoyment and promote tourism.</p>\r\n<p>---</p>\r\n\r\n\r\n", "proj_news": null, "proj_events": null, "proj_research": null, "proj_publications": null, "client": "Salento University", "project_id": null, "project_link": null, "start_date": "2018-09-01 00:00:00", "end_date": "2020-08-31 00:00:00", "persons": [{"id": "630899", "role": "Sodelavec na projektu", "ime": "Ciril", "priimek": "Bohak"}, {"id": "630537", "role": "Sodelavec na projektu", "ime": "Alenka", "priimek": "Kavčič"}, {"id": "630565", "role": "Vodja projekta", "ime": "Matija", "priimek": "Marolt"}, {"id": "630984", "role": "Sodelavec na projektu", "ime": "Matevž", "priimek": "Pesek"}, {"id": "630560", "role": "Sodelavec na projektu", "ime": "Žiga", "priimek": "Lesar"}], "ref_project_type": 2, "logo": null, "menu_picture": null, "project_picture": null}}]